[{"gross_exam": "Piesa 1:In acelasi recipient au sosi doua fragmente.Primul fragment are dimensiuni de 5,4/6/2,8 cm, de aspect lipomatos, care are atasat lambou cutanat de 5,3/1,4 cm.Al doilea fragment masoara 3,7/2,2/1,1 cm si are aspect lipomatos.", "microscopic_exam": "Materialul examinat este reprezentat de o formatiune tumorala benigna alcatuita din adipocite fara atipii citologice si fara arii de necroza tumorala.", "diagnosis": "Lipom.", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 5/2,5/1,5 cm, reprezentate de tesut adipos.", "microscopic_exam": "Materialul examinat este reprezentat de fragmente de tesut adipos fara atipii citologice si fara arii de necroza tumorala. Sunt prezente vase cu staza redusa.", "diagnosis": "Aspectul histopatologic descris, coroborat cu datele clinice, este compatibil cu diagnosticul de lipom.", "doctor": 43}, {"gross_exam": "Piesa cu dimensiuni de 10/7/4,5 cm, reprezentata de tesut adipos incapsulat si lambou cutanat atasat de 8/2,2 cm.", "microscopic_exam": "Materialul examinat este reprezentat de o formatiune tumorala benigna alcatuita din adipocite fara atipii citologice.", "diagnosis": "Lipom", "doctor": 44}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,7/0,4/0,2 cm, respectiv 0,3/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica. Aceastea au arhitectura criptelor pastrata si nu prezinta atipii citologice. Corionul prezinta edem redus si congestie vasculara moderata.", "doctor": 32}, {"gross_exam": "Piesa 1:Piesa cu dimensiuni de 0,7/0,3/0,2 cm.Piesa 2:Piesa cu dimensiuni de 0,3/0,2/0,2 cm", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica care prezinta focal eroziuni acoperite de material muco-fibrinos, subiacent carora se observa microhemoragii. Corionul contine minim infiltrat inflmator limfo-plasmocitar si vase cu congestie minima.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica, care prezinta intr-o margine o arie mica unde epiteliul criptelor are aspect hiperplazic. Focal se observa decolari epiteliale, insa fara modificari reactive sau inflamatorii. Corionul prezinta congestie vasculara moderata si edem redus.", "diagnosis": "Polip hiperplazic", "doctor": 35}, {"gross_exam": "Materialul primit, prelucrat in totalitate, este reprezentat multiple fragmente de epiteliu scuamos care prezinta leziune intaepiteliala scuamoasa de grad inalt (, CIN III), reprezentata pleomorfism nuclear marcat, index mitotic crescut si arii cu diskeratoza. Majoritatea fragmentelor nu contin stroma atasata pentru a putea evalua prezenta sau absenta invaziei.", "diagnosis": "Leziuni scuamoase intraepiteliale de grad inalt (HSIL, CIN III). Comentarii:Nu se poate exclude un carcinom invaziv.", "medical_codes": "ICD-O: 8077/2", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/1/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala alcatuite din stroma si glande aflate in faza proliferativa a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 28}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit multiple fragmente care cumulat masoara 2,5/2/0,4 cm.Piesa 2:Fragment cu dimensiuni de 1/0,5/0,5 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de endometru aflate in faza proliferativa a ciclului endometrial si care prezinta focal raportul glande/stroma usor crescut, cu glandele dispuse aglomerat, separate de o rama subtire de stroma. Unele fragmente prezinta la nivelul stromei aglomerari vasculare cu perete ingrosat.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala.", "diagnosis": "Polip endometrial", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2,3/2/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala aflata in faza secretorie a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 30}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit multiple fragmente care cumulat masoara 3/1,2/0,4 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoasa 1/0,4/0,3 cm", "microscopic_exam": "Piesa 1Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare, care inglobeaza fragmente de mucoasa endometriala aflata in faza proliferativa a ciclului endometrial.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de 4 fragmente reprezentate mucoasa endo si exocervicala. Unul dintre fragmente prezinta leziuni scuamoase intraepiteliale de grad inalt (HSIL, CIN III) si metaplazie scumoasa matura cu extensie pe glandele endocervicale.", "diagnosis": "Leziuni scuamoase intraepiteliale de grad inalt (HSIL CIN III) ", "medical_codes": "ICD-O: 8077/2.", "doctor": 30}, {"gross_exam": "Piesa de excizie tegumentara cu dimensiuni de 1,7/0,7/0,7 cm, care prezinta pe suprafata o formatiune tumorala cu dimensiuni de 1/0,4 cm. Formatiunea tumorala prezinta o zona de aspect conopidiform, polipoid situata tangent la marginea de rezectie laterala.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument cu acantoza epidermala si cu hiperpigmentarea stratului bazal.", "diagnosis": "Keratoza seboreica hiperpigmentata.", "doctor": 29}, {"gross_exam": "Piesa de punch biopsie cu dimensiuni de 0,5/0,4/0,6 cm, care prezinta pe suprafata o arie mica violacee, ombilicata.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument care contine o structura foliculara dilatata, cu stratul granular pastrat, peretii usor acantotici si cu continut de keratina. Adiacent se observa rare proiectii digitiforme de epiteliu scuamos emergente din structura foliculara. Dermul inconjurator prezinta infiltrat inflamtor limfo-plasmocitar dispus difuz in cantitate redusa. Pe sectiunile examinate nu se observa atipii citologice sau arhitecturale.Leziunea este excizata in totalitate.", "diagnosis": "Aspectul histopatologic descris este compatibil cu porul dilatat al lui Winer.", "doctor": 30}, {"gross_exam": "In acelasi recipient au sosit trei fragmente cu dimensiuni de 0,3/0,3/0,2 cm, 0,5/0,3/0,3 cm, respectiv 0,5/0,4/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa colonica cu modificari arhitecturale si citologice sugestive pentru adenomul tubular cu grad redus de displazie.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 34}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1/0,4 cm.", "microscopic_exam": "\tMaterialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare care inglobeaza multiple fragmente de epiteliu scuamos si rare structuri glandulare endometriale de aspect inactiv. Fragmentele de epiteliu scuamos nu prezinta atipii citologice sau arhitecturale pe sectiunile examinate.comentariiMaterialul endometrial este insuficient pentru incadrarea intr-o entitate clinico-patologica specifica.", "doctor": 28}, {"gross_exam": "Piesa 1:Piesa de excizie tegumentara cu dimensiuni de 1,4/1/1 cm, care prezinta pe suprafata o formatiune papilomatoasa de 1/0,9 cm, cu fire de par pe suprafata.Piesa 2:Piesa de excizie tegumentara cu dimensiuni de 2/1,5/1,3 cm, care prezinta pe suprafata o formatiune tumorala papilomatoasa cu dimensiuni de 1,2/1,2 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta pe suprafata o formatiune papilomatoasa, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul dermului, fara atipii citologice sau arhitecturale, cu fenomene de maturare in profunzime. Marginile de rezectie sunt libere.", "diagnosis": "Nev papilomatos dermal excizat in totalitate.", "doctor": 78}, {"gross_exam": "Piesa cu dimensiuni de 1,3/1,2/0,5 cm, de aspect papilomatos, pediculata.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un polip fibroepitelial (acrocordon) alcatuit din epiteliul cu acantoza, spongioza focala si tesut conjunctiv dens cu componenta hemangiomatoasa si minim infiltrat inflamator limfo-plasmocitar dispus difuz.", "diagnosis": "Aspectul histopatologic descris este compatibil cu polip fibroepitelial.", "doctor": 43}, {"gross_exam": "PIesa cu dimensiuni de 12/12,5/7 cm ,reprezentata de tesut adipos incapsulat, lobulat, cu aspect omogen.", "microscopic_exam": "Materialul examinat este reprezentat de o formatiune tumorala benigna alcatuita din adipocite fara atipii si fara arii de necroza tumorala. Focal sunt prezente lipogranuloame.", "diagnosis": "Lipom.", "doctor": 1}, {"gross_exam": "Piesa cu dimensiuni de 1,7/1/0,6 cm.", "microscopic_exam": "Aspectul histopatologic descris corespunde polipului endocervical.", "doctor": 34}, {"gross_exam": "Piesa 1:Piesa de prostatectomie radicala cu greutatea de 46 grame, care masoara 5/4,5/4 cm, cu vezicula seminala stanga de 2 cm lungime, vezicula seminala dreapta de 2,5 cm lungime, duct deferent stang de 1,5 cm lungime si duct deferent drept de 1,5 cm lungime.Marginile de rezectie chirurgicale au fost marcate dupa cum urmeaza: hemiprostata dreapta-tus negru, hemiprostata stanga tus verde.Piesa 2:Piesa cu dimensiuni de 4/2,9/0,5 cm, reprezentata de tesut adipos si limfoganglioni.Piesa 3:Piesa cu dimensiuni de 4,5/2,5/0,7 cm, reprezentata de tesut adipos si un limfoganglion cu dimensiuni de 3/1,2 cm.Piesa 4:Piesa cu dimensiuni de 3,5/2,5/1 cm, reprezentata de tesut adipos si limfoganglioni.Piesa 5:Piesa cu dimesiuni de 3/2/0,7 cm, reprezentata de tesut adipos si doi limfoganglioni.", "microscopic_exam": "Note-\tPn1, L1-\tHGPINMargine de rezectie apex- negativa tumoral;Margine de rezectie ducte deferente- negative tumoral, bilateral;Margine de rezectie baza prostata- negativa tumoral;Toate marginile chirurgicale de rezectie periprostatice trec in tesut sanatos.(R0)Insertia prostatica a veziculelor seminale- negativa tumoral, bilateral.Parenchimul prostatic prezinta un focar de adenocarcinom acinar prostatic, scor Gleason  5 + 4 =  9, grup de grad 5, localizat in ambii lobi, etajele  apex, mediu, baza si care ocupa aproximativ 30% din suprafata examinata a glandei prostatice.  Din suprafata tumorala examinata 80% este ocupata de componenta primara (Gleason 5), 15% de componenta secundara (Gleason 4) si se observa si componenta Gleason 3 in proportie de aproximativ 5%. Formatiunea tumorala invadeaza tesutul adipos periprostatic.Celule tumorale sunt asezate in plaje tumorale, siruri liniare, structuri cribriforme sau izolat.Fara prezenta invaziei venoase  pe sectiunile examinate.(V0)Emboli tumorali limfatici prezenti.(L1)Infiltare tumorala perineurala prezenta.(Pn1)Sunt prezente focare de neoplazie intraepiteliala prostatica de grad inalt (HG PIN).Parenchimul prostatic netumoral prezinta: arii de hiperplazie nodulara si infiltrat inflamtor limfo-plasmocitar stromal. Plexurile periprostatice prezinta trombi fibrino-hematici. Se observa de asemenea artere cu placi de ateroscleroza.Piesa 2:Materialul examinat este reprezentat de doi limfoganglioni cu histiocitoza sinusala, involutie adipoasa si arii de hialinizare. Pe sectiunile examinate nu se observa metastaze de adenocarcinom. (0/2)Piesa 3:Materialul examinat este reprezentat de un limfoganglion cu histiocitoza sinusala, involutie adipoasa si arii de hialinizare. Pe sectiunile examinate nu se observa metastaze de adenocarcinom. (0/1)Piesa 4:Materialul examinat este reprezentat de trei limfoganglioni cu histiocitoza sinusala, involutie adipoasa si arii de hialinizare. Pe sectiunile examinate nu se observa metastaze de adenocarcinom. (0/3)Piesa 5:Materialul examinat este reprezentat de doi limfoganglioni cu histiocitoza sinusala, involutie adipoasa si arii de hialinizare. Pe sectiunile examinate nu se observa metastaze de adenocarcinom. (0/2)", "diagnosis": "Adenocarcinom acinar prostatic scor Gleason 5+4 = 9, grup de grad 5, pT3aN0(0/8)Mx L1V0Pn1R0.", "medical_codes": "ICD-O: 8140/3 MAI E DE VAZUT O LAMA DEZLIPITA", "doctor": 32}, {"gross_exam": "Piesa 1:Piesa de prostatectomie radicala cu greutatea de 40 grame, care masoara 3,4/5,5/4 cm, cu vezicula seminala stanga de 3,5 cm lungime, vezicula seminala dreapta de 2,7 cm lungime, duct deferent stang de 4 cm lungime si duct deferent drept de 5 cm lungime.Marginile de rezectie chirurgicale au fost marcate dupa cum urmeaza: anterior-tus albastru, posterior-tus negru, lateral stanga-tus verde, lateral dreapta-tus rosu.Piesa 2:Piesa chirurgicala cu dimensiuni de 1,2/0,5/0,5 cm.Piesa 3:Piesa chirurgicala cu dimensiuni de 0,6/0,6/0,4 cm.", "microscopic_exam": "Margine de rezectie apex- negativa tumoral;Margine de rezectie ducte deferente- negative tumoral, bilateral;Margine de rezectie baza prostata- negativa tumoral;Toate marginile chirurgicale de rezectie periprostatice trec in tesut sanatos.Insertia prostatica a veziculelor seminale- negativa tumoral, bilateral.Parenchimul prostatic prezinta multiple focare de adenocarcinom acinar prostatic, scor Gleason  3 + 4 =  7, grup de grad 2, localizate in ambii lobi, etajele  apex, mediu, baza si care ocupa aproximativ 25% din suprafata examinata a glandei prostatice.  Din suprafata tumorala examinata 80% este ocupata de componenta primara, 19% de componenta secundara si aproximativ 1% de componenta tertiara Gleason 5. Formatiunea tumorala este limitata la nivelul parenchimului prostatic.Sunt prezente structuri cribriforme si un focar de celule tumorale dispuse difuz.Fara prezenta invaziei venoase  pe sectiunile examinate.(V0)Fara prezenta embolilor tumorali limfatici pe sectiunile examiante.(L0)Infiltare tumorala perineurala prezenta.(Pn1)Sunt prezente focare de neoplazie intraepiteliala prostatica de grad inalt (HG PIN).Parenchimul prostatic netumoral prezinta: arii de hiperplazie nodulara, infiltrat inflamtor mixt stromal si arii de reactie granulomatoasa de corp strain. Vasele periprostatice prezinta trombi fibrino-leucocitari.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de parenchim prostatic cu artefacte de cauterizare. Pe sectiunile examinate nu se observa infiltrare tumorala.Piesa 3:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de parenchim prostatic cu artefacte de cauterizare. Pe sectiunile examinate nu se observa infiltrare tumorala.", "diagnosis": "Adenocarcinom acinar prostatic scor Gleason 3+4=7 grup de grad 2, pT2NxMx L0V0Pn1R0. Endometrioid vs seros-\tendometrioido\tP53 poate fi prezent in endometrioid de grad inalt (figo 3)o\tIn Endometrioid p16 poate fi patchy cu intensitate variabila (mai putin de 80%)o\tDe preferat receptori Progesteron (unele adenocarcinoame de col pot retine receptorii pentru estrogen)o\tBeta-catenina (nuclear pozitiv)o\tPiederea PTEN, MLH1, MSH2, MSH6, PMS2-\tSeroso\tP16 DIFUZo\tE,P negativio\tWT1 – (+/- in endometrial, Pozitiv in OVARIAN)Carcinom endometrial cu caractere endometrioide si seroase", "medical_codes": "ICD-O 8140/3.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,4/0,4/0,3, respectiv 0,4/0,4/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica care prezinta atipii citologice si arhitecturale sugestive pentru adenomul tubular cu grad redus de displazie.", "diagnosis": "Adenom tubular cu grad redus de displazie.", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit 3 fragmente cu dimensiuni cuprinse intre 0,4/0,2/0,2 cm si 0,5/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 3 fragmente de tesut invadate de o formatiune tumorala cu caracteristici histopatologice de adenocarcinom de tip intestinal moderat diferentiat (G2), cu desmoplazie stromala marcata si arii de abcedare si ulceratie.L0V0Pn0", "diagnosis": "Adenocarcinom de tip intestinal moderat diferentiat G2, ulcerat. ", "medical_codes": "ICD-O:8140/3", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,4/0,2/0,2 cm, respectiv 0,3/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica, unul de tip corporeal, celalalt de tip antral.Fragmentul de tip corporeal prezinta corion cu edem moderat, congestie moderata si infiltrat inflamator minim alcatuit din limfocite si rare eozinofile.Fragmentul de tip antral prezinta hiperplazie foveolara moderata, metaplazie intestinala incompleta in proportie de 5% si pigment biliar pe suprafata epiteliului. Corion contine vase cu staza, extravazare de hematii si rare eozinofile.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa displazie, inflamatie, activitate sau colonii de Helicobacter pylori.", "doctor": 54}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/0,8/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 5 fragmente de mucoasa colonica. Trei dintre fragmente prezinta modificari cito-arhitecturale sugestive pentru adenomul tubular cu grad redus de displazie. Celalate doua fragmente de mucoasa colonica prezinta la nivelul corionului infiltrat inflamator moderat, dispus difuz si alcatuit din limfocite, plasmocite, neutrofile si eozinofile. Focal se observa modificari subtile sugetive pentru polipul hiperplazic.", "diagnosis": "Adenoame tubulare cu displazie de grad redus.", "doctor": 28}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2,5/2/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala aflata in faza secretorie tardiva a ciclului endometrial.Focal sunt prezente fragmente de mucoasa cervicala, fara stroma atasata, care prezinta leziuni scuamoase intraepiteliale de grad inalt (HSIL, CIN III) reprezentate de atipii citologice marcate si numeroase mitoze situate in toata grosimea epiteliului.", "diagnosis": "Leziuni scuamoase intraepiteliale de grad inalt (HSIL, CIN III). ", "medical_codes": "ICD-O: 8077/2", "doctor": 54}, {"gross_exam": "Piesa cu dimensiuni de 1,4/0,7/0,6 cm, culoare maro-galbuie, cu aspect gelatinos.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de aspect polipoid alcatuit din glande endometriale dilatate, ramificate si stroma hipercelulara cu numeroase structuri vasculare cu perete ingrosat, dispuse in manunchiuri.", "diagnosis": "Polip endometrial.", "doctor": 1}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2,5/1,6/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala aflata in faza proliferativa a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala.", "diagnosis": "Endometrita cronica", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1,5/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala aflate in faza proliferativa a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 54}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 3/2,5/1,5 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente alcatuite din vilozitati coriale, edematiate, un invaginatii focale, fara structuri vasculare, cu formare de cisterne si cu numerosi corpi apoptotici la nivelul interstitiului.  Aceastea sunt inconjurate partial de trofoblast. Se observa de asemenea numeroase fragmente de decidua.", "immuno_examination": "p57 – imunomarcajul este negativ la nivelul vilozitatilor, pozitiv nuclear la nivelul deciduei si la nivelul trofoblastului intermediar.", "diagnosis": "Aspectul histopatologic, coroborat cu profilul imunohistochimic, corespunde molei hidatiforme complete. ", "medical_codes": "ICD-O: 9100/0", "doctor": 29}, {"gross_exam": "Piesa 1:Piesa de excizie chirurgicala cu dimensiuni de 22,5/17/14 cm care contine splina cu dimensiuni de 12/6,5/5,5 cm si epiploon cu dimensiuni de 15/5/1 cm. Pe sectiune, se observa o formatiune tumorala cu dimensiuni de 17/15/13 cm, care inglobeaza rinichiul aproape in totalitate si care se extinde in suprarenala si in tesutul adipos perirenal. Ureterul contine in lumen un material albicios, friabil. Vena renala contine intraluminal un embol cu lungimea de 10 cm.La polul inferior, in tesutul adipos perirenal se observa numeroase formatiuni tumorale, de aspect nodular, albicioase, cu diametre cuprinse intre 1 cm si 0,3 cm.Sunt identificate numeroase structuri vasculare marcate cu clipuri de plastic, a caror semnificatie nu este precizata.Piesa 2:In acelasi recipient au sosit doua fragmente cu dimensiuni de 9/3,5/3 cm, respectiv 3,5/3/2,5 cm, ambele reprezentate de mase tumorale si tesut adipos. Fragmentul mare prezinta un clip de plastic a carui semnificatie nu este precizata. Pe sectiune fragmentul mare prezinta o formatiune tumorala albicioasa-galbuie, cu plan de clivaj intre aceasta si tesutul inconjurator.", "microscopic_exam": "Formatiunea tumorala descrisa macroscopic este reprezentata de un carcinom renal cu celule clare, grad histologic Fuhrman (OMS/ISUP) G4. Tumora are arhitectura solida si alveolara, iar celulele sunt de talie variata, cu citoplasma eozinofila si nuclei cu pleomorfism marcat, celule gigante multinucleate si caractere rabdoide. Se observa arii extinse de necroza tumorala.Formatiunea tumorala invadeaza tesutul adipos perirenal, sinusul renal, glanda suprarenala si sinusul splenic. Nu se observa infiltrare tumorala la nivelul splinei.Vena renala este ocupata de un embol tumoral descris si macroscopic. Se observa de asemenea numeroase structuri vasculare cu emboli in lumen, atat la nivelul sinusului renal cat si la nivelul tesutului adipos perirenal. (V1)Marginea de rezectie a venei renale este pozitiva tumoral. (R1)Formatiunea tumorala atinge marginea de rezectie perirenala, posterioara. (R1)Infiltrare perineurala prezenta. (Pn1)S-au identificat 4 limfoganglioni cu histiocitoza si staza sinusala, fara metastaze. (0/4)Piesa 2:Fragmentul contine de un limfoganglion cu histiocitoza si capsula intacta, fara metastaza de carcinom renal, iar adicent este prezent un nodul constituit in totalitate din tumora. (0/1)Fragmentul mare este reprezentat de ureter cu lumenul ocupat in intregime de un carcinom cu celule renale clare (similar cu Proba 1). Marginea de rezectie supraiacenta clipului de plastic nu contine elemente tumorale.", "diagnosis": "Carcinom renal cu celule clare grad Fuhrman (WHO/ISUP) G4, pT4N0(0/5)Mx L0V1Pn1R1. ", "medical_codes": "ICD-O:8310/3", "doctor": 54}, {"gross_exam": "Fragment cu dimensiuni de 0,4/0,4/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica care prezinta modificari citologice si arhitecturale caracteristice adenomului tubular cu grad redus de displazie.", "diagnosis": "Adenom tubular cu displazie de grad redus", "doctor": 28}, {"microscopic_exam": "Materialul examinat este reprezentat de un limfoganglion ocupat partial de o proliferare de structuri vasculare, tapetate de endoteliu, unele cu hematii si siderofage in lumen. Structurile vasculare sunt dispuse intr-o stroma fibroasa, cu prezenta de extravazate hematice, histiocite si siderofage.Pe sectiunile tisulare examinate in coloratia uzuala, hematoxilina-eozina, nu se identifica leziuni suspecte de malignitate.", "diagnosis": "Aspectul histolpatologic este inalt sugestiv pentru o leziune de tipul hemangiom cu localizare la nivelul limfoganglionului.ComentariiPentru excluderea unor metastaze/micrometastaze de carcinom papilar tiroidian cunoscut si tratat la acest pacient, recomandam teste imunohistochimice.", "doctor": 28}, {"microscopic_exam": "Materialul primit este reprezentat de tegument, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul jonctiunii dermo-epidermale si dermului, fara atipii citologice sau arhitecturale, cu fenomene de maturare in profunzime. Marginile de rezectie sunt libere.In periferia tegumentului, la 5 mm de proliferarea melanocitara descrisa anterior, se observa o arie epidermala acantotica, cu aspect bazaloid si cu prezenta de chisturi cornoase.", "diagnosis": "Nev compus excizat in totalitate.Keratoza seboreica.", "doctor": 30}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,6/0,3/0,3 cm, respectiv 0,3/0,2/0,1 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica. Primul fragment prezinta la nivelul mucoasei numeroase adipocite dispus difuz in corion. Al doilea fragment prezinta numeroase adipocite situate in submucoasa.", "diagnosis": "Aspectul histopatologic descris, coroborat cu datele endoscopice, corespunde lipomului colonic.", "doctor": 43}, {"gross_exam": "Piesa 1:Fragment cu dimensiuni de 0,4/0,3/0,3 cm.Piesa 2:In acelasi recipient au sosit trei fragmente cu dimensiuni cuprinse intre 0,3/0,2/0,1 cm si 0,2/0,2/0,1 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa intestinala cu aspect polipoid care contine la nivelul corionului o placa Peyer hipertrofiata. Arhitectura cripte/vili este pastrata, insa focal epiteliul de acoperire este decolat, fara reactie fibrino-inflamatorie.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa colonica. Acestea prezinta cripte cu lumen festonat si hipersecretie de mucus, caracteristici sugestive pentru polipul hiperplazic.", "diagnosis": "Polipi colonici hiperplazici.", "doctor": 44}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,2/0,2/0,2 cm, respectiv 0,2/0,2/0,2 cm.Piesa 2:Fragment tisular cu dimensiuni de 0,4/0,2/0,2 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip corporeal, care prezinta atipii reactive in epiteliul de suprafata. La nivelul corionului se observa edem, congestie vasculara moderata si infiltrat inflamator limfo-plasmocitar in cantitate moderata.Se observa rare colonii de Helicobacter pylori. (HP+)Pe sectiunile examinate nu sunt prezente metaplazie, displazie sau fenomene de activitate.", "diagnosis": "Gastrita cronica, eritematoasa, HP+.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa intestinala cu raportul vili/cripte pastrat, cu limfocitoza intraepiteliala in limite normale (10 limfocite/100 enterocite), care prezinta la nivelul corionului vilozitar edem moderat si congestie vasculara marcata. Restul corionului prezinta infiltrat inflamator moderat alcatuit preponderent din plasmocite si rare eozinofile.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa Giardia intestinalis.", "doctor": 31}, {"diagnosis": "Aspectul histopatologic este inalt sugestiv pentru o reactie inflamatorie, insa pentru diagnosticul de certitudine si excluderea unui proces tumoral malign, se recomanda teste imunohistochmice.", "doctor": 34}, {"diagnosis": "Proliferare tumorala maligna cu grad histologic inalt. Se recomanda teste imunohistochimice pentru stabilirea subtipului.", "doctor": 32}, {"diagnosis": "Endometrita cronica.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare si multiple fragmente de mucoasa endometriala aflate in faza proliferativa a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala (26 plasmocite/10HPF).", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1,5/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare si fragmente de mucoasa endometriala aflata in faza secretorie tardiva a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 29}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1,5/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala aflata in faza secretorie incipienta a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 33}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala aflate in faza proliferativa a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (5 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 1}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,9/1,5/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare si fragmente de mucoasa endometriala aflata in faza proliferativa a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (4 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 44}, {"gross_exam": "Piesa cu dimensiuni de 2/2/2 cm, reprezentata de o formatiune polipoida, conopidiforma, de culoare maronie, cu pedicul scurt, cu lungimea de 0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mucoasa colonica cu arhitectura criptelor modificata, de aspect tubulo-vilos si cu atipii citologice de grad redus. Marginea de rezectie a pediculului nu contine modificari adenomatoase displazice.", "diagnosis": "Adenom tubulo-vilos cu displazie de grad redus, excizat in totalitate.", "doctor": 33}, {"gross_exam": "In acelasi recipient au sosit 5 fragmente de tegument cu diametre cuprinse intre 3,2/1,3/2 cm si 4,2/3/2,3 cm.", "microscopic_exam": "Materialul examinat este reprezentat de tegument. Unele dintre fragmente prezinta la nivelul dermului arii extinse de abcedare alcatuite din necroza, infiltrat inflamator mixt (limfocite, plasmocite, neutrofile), tesut de granulatie si celule gigante multinucleate de corp strain.", "diagnosis": "Aspectul histopatologic, coroborat cu datele clinice, este compatibil cu abcesul pilonidal.", "doctor": 28}, {"gross_exam": "Colecist cu dimensiuni de 9/3/0,5 cm, sosit sectionat si evacuat. Mucoasa acestuia este colesterolotica.", "microscopic_exam": "Materialul examinat este reprezentat de colecist, care prezinta la nivelul mucoasei, agregate de histiocite spumoase in corion si infiltrat inflamator limfo-plasmocitar minim. Sunt prezente arii reduse de neoplazie intraepiteliala biliara de grad redus. Sinusurile Rokitansky-Aschoff sunt accentuate.", "diagnosis": "Colecistita cronica.", "doctor": 54}, {"gross_exam": "Piesa 1:Piesa de excizie tegumentara cu dimensiuni de 1,2/1,2/1,3 cm, care prezinta o formatiune polipoida, conopidiforma, cu dimensiuni de 1,1/1,1 cm, tangenta la marginea de rezectie laterala.Piesa 2:Piesa de excizie tegumentara cu dimensiuni de 1,3/0,9/0,8 cm, care prezinta pe suprafata o formatiune nodulara usor pigmentata.Piesa 3:Piesa de excizie tegumentara cu dimensiuni de 1/0,5/0,5 cm, care prezinta pe suprafata o formatiune nodulara pigmentata, cu dimensiuni de 0,5/0,4 cm, tangenta la marginea de rezectie laterala.Piesa 4;Piesa cu dimensiuni de 0,6/0,3/0,4 cm, care prezinta pe suprafata o formatiune nodulara hiperpigmentata cu dimensiuni de 0,1/0,1 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta pe suprafata o formatiune papilomatoasa, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul dermului, cu minime atipii citologice, cu lobuli de tesut adipos si cu fenomene de maturare in profunzime. Proliferarea de celule nevice inglobeaza anexele tegumentare, iar focal se observa siruri si celule singulare dispuse printre fibrele de colagen. Marginile de rezectie sunt libere.", "diagnosis": "Nev papilomatos dermal excizat in totalitate.", "doctor": 33}, {"gross_exam": "Piesa 1:Piesa de excizie tegumentara, elipitca, nemarcata si neorientata, cu dimensiuni de 0,9/0,3/1 cm, care prezinta pe suprafata o formatiune tumorala de 0,5/0,6 cm, conopidiforma, cu fire de par pe suprafata, de culoare maronie. Formatiunea tumorala este situata la 0,1 cm de cea mai apropiata margine de rezectie laterala.Piesa 2:Piesa de exicizie tegumentara cu dimensiuni de 1,2/1,2/0,5 cm, care prezinta pe suprafata o formatiune papilomatoasa cu dimensiuni de 0,9/0,9 cm, de culoare maronie, situata la 0,1 cm de marginea de rezectie laterala.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta pe suprafata o formatiune papilomatoasa, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul dermului, cu fenomene de maturare in profunzime. Marginile de rezectie sunt libere.", "diagnosis": "Nev papilomatos compus excizat in totalitate.", "doctor": 34}, {"gross_exam": "Formatiune polipoida cu dimensiuni de 1,4/1,1/0,5 cm, de aspect gelatinos, cu pedicul atasat care are lungimea de 0,5 cm si diametrul de 0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de o formatiune polipoida tapetata pe trei laturi de celule cilindrice, care prezinta pe suprafata material muco-leucocitar. Formatiunea polipoida este alcatuita din glande dilatate si ramificate, tapetate de epiteliu unistratificat, cilindric, dispuse intr-o stroma fibroasa cu numeroase structuri vasculare cu perete ingrosat.", "diagnosis": "Aspectul histopatologic descris, coroborat cu datele clinice, corespunde unui polip endocervical.", "doctor": 44}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,9/0,7/0,5 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta la nivelul dermului o formatiune chistica, tapetata de epiteliul scuamos, stratificat, keratinizant, cu stratul granular prezent si fara anexe tegumentare atasate.", "diagnosis": "Chist epidermoid.", "doctor": 29}, {"gross_exam": "In acelasi recipient au sosit:-\tUn fragment tisular de aspect polipoid cu dimensiuni de 3,1/1,5/1,2 cm-\tMultiple fragmente milimetrice, care cumulat masoara 1,5/0,5/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de o formatiune polipoida, tapetata de epiteliul endocervical, care contine o proliferare de celule musculare netede, dispuse in fascicule, alaturi de fascicule de fibroblaste si structuri glandulare endocervicale. Pe sectiunile examinate nu se observa atipii citologice.Fragmentele milimetrice descrise macroscopic sunt reprezentate de mase hemato-fibrino-leucocitare care inglobeaza fragmente mici de epiteliul glandular fara suport stroma.", "diagnosis": "Aspectul histopatologic descris, in context clinic adecvat, corespunde adenomiomului endocervical.", "doctor": 1}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,2/0,2/0,2 cm, respectiv 0,3/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica.Unul dintre fragmente prezinta modificari citologice si arhitecturale sugestive adenomului tubular cu grad redus de displazie.Celalalt fragment are aspect polipoid, cu arhitectura criptelor pastrata. Corionul prezinta edem redus si minim infiltrat inflamator alcatuit din plasmocite, limfocite si rare eozinofile.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 78}, {"diagnosis": "In contextul clinic pledeaza pentru Crohn.Piesa 3:\tMaterialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica cu arhitectura si lungimea criptelor pastrata si cu epiteliul decolat focal. La nivelul corionului se observa edem moderat, congestie vaculara, infiltrat inflamator minim si histiocite spumoase.Aspectele descrise la niveul ileonului in context clinic pledeaza pentru boala Crohn.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa duodenala, cu raportul vili/cripte scazut, vilii sunt scurtati, edematiati, insa fara limfocitoza intraepiteliala crescuta (12 limfocite/100 enterocite). Corionul contine infiltrat inflamtor moderat, dispus difuz, alcatuit din limfocite, plasmocite si rare eozinofile.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa Giardia intestinalis.", "doctor": 32}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,3/0,2/0,2 cm, respectiv 0,2/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip corporeal cu hiperplazie foveolara moderata. La nivelul glandelor corporeale se observa modificari sugestive tratamentului cu inhibitori de pompa de protoni (festonarea lumenului, vacuolizari intracitoplasmatice). Corionul superficial prezinta edem redus si congestie moderata. Pe suprafata mucoasei este prezent pigment biliar.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa inflamatie intestitiala, displazie, metaplazie, activitate sau Helicobacter pylori.", "doctor": 54}, {"gross_exam": "In acelasi recipient au sosit trei fragmente fiecare avand dimensiuni de 0,3/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa gastrica, unul de tip antral si celalalte doua de tip corporeal. Se observa hiperplazie foveolara marcata, metaplazie intestinala incompleta in proportie de 15%, arii de fibroza si infiltrat inflamator limfo-plasmocitar moderat.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa displazie, activitate sau Helicobacter pylori.", "diagnosis": "Gastrita cronica.", "doctor": 1}, {"gross_exam": "Piesa cu dimensiuni de 0,8/0,6/0,3 cm, de culoare maronie, cosistenta ferm-elastica.", "microscopic_exam": "Materialul primit, prelucrat in totalitata, este reprezentat de tegument cu acantoza bazaloida a epidermului, care formeaza chisturi cornoase si cuiburi de keratinocite cu aspect de vartej. In suprafata se observa parakeratoza si cruste formate din keratinocite descuamate, hematii si leucocite.", "diagnosis": "Keratoza seboreica iritata.", "doctor": 32}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1,5/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare, care inglobeaza fragmente de mucoasa endometriala aflata in faza proliferativa a ciclului endometrial, unele cu glande usor dilatate si cu rare structuri vasculare dispuse in manunchiuri.Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala (12 plasmocite/10HPF).", "diagnosis": "Endometrita cronica.", "doctor": 32}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente milimetrice care cumulat masoara 1/1/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala aflata in faza proliferativa a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit 3 fragmente cu dimensiuni cuprinse intre 0,2/0,1/0,1 cm si 0,3/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente alcatuite din foveole dilatate, serate, ramificate, tapetate de celule cilindrice cu hipersecretia de mucus. Sunt prezente eroziuni acoperite de exsudat fibrino-leucocitar si tesut de granulatie subiacent acestora. Lamina propria contine infiltrat inflamator mixt (limfocite, plasmocite, rare polimorfonucleare) dispus difuz si arii de edem.", "diagnosis": "Polip gastric hiperplazic.", "doctor": 28}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,9/1/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat mase fibrino-hematice si fragmente de mucoasa endometriala, aflata in faza proliferativa a ciclului endometrial, cu arii de metaplazie tubara.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala (8 plasmocite/10HPF).", "diagnosis": "Endometrita cronica.", "doctor": 44}, {"gross_exam": "Piesa de nefrectomie partiala cu dimensiuni de 5,9/6/5,8 cm, cu tesut adipos atasat de 10/9/1 cm, sosita sectionata de catre operator. Sectiunea trece printr-o formatiune tumorala cu dimensiuni de 5/5/5 cm, culoare albicioasa, cu striuri galbui. Formatiunea tumorala se afla la 0,1 cm de marginea de rezectie parenchimatoasa.", "microscopic_exam": "Formatiunea tumorala descrisa macroscopic este reprezentata de un carcinom renal papilar, grad histologic Fuhrman (OMS/ISUP) G1. Tumora are arhitectura tubulo-papilara, iar celulele sunt de talie medie unistratificate, cu citoplasma eozinofila, redusa si nuclei cu nucleoli mici, bazofili, greu vizibili la magnificatie 400x. Se observa macrofage spumoase si o capsula fibroasa peritumorala, care e depasita focal de tumora. Nu se observa arii de necroza tumorala pe sectiunile examinate.Formatiunea tumorala este limitata la parenchimul renal.Pe sectiunile examinate nu se observa invazie angio-limfatica sau infiltrare perineurala.Marginile de rezectie parenchimatoase si perirenala sunt libere, dar sunt situate la o distanta submilimetrica de formatiunea tumorala. (R0)Nu s-au identificat limfoganglioni in piesa examinata.", "immuno_examination": "PAX8 – pozitiv nuclear la nivelul celulelor tumoraleCK7 – pozitiv citoplasmatic la nivelul celulelor tumorale", "diagnosis": "Carcinom papilar cu celule renale, grad Fuhrman G1, pT1bNxMx L0V0R0. ", "medical_codes": "ICD-O: 8260/3", "doctor": 44}, {"diagnosis": "Carcinom renal cu celule clare  grad Fuhrman G1, pT3aNxMx L0V0R1.", "microscopic_exam": "Formatiunea tumorala descrisa macroscopic este reprezentata de un carcinom renal cu celule clare, grad histologic Fuhrman (OMS/ISUP) G1. Tumora are arhitectura alveolara si acinara, iar celulele sunt de talie medie, cu citoplasma clara si nuclei cu nucleoli mici, bazofili, greu vizibili la magnificatie 400x. Se observa o capsula fibroasa peritumorala si hemosiderina. Nu se observa arii de necroza tumorala pe sectiunile examinate.Formatiunea tumorala invadeaza sinusul renal.Pe sectiunile examinate nu se observa invazie angio-limfatica sau infiltrare perineurala.Marginea de rezectie parenchimatoasa contine celule tumorale intr-o regiune unde capsula tumorala este depasita. (R1)Marginea de rezectie perirenala este situata la 0,3 mm de formatiunea tumorala, fiind interpusa o rama subtire de parenchim renal.Parenchimul peritumoral prezinta infiltrat inflamator limfo-plasmocitar dispus difuz si glomeruli sclerohialinizati global si focal.Pe sectiunile examinate nu s-au identificat limfoganglioni.", "immuno_examination": "PAX8 – pozitiv nuclear la nivelul celulelor tumorale.", "doctor": 78}, {"microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 3 fragmente de biopunctat mamar cu lungimea totala de 21 mm, care prezinta numeroase ducte dilatate, alcatuite din celule luminale de aspect columnar, cu nuclei ovalari, hipercromi, cu polaritatea pastrata, fara nucleoli vizibili. La polul apical sunt prezente proeminente citoplasmatice eozinofile, globuloase. Majoritatea ductelor contin celule bazale mioepiteliale, cu exceptia unei arii reduse, unde se ridica suspiciunea unui carcinom invaziv, pentru care sunt necesare teste imunohistochimice.", "doctor": 33}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masora 1,5/1/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala cu aspect histopatologic sugestiv fazei proliferative a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (23 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 32}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2,5/3/0,5 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hematice, care inglobeaza numeroase fragmente foarte mici de endometru cu aspect histopatologic de faza menstruala.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 44}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1,5/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hematice, care inglobeaza fragmente de mucoasa endometriala cu aspect histologic de faza secretorie tardiva.", "immuno_examination": "Imunomarcajul CD138 evidentiaza rare celule plasmocitare in stroma endometriala. (2 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 54}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2,5/1,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala cu aspect histologic de faza proliferative si care prezinta arii de hemoragie stromala.Este prezent un fragment de mucoasa cervicala jonctionala, care prezinta arii de metaplazie scuamoasa matura si imatura, atat la nivelul epiteliului de suprafata endocervial, cat si la nivelul glandelor endocervicale.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (40 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 1}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit doua fragmente cu dimensiuni de 1/0,2/0,2 cm, respective 0,5/0,3/0,3 cm.Piesa 2:In acelasi recipient au sosit trei fragmente cu dimensiuni de 0,3/0,3/0,3 cm, 0,5/0,4/0,3 cm, respective 0,5/0,4/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa colonica cu aspect polipoid, care prezinta focal cripte usor ramificate, cu hipersecretie de mucus. Corionul contine infiltrat inflamator mixt (limfocite, plasmocite, polimorfonucleare), arii de microhemoragie si edem. Unul dintre fragmente contine si o rama fina de submucoasa care contine infiltrate inflamator limfo-plasmocitar dispus intr-un pseudofolicul limfoid.", "diagnosis": "Adenoame tubulare cu grad redus de displazie.", "doctor": 29}, {"gross_exam": "In acelasi recipient au sosit 2 fragmente cu dimensiuni de 0,2/0,2/0,2 cm, respectiv 0,3/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa intestinala.Unul dintre fragmente prezinta arii de eroziune si tesut de granulatie in suprafata. Epiteliul de acoperire adiacent ariilor de eroziune prezinta atipii reactive si exocitoza neutrofilica marcata. Corionul contine infiltrat inflamator marcat, dispus difuz, alcatuit din limfocite, plasmocite, neutrofile si eozinofile.Al doilea fragment prezinta la nivelul corionului edem, congestie moderata si infiltrat inflamtor dispus difuz, in cantitate moderata, alcatuit din limfocite, plasmocite si eozinofile. In mucusul de suprafata se observa colonii bacteriene de aspect bacilar si celule inflamatorii.", "diagnosis": "Ileita nespecifica.", "doctor": 28}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,3/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica, cu arhitectura criptelor pastrata. Acesta prezinta o arie de eroziune, subiacent careia se observa infiltrat inflamator marcat alcatuit din limfocite, palsmocite si numeroase eozinofile (64 eozinofile/ un HPF). Epiteliul adiacent eroziunii prezinta atipii reactive si numeroase agregate leucocitare intraepiteliale alcatuite din eozinofile. La nivelul corionului se mai observa un folicul limfoid si rare cripte cu eozinofilie intraepiteliala. Mucusul din suprafata contine colonii bacteriene, fibre vegetale, detritusuri celulare si leucocite.Comentarii:Se ridica suspiciunea unei colite eozinofilice?????Colita eozinofilicaColita nespecificaPosibil colita infectioasa", "doctor": 35}, {"gross_exam": "Piesa de excizie chirurgicala cu dimensiuni de 1,5/1,2/0,5 cm, de aspect papilomatos.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de o formatiune polipoida tapetata de epiteliul scuamos keratinizant, atrofic si o stroma fibro-vasculara.", "diagnosis": "Polip fibroepitelial.", "doctor": 29}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,2/0,2.0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu criptele usor festonate, ramificate, cu hipersecretia de mucus.", "diagnosis": "Polip hiperplazic.", "doctor": 54}, {"gross_exam": "Piesa 1:Fragment cu dimensiuni de 0,8/0,3/0,3 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/2/0,5 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa endocervicala cu infiltrat inflamator abundent alcatuit preponderent din plasmocite, limfocite si neutrofile. Se observa numerosi corpi Russell si un materialul extracelular, eozinofil, de aspect fibrilar.", "diagnosis": "Polip endocervicalPiesa 2:Materialul primit, prelucrat in totalitate, este reprezentata de mase muco-fibrilare care contin infiltrat inflamator neutrofilic abundent. Focal sunt prezente fragmente de mucoasa endocervicala, unele de aspect papilar, cu metaplazie scuamoasa, cu infiltrat inflamator abundent plasmocitar si cu exocitoza neutrofilica in epiteliul de suprafata. Se mai observa arii de microhemoragie.Endocervicita cronica papilara activa.", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit trei fragmente cu dimensiuni cuprinse intre 0,5/0,2/0,2 cm si 1/0,3/0,4 cm", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 3 fragmente de mucoasa colonica de aspect polipoid, cu arii de edem si congestie vasculara redusa. Corionul prezinta celularitate usor crescuta. Unul dintre fragmente prezinta la nivelul criptelor hiperplazie celulele de mucus si minime festonari luminale.Polip hiperplazic.", "doctor": 30}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/0,5/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa colonica cu arhitectura criptelor pastrata, care prezinta la nivelul corionului edem moderat. La nivelul unui fragment se observa un folicul pseudolimfoid dispus la baza corionului.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa ingrosarea membranei bazale, limfocitoza intraepiteliala sau fenomene de activitate.", "doctor": 31}, {"gross_exam": "In acelasi recipient au sosit doua fragmente tisulare cu dimensiuni cumulate de 0,5/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip antral, de aspect polipoid, cu hiperplazie foveolara si cu metaplazie intestinala completa in proportie de 1% din materialul examinat. Se observa decolari epiteliale, insa fara exsudat fibrino-leucocitar prezent. Pe suprafata mucoasei este prezent pigment biliar.Pe sectiunile examinate nu se observa displazie, fenomene de activitate, inflamatie sau  Helicobacter pylori.", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,5/0,3/0,3 cm, respectiv 0,5/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica, cu arhitectura criptelor pastrata si fara atipii citologice pe sectiunile examinate. Fragmentele au aspect polipoid, iar la nivelul corionului se observa edem marcat si congestie vasculara moderata.In materialul examinat nu este interceptata submucoasa.", "doctor": 1}, {"gross_exam": "Piesa de excizie chirurgicala cu dimensiuni de 8,5/5/4 cm, care contine 4 fire chirurgicale atasate, a caror semnificatie nu este precizata. Piesa aparent este incapsulata, iar pe sectiune are aspect omogen, culoare albicioasa, consistenta crescuta.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un limfoganglion cu arhitectura stearsa de o proliferare de celule tumorale de talie mare, cu nuclei rotunzi-ovalari veziculosi cu nucleoli unici, proemineni si citoplasma redusa. Celule tumorale au arhitectura predominant nodulara, dar sunt prezente si plaje celulare.Pe sectiunile examinate nu se poate preciza cu exactitate prezenta extensiei extracapsulara, intrucat marginea de rezectie capsulara, marcata cu tus negru, este focal discontinua si situata la o distanta mai mica de 0,1 mm de formatiunea tumoala.", "immuno_examination": "CK5/6 – pozitiv citoplasmatic la nivelul celulelor tumoraleCD3 – negativ la nivelul celulelor tumorale; martor intern pozitivCD20 – negativ la nivelul celulelor tumorale; martor intern pozitivCD30 – negativ la nivelul celulelor tumorale, martor intern pozitivKi-67 – 90% la nivelul celulelor tumoraleEBV (LMP) – pozitiv citoplasmatic si membranar la nivelul celulelor tumorale.", "diagnosis": "Aspectul histopatologic descris, coroborat cu profilul imunohistochimic, sugereaza o metastaza limfoganglionara de carcinom scuamos nekeratinizant, slab diferentiat, cu origine, mai probabil, nazofaringiana, EBV+. ", "medical_codes": "ICD-O:8072/6", "doctor": 33}, {"gross_exam": "Piesa 1:Fragment tisular cu dimensiuni de 0,4/0,4/0,3 cm.Piesa 2:In acelasi recipient au sosit 4 fragmente tisulare cu dimensiuni de 0,8/0,7/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de patru fragmente provenite dintr-un adenocarcinom de tip intestinal, bine diferentiat, cu desmoplazie stromala moderata si infiltrat inflamator in cantitate moderata, alcatuit din limfocite, plasmocite si neutrofile.Se observa un embol limfatic tumoral.", "diagnosis": "Adenocarcinom de tip intestinal, bine diferentiat G1.", "medical_codes": "ICD-O: 8140/3", "doctor": 54}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,3/0,2/0,2 cm, respectiv 0,3/0,2/0,2 cm.", "microscopic_exam": "-\tArhitectura cripte/vili stearsa-\tGlande antrale/pilorice-\tInfiltrat inflamtor mixt-\tCriptita-\tNeutrofilile in epiteliul de suprafataMaterialul primit, prelucrat in totalitate, este repezentat de trei fragmente de mucoasa, unul dintre fragment este de tip duodenal cu raportul cripte/vili scazut. Vilii sunt tumefiati, dilatati, iar la nivelul corionului este prezent infiltrat inflamator dispus difuz, alcatuit din limfocite, plasmocite si rare eozinofile.Celalate doua fragmente sunt reprezentate de mucoasa gastrica de tip antral, cu infiltrat inflamator mixt, dispus difuz, alcatuit din limfocite, plasmocite si numeroase eozinofile (15 eozinofile/1 HPF). Epiteliul de surafata prezinta atipii reactive si exocitoza neutrofilica abundenta. Focal se observa fenomene de activitate de tipul criptitei.", "doctor": 54}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masora 2/1,7/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala. Aceastea prezinta arii cu raportul glande/stroma crescut, cu glandele usor aglomerate, unele dialtate, de aspect activ si cu putina stroma interpusa intre aceastea. Stroma contine arii de edem si focare de microhemoragie. Focal se observa metaplazie tubara.Pe sectiunile examinate nu se observa atipii citologice.", "diagnosis": "Hiperplazie endometriala simpla fara atipii.", "doctor": 44}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2,5/1,5/0,5 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentate de membrane amniotice, decidua si resturi placentare alcatuite din vilozitati de talie corespunzatoare trimestrului I de sarcina, unele sclerozate si cu fibrina pe suprafata. La nivelul deciduei se observa arii de necroza si hemoragie.", "diagnosis": "Anexe fetale cu caracteristici histologice de trimestrul I.", "doctor": 78}, {"gross_exam": "Piesa de punch biopsie cu dimensiuni de 0,3/0,4/0,3 cm, care prezinta pe suprafata o macula maronie cu diametrul de 0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta acantoza marcata a epidermului, cu formare focala de chiste cornoase. Keratinocitele au aspect bazaloid, insa nu se observa atipii citologice sau mitoze. Stratul de cornos prezinta parakeratoza.", "diagnosis": "Keratoza seboreica acantotica.", "doctor": 30}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/2,5/0,5 cm, de consistenta crescuta, culoare cenusie.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de miometru, endometru si mase fibrino-hemato-leucocitare, care inglobeaza mici fragmente de mucoasa endometriala. Endometrul are aspect histologic de faza secretorie tardiva/faza menstruala. La nivelul miometrului se observa glande si stroma endometriala rasfirate, care sugereaza arii de adenomioza.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "diagnosis": "Adenomioza", "doctor": 31}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1,/0,5 cm", "microscopic_exam": "Note:-\tDecidua cu edem, arii de abcedare-\tNu vad modificari de molaP57Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de decidua, endometru secretor si rare vilozitati coriale. Fragmente de decidua prezinta arii extinse de necroza, abcedare, edem si infiltrat inflamator mixt (limfocite, plasmocite, polimorfonucleare). Vilozitatile coriale au aspect histologic corespunzator trimestrului I de sarcina, sunt edematiate, tumefiate, insa fara proliferare trofoblastica, fara atipii trofoblastice si fara prezenta de cisterne.Pe sectiunile examinate nu se observa modificari histopatologice caracteristice molei.", "immuno_examination": "p57 – pozitiv atat la nivelul citotrofoblastului vilozitar, cat si la nivelul trofoblastului intermediar.", "diagnosis": "Sarcina uterina trimestul I oprita in evolutie.", "doctor": 31}, {"gross_exam": "Piesa 1:Fragment tisular cu dimensiuni de 0,2/0,1/0,1 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 0,7/0,5/0,3 cm", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica care contine la nivelul corionului un folicul limfoid.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de 4 fragmente de mucoasa colonica. Unul dintre fragmente prezinta modificari arhitecturale si citologice caracteristice adenomului tubular cu displazie de grad redus.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,6/0,5/0,4 cm, respectiv 0,5/0,4/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica de aspect polipoid care prezinta la nivelul corionului infiltrat inflamator dispus difuz, in cantitate moderata, alcatuit din limfocite, plasmocite, eozinofile si neutrofile. Epiteliul de suprafata contine numeroase limfocite.", "diagnosis": "Aspectul histopatologic descris, in context clinic adecvat, este compatibil cu polipul inflamator.", "doctor": 28}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 3/1,5/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala alcatuita din glande si stroma aflate in faza proliferativa a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 54}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1,7 cm.Piesa 2:Fragment tisular cu dimensiuni de 1,5/1,2/0,6 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat multiple fragmente de mucoasa endometriala cu caracteristici histologice de faza proliferativa a ciclului endometrial. Se mai observa fragmente de mucoasa endocervicala si fragmente provenite dintr-un polip endometrial.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (12 plasmocite/10HPF)Endometrita cronica.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de o formatiune polipoida tapetata pe trei laturi de epiteliu cubic, unistratificat. Formatiunea polipoida este alcatuita din structuri glandulare endometriale, dialatate, dispuse intr-o stroma hipercelulara cu numeroase structuri vasculare cu perete ingrosat.", "diagnosis": "Polip endometrial", "doctor": 78}, {"diagnosis": "Polip endometrial", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare care inglobeaza fragmente foarte mici de mucoasa endometriala cu aspecte histologice sugestive pentru faza proliferativa a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. S-au identificat 20 plasmocite/2 HPF. Din cauza materialului endometrial redus, s-au evaluat doar 2 campuri cu magnificatie de 400x.Endometrita cronicaPiesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala cu glande endometriale ramificate, dilatate, focal aglomerate, dispuse intr-o stroma hipercelulara, cu vase  focal aglomerate. Este prezente si un fragment de miometru.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 0,8/0,7/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 4 fragmente de mucoasa colonica cu arhitectura criptelor pastrata. Epiteliul de suprafata si unele cripte prezinta numerosi corpi apoptotici. Corionul contine arii de edem si infiltrat inflamator dispus difuz, in cantitate moderata, alcatuit din limfocite, plasmocite si rare eozinofile.Pe sectiunile examinate nu se observa infiltrat neutrofilic, fenomene de activitate, ulcerații sau dezorganizarea arhitecturala a criptelor.", "diagnosis": "Colita nespecifica.", "doctor": 32}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,4/0,4/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu modificari arhitecturale si citologice corespunzatoare adenomului tubular cu displazie de grad redus.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 43}, {"gross_exam": "Colecist cu lungimea de 10 cm, sosit sectionat si evacuat de catre operator. Pe suprafata mucoasei se observa calculi, iar grosimea maxima a peretelui este de 0,3 cm.", "microscopic_exam": "Materialul examinat este reprezentat de colecist cu arii de eroziune la nivelul mucoasei si cu prezenta de sinusuri Rokitansky Aschoff.", "diagnosis": "Colecistita cronica.", "doctor": 32}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2,5/2/0,5 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala aflata in faza proliferativa a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (6 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 29}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/2/0,3 cm", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala aflata in faza proliferativa a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (18 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 34}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit trei fragmente tisulare cu dimensiuni cumulate de 1/1/0,5 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente tisulare cu dimensiuni cumulate de 2,5/2,5/1 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de endocol si exocol. La nivelul mucoasei endocervical se observa metaplazie scuamoasa matura cu extensie focala de-a lungul glandelor endocervicale. Zona de jonctiune scuamo-columnara prezinta infiltrate inflamator marcat alcatuit din plasmocite, limfocite si polimorfonucleare dispus atat difuz la nivelul stromei subepitelilae cat si in microabcese neutrofilice intraepiteliale. Se mai observa arii de ulceratie, tesut de granulatie, microhemoragii intrastromale si agregate neutrofilice intraglandulare.Pe sectiunile examinate nu sunt prezente elemente histopatologice de malignitate.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare atat la nivelul mucoasei endometrial (36 plasmocite/ 10HPF), cat si la nivelul fragmentelor de mucoasa endocervicala.", "diagnosis": "Endometrita cronica", "doctor": 28}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masora 1,5/1/0,3 cm", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hematice si fragmente de endometru de aspect proliferativ, care focal prezinta glande endometriale usor aglomerate, unele dilatate sau ramificate. Focal sunt prezente glande endometriale cu metaplazie morulara si metaplazie tubara.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (5 plasmocite/10HPF)", "diagnosis": "Endometrita cronica", "doctor": 34}, {"gross_exam": "Piesa de punch biopsie cu diametrul de 0,4 cm si lungimea de 0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezenta de tegument, care prezinta la nivelul epidermului parakeratoza, spongioza si limfocitoza intraepiteliala (exocitoza) redusa. Epidermul are focal aspect histologic de hiperplazie psoriaziforma. Pe suprafata se observa rare scuame alcatuite din keratina, detritusuri celulare si hematii. La nivelul dermului se observa infiltrat inflamator limfo-plasmocitar dispus difuz, perivascular, in cantitate redusa. Nu se observa infiltrat inflamator neutrofilic sau abcese Munro.", "diagnosis": "In context clinc Parapsoriazis?Nu se potriveste cu psoriazis\\", "doctor": 35}, {"gross_exam": "Piesa 1:Piesa de excizie tegumentara, eliptica, cu dimensiuni de 0,9/0,4/0,6 cm, care prezinta pe suprafata o formatiune tumorala maronie, cu dimensiuni de 0,5/0,4 cm, tangenta la marginea de rezectie laterala.Piesa 2:Piesa de exicizie tegumentara, eliptica, nemarcata si neorientata, cu dimensiuni de 0,7/0,4/0,6 cm, care prezinta pe suprafata o formatiune tumorala maronie, cu dimensiuni de 0,5/0,4 cm, tangenta la una dintre marginile de rezectie laterala.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta pe suprafata o formatiune papilomatoasa, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul dermului, fara atipii citologice sau arhitecturale, cu fenomene de maturare in profunzime. Marginile de rezectie sunt libere.", "diagnosis": "Nev papilomatos dermal excizat in totalitate.", "doctor": 1}, {"gross_exam": "In acelasi recipient au sosit 3 fragmente care cumulat masoara 0,8/0,5/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa duodenala de aspect polipoid, care prezinta hiperplazia glandelor Brunner. Epiteliul de suprafata prezinta focal atipii reactive. Corionul contine vase cu staza moderata si infiltrat inflamator mixt (limfocite, plasmocite, neutrofile, eozinofile) in suprafata si infiltrat inflamtor limfo-plasmocitar dispus in pseudofoliculi limfoizi, in profunzime.", "diagnosis": "Aspectul histopatologic descris, coroborat cu datele endoscopice, este compatibil cu hiperplazia de glande Brunner", "doctor": 34}, {"gross_exam": "Fragment cu dimensiuni de 0,3/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu modificari arhitecturale si citologice corespunzatoare adenomului tubular cu displazie de grad redus. Corionul contine arii de edem si infiltrat inflamator mixt.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 30}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/0,4/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa colonica, invadate de o formatiune tumorala maligna de tipul adenocarcinomului de tip intestinal, moderat diferentiat G2. Stroma tumorala prezinta desmoplazie moderata si infiltrat inflamator mixt (limfocite, plasmocite, neutrofile) in cantitate redusa, dispus focal.", "diagnosis": "Adenocarcinom de tip intestinal, moderat diferentiat G2. ", "medical_codes": "ICD-O: 8140/3", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,3/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica cu conturul glandelor festonat si cu hipersecretia de mucus.", "diagnosis": "Polip colonic hiperplazic.", "doctor": 28}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,3/0,2/0,1 cm, respectiv 0,4/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica cu modificari citologice si arhitecturale caracteristice adenomului tubular cu displazie de grad redus.", "diagnosis": "Modificari histopatologice sugestive pentru adenomul tubulara cu displazie de grad redus.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hematice care inglobeaza fragmente de mucoasa endometriala cu caracteristici histologice de faza proliferativa.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (12 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente submilimetrice dispuse intr-o masa de mucus.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare si fragmente de mucoasa endometriala aflata in faza proliferativa a ciclului endometrial. La nivelul unor fragmente, raportul glande/stroma este usor crescut, iar glandele sunt dispuse inghesuit, cu stroma minima interpusa intre acestea.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (10 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.-\tPacienta mai are doua rezultate de endometrita-\tPare ca are si modificari de hiperplazie endometriala", "doctor": 31}, {"gross_exam": "Piesa de histerectomie totala cu dimensiuni de 9,5/5/4 cm, din care colul masoara 3/2,3/2 cm, cu orificiul cervical extern in fanta, avand lungimea de 2 cm. La nivelul orificiului cervical extern se observa eroziuni. Grosimea maxima a endometrului masoara 0,2 cm. Pe sectiune, la nivelul miometrului, se observa multiple formatiuni nodulare leiomiomatoase, de culoare albicioasa, cu aspect fasciculat si cu diametre cuprinse intre 0,3 cm si 0,9 cm.", "microscopic_exam": "Sectiunile prelevate de la nivelul colului uterin prezinta endocol cu arhitectura papilara, care contine la nivelul stromei infiltrate inflamator limfo-plasmocitar, dispus difuz, subepitelial. Glandele endocervicale sunt dilatate, unele cu modificari de tip “tunnel clusters”, altele cu metaplazie tubara si calcificari. Sunt prezente arii de metaplazie scuamoasa matura, cu extensie pe glandele endocervicale.Mucoasa endometriala este subtiata si este alcatuita din glande si stroma de aspect histologic inactive cu arii focale de metaplazie sincitial papilara.La nivelul miometrului, formatiunile nodulare descrise macroscopic sunt reprezentate de leiomiome uterine. Pe sectiunile examinate nu se observa atipii citologice sau necroza tumorala.", "diagnosis": "Endocervicita cronica.", "doctor": 44}, {"gross_exam": "Formatiune polipoida, de aspect conopidiform, pediculata cu diametrul de 0,3 cm si lugimea pediculului de 0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de o formatiune polipoida alcatuita din structuri tubulare cu atipii citologice de grad redus si rare atipii citologice de grad inalt. Marginea de rezectie chirurgicala pediculara nu contine atipii citologice sau arhitecturale.", "diagnosis": "Adenom tubular cu displazie de grad redus, focal cu displazie de grad inalt, excizat in totalitate.", "doctor": 33}, {"gross_exam": "Piesa de excizie tegumentara cu dimensiuni de 1,6/1,5/1,2 cm, de forma triunghiulara, nemarcata si neorientata, care prezinta pe suprafata o formatiune tumorala ulcerata, cu margini burjonate, care masoara 1,2/0,9 cm, aparent in contact cu marginea de rezectie chirurgicala.", "microscopic_exam": "Sectiunile prelevate si examinate de la nivelul formatiunii tumorale descrise macroscopic, releva un carcinom bazocelular, varianta nodulara, care infiltreaza tegumentul si tesutul muscular striat subiacent pe o distanta de 2,5 mm (Breslow), Clark V. Suprafata tumorala este ulcerata si acoperita de crupte hemato-leucocitare. Stroma tumorala, dermul adiacent si tesutul muscular prezinta arii extinse de abcedare.Pe sectiunile nu se observa invazie angio-limfatica sau infiltrare tumorala perineurala.Cea mai apropiata margine de rezectie laterala este situata la 1 mm de formatiunea tumorala. Marginea de rezectie profunda este situata la 3 mm de formatiunea tumorala.", "diagnosis": "Carcinom bazocelular, nodular, ulcerat, pT3NxMx L0V0R0. ", "medical_codes": "ICD-O: 8097/3", "doctor": 30}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente de care cumulat masoara 3/1,5/0,6 cm.", "microscopic_exam": "-\tHistiocite spumoase, hemoragie stromala-\tColaps stromal-\tCorpi apoptotici-\tGlande dilatate-\tMetaplazie tubaraMaterialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala alcatuita din glande si stroma de faza proliferativa. La nivelul glandelor se observa numerosi corpi apoptotici si metaplazie tubara. Stroma contine arii de edem, microhemoragie si agregate de histiocite spumoase. Sunt prezente arii de colaps stromal si glandular.", "diagnosis": "Aspectul histopatologic descris, in context clinic adecvat, poate corespunde unei hemoragii uterine disfunctionale.", "doctor": 32}, {"gross_exam": "In acelasi recipient au sosit doua fragmente tisulare cu dimensiuni cu 0,4/0,3/0,3 cm, respectiv 0,4/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica cu modificari arhitecturale si citologice sugestive pentru adenomul tubulo-vilos cu grad redus de displazie si focare mici de displazie de grad inalt.", "diagnosis": "Adenoame tubulo-viloase cu displazie de grad redus, focal cu displazie de grad inalt.", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/0,6/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat fragmente de mucoasa colonica,unele de aspect polipoid, care contin la nivelul corionului vase cu staza marcata, edem marcat si infiltrat inflamator mixt, alcatuit din limfocite, plasmocite si neutrofile, in cantitate moderata.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit trei fragmente cu dimensiuni de 0,5/0,2/0,2 cm, 0,5/0,2/0,2 cm, respectiv 0,3/0,2/0,2 cm.", "microscopic_exam": "Doua dintre fragmente sunt reprezentate de mucoasa colonica fara modificari patologice. Focal se observa la nivelul submucoasei cateva celule ganglionare, care mai probabil provin dintr-un plex Meissner. Al treilea fragment este reprezentata de tesut de granulatie alcatuit din numeroase structuri vasculare si infiltrat inflamator mixt, abundent, alcatuit din limfocite, plasmocite si neutrofile.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "doctor": 28}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit patru fragmente care cumulat masoara de 1,2/1/0,3 cm.Piesa 2:In acelasi recipient au sosit doua fragmente care masoara 0,4/0,4/0,3 cm, respectiv 0,4/0,4/0,3 cm.", "microscopic_exam": "Piesa 1:\tMaterialul primit, prelucrat in totalitate, este reprezentat de patru fragmente de mucoasa colonica cu arhitectura criptelor pastrata, care prezinta la nivelul mucoasei arii de hemoragie, edem si infiltrat inflamator mixt, in cantitate moderata, dispus difuz, alcatuit din plasmocite, limfocite si rare polimorfonucleare.\tPe sectiunile examinate nu se observa modificari histopatologice de malignitate.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip corporeal, cu hiperplazie foveolara marcata si cu staza vasculara moderata in corionului superficial.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa metaplazie, inflamatie, fenomene de activitate, Helicobacter pylori sau modificari histopatologice de malignitate.", "doctor": 30}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit patru fragmente tisulare cu dimensiuni de 0,7/0,7/0,3 cm.Piesa 2:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,4/0,4/0,2 cm, respectiv 0,4/0,4/0,2 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de patru fragmente de mucoasa.Primul fragment este reprezentat de mucoasa duodenala, cu raportul cripte/vili pastrat, cu limfocitoza intraepiteliala in limite normale (18 limfocite/100 enterocite). La nivelul corionului se observa infiltrat inflamator in cantitate redusa, alcatuit din limfocite, plasmocite si rare eozinofile.Al doilea fragment este reprezentat de mucoasa gastrica de tip corporeal, care prezinta la nivelul corionului arii de microhemoragie.Ultimele doua fragmente au arhitectura histologica de mucoasa gastrica de tip piloric. Acestea prezinta hiperplazie foveolara redusa, congestie vaculara moderata si metaplazie intestinala in proportie de 5%.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa displazie, fenomene de activitate sau Helicobacter pylori.Nu se evidentiaza structura histologica de mucoasa esofagiana.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip corporeal, de aspect polipoid, care prezinta la nivelul corionului superficial congestie vasculara marcata.Pe sectiunile examinate in coloratie uzuala, nu se observa metaplazie, displazie, inflamatie, fenomene de activitate sau Helicobacter pylori.", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitatea, este reprezentat de mase fibrin-hematice si fragmente de mucoasa endometriala alcatuita din stroma si glande endometriale de faza proliferativa. Un prezente si mici fragmente de mucoasa endocervicala.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (46 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 43}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,4/0,4/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat  de un fragment de mucoasa gastrica de tip antro-pilorica, cu atrofie glandulara si cu o arie de eroziune. Corionul contine infiltrat inflamator in cantitate moderata, dispus difuz si alcatuit din limfocite, plasmocite si rare eozinofile.Sunt prezente celule Paneth si celule calificiforme, dar avand in vedere situsul recoltarii, acestea nu au fost interpretate ca si metaplazie.Pe sectiunile examiante in coloratie uzuala, hematoxilina-eozina, nu se observa Helicobacter pylori.", "doctor": 33}, {"gross_exam": "In acelasi recipient au sosit doua fragmente tisulare cu dimensiuni de 0,3/0,2/0,2 cm, respectiv 0,4/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip corporeal cu arii de eroziune in suprafata. La nivelul corionului superficial se observa staza vascualara moderata si edem redus, iar in corionul profund este prezent infiltrat inflamator limfo-plamocitar in cantitate redusa, dispus focal. Sunt prezente rare foveole cu fibrina in lumen.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa metaplazie, displazie, activitate sau Helicobacter pylori.", "diagnosis": "Aspectul histopatologic descris este compatibil cu gastrita eroziva.", "doctor": 32}, {"gross_exam": "In acelasi recipient au sosit 3 fragmente cu dimensiuni cumulate de 1/0,4/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 3 fragmente de mucoasa gastrica.Doua fragmente sunt de tip corporeal si contin la nivelul corionulul infiltrat inflamator in cantitate moderata, dispus difuz superficial si in pseudofoliculi limfoizi in profunzime, alcatuit din limfocite, plasmocite si rare neutrofile. In suprafata se observa arii de eroziune, pigment biliar si hiperplazie foveolara moderata.Al treilea fragment este reprezentat de mucoasa gastrica de tip antral. Acesta prezinta hiperplazie foveolara, metaplazie intestinala in proportie de 10%, fibroza si infiltrat inflamator in cantitate moderata, alcatuit din limfocite, plasmocite si rare neutrofile.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa displazie, activitate sau Helicobacter pylori.", "diagnosis": "Gastrita cronica de intensitate moderata.", "doctor": 34}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit multiple fragmente tisulare care cumulat masoara 0,6/0,6/0,3 cm.Piesa 2:In acelasi recipient au sosit doua fragmente tisulare cu dimensiuni de 0,5/0,4/0,3 cm.Piesa 3:Fragment tisular cu dimensiuni de 0,6/0,6/0,4 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de patru fragmente.Doua dintre fragmente sunt reprezentate de mucoasa duodenala cu artefacte de strivire si congestie vasculara moderata la nivelul corionului.Celalalte doua fragmente sunt reprezentate de mucoasa gastrica de tip corporeal cu hiperplazie foveolara si staza vasculara moderata.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa displazie, fenomene de activitate, Helicobacter pylori sau Giardia intestinalis.Comentarii:Rugam a se intepreta in context clinicPiesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment alcatuit din mase fibrino-hemato-leucocitare si un fragment de mucoasa colonica cu caracteristici histologice sugestive pentru polipul hiperplazic.", "diagnosis": "Tumora neuroendocrina colonica, bine diferentiata G1. ", "immuno_examination": "Synaptophyzin – pozitiv citoplasmatic la nivelul celulelor tumoraleChromogranin – negativ la nivelul celulelor tumorale; martor intern pozitivKi-67 – indexul de proliferare tumora < 1 %", "medical_codes": "ICD-O:8240/3 ", "doctor": 28}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,5/0,5/0,4 cm, respectiv 0,6/0,3/0,3 cm.Piesa 2:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,7/0,5/0,4 cm, respectiv 0,9/0,5/0,4 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa cu histologie sugestiva pentru colonul ascendent, care prezinta la nivelul corionului edem marcat, sufuziuni hematice focale si infiltrat inflamator in cantitate moderata, dispus difuz, alcatuit din plasmocite, eozinofile, limfocite si rare neutrofile.Pe sectiunile examinate nu se observa displazie sau fenomene de activitate.", "diagnosis": "Polip hiperplazic.", "doctor": 43}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,8/0,8/0,3 cm, reprezentat de o formatiune chistica cu continut mucoid.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat un perete chistic fibros, focal cu arii mucinoase, tapetat de sinoviocite. Atasat se observa si fragmente mici de tesut adipos.", "diagnosis": "Chist sinovial.", "doctor": 29}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,3/0,3/0,2 cm, respectiv 0,3/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa gastrica de tip antral cu hiperplazie foveolara marcata, fibroza moderata si atrofie mucoasa redusa. Pe unul dintre fragmente se observa la baza mucoasei, o arie hipocelulara, alcatuita din rare celule fusiforme si fibre de colagen.", "immuno_examination": "CD117 (cKit) – negativ la nivelul ariei hipocelulare cu celule fusiforme; martor intern pozitiv.AE1/AE3 – negativ la nivelul ariei hipocelulare.ComentariiImunomarcajul CD117 negativ scade probabilitatea unei tumori stromale gastrointestinale (GIST).", "doctor": 1}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,2/0,2/0,2 cm, respectiv 0,3/0,2/0,1 cm.Piesa 2:Fragment tisular cu dimensiuni de0,4/0,3/0,2 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa gastrica de tip corporeal cu artefacte de strivire, care prezinta la nivelul corionului superficial infiltrat inflamator limfo-plasmocitar dispus difuz, in cantitate moderata.Pe sectiunile examinate nu se observa metaplazie intestinala, displazie, fenomene de activitate sau Helicobacter pylori.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 1}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,3/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu arhitectura criptelor pastrata, cu limfocitoza intraepiteliala in limite normale si cu membrana bazala epiteliala de grosime normala. La nivelul corionulul se observa arii de microhemoragie si infiltrat inflamator limfo-plasmocitar in cantitate redusa, dispus difuz.Fara malignitate sau fenomene de activitate pe sectiunile examinate.", "doctor": 29}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,3/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mucoasa gastrica de tip tranzitional (celule parietale si principale prezente, alaturi de glande antrale), atrofica, care prezinta hiperplazie foveolara. La nivelul corionului se observa vase cu congestie moderata si minima fibroza peri-glandulara.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa displazie, metaplazie, inflamatie, fenomene de activitate sau Helicobacter pylori.", "diagnosis": "Gastropatie atrofica.", "doctor": 34}, {"gross_exam": "Fragment tisular de aspect polipoid cu dimensiuni de 0,4/0,4/0,3 cm, culoare maronie, cu baza de implantare avand diametrul de 0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta pe suprafata o formatiune papilomatoasa, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul dermului, fara atipii citologice sau arhitecturale, cu fenomene de maturare in profunzime. Marginile de rezectie sunt libere.", "diagnosis": "Nev papilomatos dermal excizat in totalitate.", "doctor": 78}, {"gross_exam": "Piesa cu dimensiuni de 1,7/1,2/1,1 cm, cu lambou cutanat de 1,2/1,4 cm, care prezinta pe suprafata o arie nodulara, violacee, cu dimensiuni de 0,7/0,5 cm, situata la 0,3 cm de cea mai apropiata margine de rezectie laterala.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument cu acantoza epidermala, care prezinta la nivelul dermul tesut de granulatie alcatuit din infiltrat inflamator marcat, mixt (plasmocite, neutrofile, limfocite) si numeroase vase de neoformatie.", "diagnosis": "Aspectul histopatologic descris, este compatibil cu o zona de abcedare in curs de organizare conjunctiva.", "doctor": 33}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1,5/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase muco-leucocitare care inglobeaza fragmente de mucoasa endocervicala si fragmente de mucoasa endometriala aflata in faza secretorie tardiva a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente tisulare care cumulat masoara 1/0,9/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa uterina recoltata de la nivelul istmului, alcatuita atat din glande endocervicale, cat si din glande endometriale cu aspect histologic de faza proliferativa dispuse intr-o stroma de tip endometrial cu arii extinse de edem.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (10 plasmocite/10HPF)", "diagnosis": "Endometrita cronica", "doctor": 28}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1,3/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase muco-leucocitare care inglobeaza fragmente mici de mucoasa endocervicala si separat se observa fragmente de mucoasa endometriala alcatuite din stroma edematiata si glande endometriale ramificate, spiralate, unele cu modificari de colaps si cu prezenta de rari corpi apoptotici. Nu sunt prezente mitoze nici la nivel stromal si nici la nivel glandular. Aspectul histologic este compatibil cu faza secretorie tardiva a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.-\tNu e polip-\tDescriere-\tCd 138 -", "doctor": 33}, {"gross_exam": "In acelasi recipient au sosit 3 fragmente care masoara 0,6/0,2/0,2 cm, 0,6/0,2/0,2 cm, respectiv 0,6/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 3 fragmente de mucoasa colonica, care prezinta dezorganizarea arhitecturii criptelor (cripte usor dilatate, ramificate, scurtate), infiltrat inflamator mixt (plasmocite, limfocite, neutrofile, eozinofile) in cantitate marcata dispus in pseudofoliculi limfoizi si difuz in toata grosimea corionului, cuprinzand inclusiv musculara mucoasei. Se observa fenomene de activitate, criptita si abcese criptice, in aproximativ 40% dintre cripte. Epiteliul de suprafata prezinta atipii reactive, exocitoza neutrofilica marcata si arii de ulceratie.", "diagnosis": "Aspectul histopatologic descris, in context clinic adecvat, poate corespunde colitei ulcerative cu activitate marcata", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,3/0,3/0,2 cm, respectiv 0,3/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica. Unul dintre fragmente are aspect polipoid si modificari caracteristice polipului hiperplazic cu prezenta unui folicul limfoid la nivelul corionului profund. Al doilea fragment are aspect polipoid, iar la nivelul corionului prezinta fibroza redusa si vase cu staza marcata.", "diagnosis": "Polip hiperplazic.", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit 4 fragmente tisulare cu dimensiuni cumulate de 0,3/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 4 fragmente de mucoasa gastrica de tip antral si antro-corporeal cu hiperplazie foveolara moderata. La nivelul corionulul este prezent infiltrat inflamator marcat, limfo-plasmocitar dispus difuz si in pseudofoliculi limfoizi atat in corionul superifial cat si in corionul profund. La nivelul corionului superficial sunt prezente vase cu staza moderata.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa metaplazie, displazie, activitate sau Helicobacter pylori.Gastrita foliculara", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,5/0,3/0,2 cm, respectiv 0,5/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip corporeal. La nivelul corionului superficial se observa edem minim si infiltrat inflamator redus, dispus difuz, alcatuit din limfocite si plasmocite. Glandele corporeale prezinta modificari histopatologice sugestive tratamentului cu inhibitori de pompa de protoni.Pe sectiunile examinate nu se observa metaplazie, displazie, activitate, fibroza sau Helicobacter pylori.", "doctor": 1}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/2/0,5 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat mase fibrino-hematice si fragmente de mucoasa endometriala, unele aflate in faza proliferativa tardiva, altele in faza secretorie incipienta. Stroma contine arii de hemoragie si arii de edem. Focal se observa metaplazie tubara.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (16 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 1}, {"gross_exam": "In acelasi recipient au sosit 3 fragmente, cel mai mic cu dimensiuni de 0,2/0,2/0,2 cm, cel mai mare cu dimensiuni de 0,4/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument cu parakeratoza focala si cu atrofie epidermala. Dermul papilar prezinta elastoza solara moderata. Perianexial si perivascular se observa minim infiltrat inflamator limfo-plasmocitar, insa fibrele de colagen sunt de talie si aspect normal.??? nu se gasesc caractere de specificitate.", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 0,7/0,5/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 5 fragmente de mucoasa gastrica. Trei dintre acestea sunt de tip antral, iar doua sunt de tip corporeal.La nivelul fragmentelor de mucoasa antrala se observa hiperplazie foveolara moderata, metaplazie intestinala completa in proportie de 40% , fibroza moderata, atrofie glandulara marcata si infiltrat inflamator moderat, dispus difuz la nivelul corionului, alcatuit din limfocite, plasmocite si rare polimorfonucleare. Pe unul dintre fragmentele de mucoasa antrala se observa o arie de displazie de grad inalt.La nivelul fragmentelor de mucoasa corporeala se observa hiperplazie foveolara marcata, atrofie moderata, activitate moderata de tipul criptitei si infiltrat inflamator marcat, dispus difuz la nivelul corionului superficial, alcatuit din limfocite, plasmocite si numeroase neutrofile.Pe suprafata fragmentelor se observa pigment biliarPe sectiunile examinate in coloratie uzula, hematoxilina-eozina, nu se observa Helicobacter pylori.", "diagnosis": "Gastrita cronica cu activitate moderata, inflamatie marcata, atrofie moderata si displazie de grad inalt.! doar voiam sa imi confirme cineva displazie", "doctor": 54}, {"gross_exam": "Fragment tisular de aspect papilomatos cu dimensiuni de 0,5/0,4/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa care prezinta pe suprafata o formatiune papilomatoasa tapetata de epiteliu scuamos stratificat, cu arii focale de para si ortokeratoza. Proiectiile papilare contin structuri vasculare.Pe sectiunile examinate nu se observa fenomene histopatologice de malignitate.", "diagnosis": "Papilom scuamos.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/1,2/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 7 fragmente de mucoasa colonica cu arhitectura criptelor modificata, criptele sunt dilatate, scurtate, unele cu crestele orizontala. Trei dintre acestea prezinta la nivelul corionulul arii de ulceratie si tesut de granulatie abundent, alcatuit din vase de neoformatie si infiltrat inflamator polimorfonuclear marcat. Restul fragmentelor contin arii extinse de edem, congestie, microhemoragii si infiltrat inflamator mixt (limfocite, plasmocite, neutrofile, eozinofile) la nivelul corionului. Focal se observa cripte cu fenomene de activitate reprezentate de abcese criptice si criptita. Epiteliul de suprafata prezinta arii cu exocitoza neutrofilica.", "diagnosis": "Aspectul histopatologic descris este compatibil cu boala inflamatorie intestinala in puseu de activitate. Rugam a se interpreta in context clinic.! doar confirmare", "doctor": 78}, {"gross_exam": "Piesa 1:Fragment tisular cu dimensiuni de 0,4/0,1/0,1 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 0,8/0,3/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu modificari histopatologice caracteristice polipului hiperplazic. Corionul contine infiltrat infllamator in cantitate redusa, dispus difuz, alcatuit din limfocite, plasmocite si rare polimorfonucleare.", "diagnosis": "Polip hiperplazic.Piesa 2:Descriere!- Ei zic ca apartine submucoasei-\tPoate hiperplazic???", "doctor": 35}, {"gross_exam": "Piesa 1:1. Apex stang medial: 1.7 cm.2. Mijloc stang medial: 2.2 cm.3. Baza stanga medial: 1.7 cm.4. Apex stang lateral: 1 cm.5. Mijloc stang lateral: 1 cm.6. Baza stanga laterala: 1.7 cm.Piesa 2:1. Apex drept medial: 2.2 cm.2. Mijloc drept medial: 1.5 cm3. Baza drept medial: 1.6 cm.4. Apex drept lateral: 1.9 cm.5. Mijloc drept lateral: 1.5 cm.6. Baza drept lateral: 1.4 cm", "microscopic_exam": "Piesa 1:1.Punctat prostatic ce prezinta infiltrat tumoral (60%) de tip Adenocarcinom de prostata, scor Gleason 4 + 3 = 7, grup de grad 3, LV0,Pn0.2.Punctat prostatic ce prezinta infiltrat tumoral (30%) de tip Adenocarcinom de prostata, scor Gleason 4 + 3 = 7 (componenta tertiara Gleason 5 in procent 1%), grup de grad 3, LV0,Pn1.3.Punctat prostatic ce prezinta infiltrat tumoral (10%) de tip Adenocarcinom de prostata, scor Gleason 4 + 5 = 9, grup de grad 4, LV0,Pn0.4.Punctat prostatic ce prezinta infiltrat tumoral (30%) de tip Adenocarcinom de prostata, scor Gleason 3 + 3 = 6, grup de grad 1, LV0,Pn0.5.Punctat prostatic ce prezinta infiltrat tumoral (20%) de tip Adenocarcinom de prostata, scor Gleason 3 + 3 = 6, grup de grad 1, LV0,Pn0.6.Punctat prostatic ce prezinta infiltrat tumoral (30%) de tip Adenocarcinom de prostata, scor Gleason 3 + 3 = 6, grup de grad 1, LV0,Pn0.Piesa 2:1.Punctat prostatic ce prezinta infiltrat tumoral (10%) de tip Adenocarcinom de prostata, scor Gleason 3 + 3 = 6, grup de grad 1, LV0,Pn0.2.Punctat prostatic ce prezinta infiltrat tumoral (10%) de tip Adenocarcinom de prostata, scor Gleason 3 + 3 = 6, grup de grad 1, LV0,Pn0.3.Punctat prostatic ce prezinta infiltrat tumoral (40%) de tip Adenocarcinom de prostata, scor Gleason 3 + 3 = 6, grup de grad 1, LV0,Pn0.4.Punctat prostatic ce prezinta infiltrat tumoral (20%) de tip Adenocarcinom de prostata, scor Gleason 3 + 3 = 6, grup de grad 1, LV0,Pn0.5.Punctat prostatic ce prezinta infiltrat tumoral (5%) de tip Adenocarcinom de prostata, scor Gleason 3 + 3 = 6, grup de grad 1, LV0,Pn0.6.Punctat prostatic ce prezinta infiltrat tumoral (5%) de tip Adenocarcinom de prostata, scor Gleason 3 + 3 = 6, grup de grad 1, LV0,Pn0.", "doctor": 32}, {"gross_exam": "Piesa de punch biopsie cu dimensiuni de 0,5/0,4/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de tegument care prezinta la nivelul epidermului, hiperplazie psoriaziforma cu parakeratoza si cu atenuare stratului granular. La nivelul stratului cornos se observa rare abcese Munro (agregate neutrofilice), iar la nivelul stratului spinos este prezenta exocitoza. Perivascular, in dermul superficial se observa infiltrate inflamtor limfo-plasmocitar, in canitate moderata.", "diagnosis": "Psoriazis vulgar.", "doctor": 33}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit doua fragmente tisulare cu dimensiuni de 0,3/0,3/0,2 cm, respective 0,3/0,3/0,2 cm.Piesa 2:Fragment tisular cu dimensiuni de 0,3/0,3/0,3 cm.Piesa 3:Fragment tisular cu dimensiuni de 0,3/0,3/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip corporeal. Unul dintre fragmente nu prezinta modificari histologice.Celalalt fragment prezinta la nivelul corionului edem marcat, congestie moderata si infiltrat inflamator dispus difuz, alcatuit din limfocite, plasmocite si rare neutrofile.  Epiteliul de suprafata prezinta arii de eroziune cu scaderea secretiei de mucus si minima exocitoza neutrofilica.Pe sectiunile examinate, colorate in hematoxilina-eozina, nu se observa metaplazie, displazie, fenomene de activitate sau Helicobacter pylori.", "diagnosis": "Piesa 3:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu arhitectura criptelor pastrata. Corionul contine vase cu staza redusa si infiltrat inflamator limfo-plasmocitar minim.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "doctor": 44}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,4/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa gastrica de tip corporeal, care prezinta la nivelul corionului superficial arii de edem moderat si congestie vaculara moderata. Sunt prezente cateva foveole cu hiperplazie si arii mici de eroziune acoperite de fibrina.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa metaplazie, displazie, fenomene de activitate sau Helicobacter pylori.", "diagnosis": "Gastrita eroziva.", "doctor": 32}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1,5/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala alcatuita din stroma si glande de faza proliferativa. Focal se observa arii de edem.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (9 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 29}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hematice si fragmente de mucoasa endometriala de faza proliferativa, care prezinta focal arii de hemoragie stomala.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (11 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 44}, {"gross_exam": "Piesa 1:Piesa de punch biopsie cu dimensiuni de 0,3/0,3/0,3 cm.Piesa 2:Piesa de punch biopsie cu dimensiuni de 0,4/0,3/0,3 cm.", "microscopic_exam": "Piesa 1Materialul primit, prelucrat in totalitate, este reprezentat de tegument, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul dermului, fara atipii citologice sau arhitecturale, cu fenomene de maturare in profunzime. Marginile de rezectie sunt libere.", "diagnosis": "Nev papilomatos dermal excizat in totalitate.", "doctor": 1}, {"gross_exam": "In acelasi recipient au sosit 5 fragmente cu dimensiuni cumulate de 0,9/0,7/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de cinci fragmente de mucoasa colonica cu modificari arhitecturale si citologice corespunzatoare adenomului tubular cu grad redus de displazie.", "diagnosis": "Adenoame tubulare cu displazie de grad redus.", "doctor": 33}, {"gross_exam": "In acelasi recipient au sosit 2 fragmente cu dimensiuni de 0,4/0,4/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica cu arhitectura tubulara si atipii citologice corespunzatoare displaziei de grad redus.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 28}, {"gross_exam": "In acelasi recipient au sosit 4 fragmente de mucoasa colonica cu dimensiuni cumulate de 0,5/0,5/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate este reprezentat de cinci fragmente de mucoasa gastrica de tip antral. La nivelul compartimentului foveolar se observa arii de eroziune, colonii de Helicobacter pylori (HP+++), exocitoza neutrofilica si hiperplazie foveolara marcata. Compartimentul glandular prezinta fenomene de activitate moderata de tipul criptitei. Corionul contine edem moderat, congestie moderata si infiltrat inflamator marcat dispus atat in pseudofoliculi limfoizi cat si difuz, alcatuit din limfocite, plasmocite si neutrofile.Pe sectiunile examinate nu se observa metaplazie intestinala sau displazie.", "diagnosis": "Gastrita cronica, cu activitate moderata, inflamatie marcata, HP+++.", "doctor": 54}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,5/0,2/0,2 cm, respectiv 0,5/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip antral cu hiperplazie foveolara marcata. La nivelul corionului se observa infiltrat inflamator limfo-plasmocitar dispus difuz in cantitate moderata. Unul dintre fragmente prezinta o arie de ulceratie in curs de reepitelizare si infiltrat inflamtor mixt prezent subiacent. Corionul prezinta arii de fibroza si atrofie moderata.Pe sectiunile examinate, colorate in hematoxilina-eozina, nu se observa metaplazie intestinala, displazie sau Helicobacter pylori.", "diagnosis": "Gastrita eroziva cu atrofie moderata.Notes-\tUnde sunt punctele sunt artefacte de strivire si e greu sa evaluez exact ce e acolo!-\tSeriate/ panck?", "doctor": 34}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,3/0,2/0,2 cm, respectiv 0,4/0,3/0,2 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/0,6/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa intestinala, care isi pastreaza in mare partea arhitectura cripte/vili, cu exceptia unei arii reduse unde vilii intestinali sunt aplatizati, iar corionul subiacent este edematiat. In rest, corionu prezinta vase cu congestie moderata si focare mici de hemoragie.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa colonica cu arhitectura si dispozitia criptelor pastrate. Corionul contine arii de edem moderat si vase cu staza redusa.Pe sectiunile examinate nu se observa ingrosarea membranei bazale, limfocitoza intraepiteliala sau fenomene de activitate.", "doctor": 33}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 0,7/0,6/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa colonica invadate de o formatiune tumorala maligna de tip adenocarcinomului intestinal moderat diferentiat. Sunt prezente arii de tesut de granulatie, posibil provenite dintr-o arie de ulceratie.", "diagnosis": "Adenocarcinom de tip intestinal, moderat diferentiat G2. ", "medical_codes": "ICD-O:8140/3", "doctor": 35}, {"gross_exam": "Piesa cu dimensiuni de 2,5/1/0,5 cm, reprezentata de perete chistic cu continut partial evacuat, galben friabil.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de perete chistic alcatuit din tapet epitelial scuamos stratificat, cu stratul granular pastrata si cu keratina pe suprafata. Nu se observa anexe tegumentare atasate la peretele chistic.", "diagnosis": "Chist epidermoid.", "doctor": 32}, {"gross_exam": "Piesa de excizie tegumentara cu dimensiuni de 2,9/1,8/0,3 cm, care prezinta pe suprafata o formatiune tumorala cu dimensiuni de 1,6/1 cm, situata la 0,2 cm de cea mai apropiata margine de rezectie laterala. Formatiunea tumorala este usor supradenivelata, aparent bine delimitata de tegumentul adiacent si prezinta margini neregulate.", "microscopic_exam": "Sectiunile prelevate si examinate de la nivelul formatiunii tumorale descrise macroscopic releva un carcinom bazocelular cu morfologie nodulara si infiltrativa, care invadeaza tegumentul pe o distanta de 3 mm (Breslow), pana la nivelul dermului profund (Clark IV). Stroma peritumorala prezinta desmoplazie marcata si infiltrat inflamtor limfo-plasmocitar moderat. Epidermul supraiacent formatiunii tumorale este ulcerat. Dermul papilar adiacent prezinta elastoza solara marcata. La nivelul foliculilor pilosi se observa Demodex folliculorum.Formatiunea tumorala se afla la 0,4 mm de marginea de rezectie profunda si la 2 mm de cea mai apropiata margine de rezectie laterala.Pe sectiunile examinate nu se observa invazie angio-limfatica sau infiltrare perineurala.", "diagnosis": "Carcinom bazocelular nodular si infiltrativ pT1NxMx L0V0R0. ", "medical_codes": "ICD-O:8092/3", "doctor": 44}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1,2/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare si fragmente de mucoasa endometriala cu aspect histologic de faza proliferativa. Focal, la nivelul stromei endometriale, se observa arii de edem si microhemoragie. Este prezent si un fragment foarte mic de mucoasa endocervicala fara modifcari patologice.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,4/1/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala alcatuite din stroma cu arii de edem si glande endometriale de aspect proliferativ, unele aglomerate, cu putina stroma interpusa si numerosi corpi apoptotici. Focal se observa si un fragment de mucoasa endocervicala.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 34}, {"gross_exam": "In acelasi recipient au sosit multipli cilindri tisulari cu lungimea cumulat de 4,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 9 cilindri de biopunctat mamar care prezinta arii extinse de fibroza si o arie mica reprezentata de reactie giganto-celulara de corp strain. Sectiunile seriate efectuate releva in plus o arie mici de hiperplazie ductala uzuala confirmata si cu ajutorul testelor imunohistochimice.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "immuno_examination": "AE1/AE3 – imunomarcajul nu evidentiaza celule tumorale in stroma fibroasa sau la nivelul reactiei giganto-celulare de corp strain.CD68 – evidentiaza celule histocitare la nivelul reactie giganto-celulare de corp strainCK5/6 – evideatiaza aria de hiperplazie ductala uzuala si celulele mioepiteliale de la nivelul ductelor normale.", "diagnosis": "Biopsie mamar benigna (B2). Hiperplazie ductala uzuala.", "doctor": 44}, {"gross_exam": "Piesa 1:Piesa de prostatectomie radicala cu greutatea de 52 grame, care masoara 4,3/5/4 cm, cu vezicula seminala stanga de 0,9 cm lungime, vezicula seminala dreapta de 2 cm lungime, duct deferent stang de 3,5 cm lungime si duct deferent drept de 2,5 cm lungime.Marginile de rezectie chirurgicale au fost marcate dupa cum urmeaza: anterior-tus albastru, posterior-tus negru, lateral stranga-tus verde, lateral dreapta-tus rosu.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 8/6/2,5 cm reprezentate de tesut adipos, limfoganglioni si un fragment de vezicula seminala cu dimensiuni de 2/1,2/0,7cm.", "microscopic_exam": "Margine de rezectie apex, stang- pozitiva tumoral;Margine de rezectie ducte deferente- negative tumoral, bilateral;Margine de rezectie baza prostata- negativa tumora.Toate marginile chirurgicale de rezectie periprostatice trec in tesut sanatos. Cea mai apropiata margine de rezectie se afla la o distanta inframilimetrica de formatiunea tumorala in regiunea treimii medii, lateral stanga. Se descrie o arie de 1,4 mm in dreptul veziculei seminale stangi la nivelul careia nu poate fi evaluata marginea de rezectie datorita artefactelor de cauterizare marcate (Rugam a se interpreta in contextul protocolului operator).Insertia prostatica a veziculelor seminale- infiltrata tumoral la nivelul veziculei seminale stangi.Parenchimul prostatic prezinta un focar de adenocarcinom acinar prostatic, scor Gleason  3 + 4 =  7, grup de grad 2, localizat in ambii lobi, etajele  apex, mediu, baza si care ocupa aproximativ 30% din suprafata examinata a glandei prostatice.  Din suprafata tumorala examinata 90% este ocupata de componenta primara, 10% de componenta secundara. Formatiunea tumorala invadeaza tesutul adipos periprostatic.Sunt prezente structuri cribriforme.Fara prezenta invaziei venoase  pe sectiunile examinate.(V0)Fara prezenta embolilor tumorali limfatici pe sectiunile examiante.(L0)Infiltare tumorala perineurala prezenta.(Pn1)Sunt prezente focare de neoplazie intraepiteliala prostatica de grad inalt (HG PIN).Parenchimul prostatic netumoral prezinta: arii de hiperplazie nodulara si infiltrat inflamtor mixt stromalPiesa 2:S-au identificat si examinat 16 limfoganglioni cu arii de hialinizare, fara elemente histopatologice de malignitate. (0/16)Fragmentul sosit separate este reprezentat de vezicula seminala infiltrata tumoral de adenocarcinom acinar prostatic.", "diagnosis": "Adenocarcinom acinar prostatic scor Gleason 3+4 = 7, grup de grad 2, pT3bN0Mx L0V0Pn1R1. ", "medical_codes": "ICD-O: 8140/3", "doctor": 31}, {"gross_exam": "Piesa 1:Piesa cu dimensiuni de 1/0,6/0,4 cm, reprezentata de tesut adipos si un limfoganglion.Piesa 2:Piesa cu dimensiuni de 6/5/4 cm, reprezentata de o formatiune tumorala care are atasat tesut adipos cu dimensiuni de 5/5/1 cm si parenchim renal care inconjoara formatiunea tumorala pe o lungime de 10 cm si avand latimea de 2 cm. Pe una dintre fete, formatiune tumorala este acoperita de capsula renala, iar opus capsulei renale, spre fata parenchimatoasa, formatiunea tumorala prezinta capsula proprie. La nivelul fetei parenchimatoase se observa si un vase cu clip de plastic atasat, care contine in lumen un embol tumoral. Pe sectiune, formatiunea tumorala are aspect heterogen reprezentat de spatii chistice, cu continut gelatinos, rosietic si arii solide de culoare galbuie-albicioasa.Marginea de rezectie parenchimatoasa a fost colorata cu tus verde, iar marginea capsulei renale a fost colorata cu tus negruPiesa 3:In acelasi recipient au sosit doua fragmente cu dimensiuni de 1,2/1/0,5 cm, respectiv 1,6/1,2/0,6 cm, reprezentate de tesut adipos si limfoganglioni.Piesa 4:Piesa cu dimensiuni de 2,2/2,5/1,6 cm, reprezentata de un fragment de parenchim renal sosit sectionat de catre operator printr-o formatiune tumorala care masoara 1,6/1,3 cm, de culoare albicioasa, consistenta usor crescuta. Pe sectiunile adiacente este prezenta o formatiune chistica cu diametrul de 0,5 cm si continut gelatinos-galbui.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de un tesut adipos si un limfoganglion fara elemente histopatologice de malignitate. (0/1)Piesa 2: Formatiunea tumorala descrisa macroscopic este reprezentata de un carcinom renal cu celule clare, grad histologic Fuhrman (OMS/ISUP) G2. Tumora are arhitectura alveolara si acinara, iar celulele sunt de talie medie, cu citoplasma clara si nuclei cu nucleoli eozinofili, vizibili la magnificatie 400x. Se observa arii de necroza tumorala (5% din suprafata tumorii) si o capsula fibroasa peritumorala.Formatiunea tumorala este limitata la parenchimul renal, dar are caracter extensiv, comprimand pelvisul renal si parenchim renal adiacent.Structura vasculara cu clip de plastic descrisa macroscopic contine un embol tumoral. (V1)Margine de rezectie chirugicala examinata supraiacent clipului de plastic nu contine elemente histopatologice de malignitate.Marginile de rezectie capsulara si parenchimatoasa nu contin elemnte histopatologice de malignitate.In tesutul adipos adicent nu s-au identificat limfoganglioni.", "diagnosis": "Angiomiolipom. ", "medical_codes": "ICD-O:8860/0", "immuno_examination": "HMB-45 – evidentiaza rare celule tumorale pozitive citoplasmatic.Melan A - negativ", "doctor": 1}, {"gross_exam": "Piesa 1:Piesa de cistoprostatectomie cu dimensiuni de 11,5/11.6,5 cm, din care prostata masoara 5,5/4,5/2,5 cm. La nivelul hemivezicii drepte, pe peretele lateral, se observa o formatiune tumorala ulcerata, rosietica, subdenivelata, cu pliuri aplatizate, cu dimensiuni de 2,5/1,5 cm. Formatiunea tumorala este situata la 0,6 cm de marginea de rezectie laterala, la 1,5 cm de marginea de rezectie posterioara si la 2,5 cm de maginea de rezectie anterioara.Piesa a fost marcata dupa cum urmeaza: marginea de rezectie anterioara – tus albastru, marginea de rezectie lateral dreapta – verde, margine de rezectie lateral stanga – rosu, marginea de rezectie posterioara – negru.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 7/6,5/1,5 cm, reprezentate de tesut adipos si limfoganglioni.Piesa 3:Piesa de excizie chirurgicala cu dimensiuni de 1,1/0,5/0,4 cm, care are atasat un clip de plastic a carui semnificatie nu este precizata.Piesa 4:Piesa de excizie chirurgicala cu dimensiuni de 0,6/0,5/0,3 cm.", "microscopic_exam": "Piesa 1:Sectiunile prelevate si examinate de la nivelul formatiunii tumorale vezicale descrise macroscopic releva un carcinom urotelial de grad inalt, cu diferentiere glandulara, ulcerat, care invadeaza peretele vezical pana la nivelul tesutului adipos perivezical, depasind in totalitate stratul muscular (musculara propria), pe o distanta de 6 mm. Peri-tumoral se observa tesut fibro-conjunctiv dens, alcatuit din fibroblaste cu atipii moderate si numeroase structuri vasculare, aspect care este intalnit in urma tratamentului neoadjuvant (a se interpreta in context clinic).Mucoasa vezicala adiacenta prezinta arii de metaplazie scuamoasa, arii de ulceratie si exocitoza neutrofilica. Pe sectiunile examinate nu se observa carcinom in situ.Infiltrare tumorala perineurala prezenta. (Pn1)Pe sectiunile examinate nu se observa invazie angio-limfatica certa. (L0)Marginile de rezectie chirurgicale nu contin elemente histopatologice de malignitate. Cea mai apropiata margine de rezectie, lateral-dreapta, este situata la 7 mm de formatiunea tumorala. (R0)Sectiunile prelevate si examinate de la nivelul prostatei releva arii de hiperplazie nodulara, atrofie chistica si arii de prostatita acuta. Se observa focare de neoplazie intraepiteliala prostatica de grad inalt (HGPIN).Se observa numerose vase cu ateroscleroza, atat peri-prostatic, cat si peri-vezical.", "immuno_examination": "GATA-3 – imunomarcajul pozitiveaza nuclear la nivelul celulelor tumorale; martor intern pozitivPiesa 2:Materialul examinat este reprezentat de tesut adipos si 10 limfoganglioni cu arii extinse de hialinizare si histiocitoza sinusala. Pe sectiunile examinate nu se observa elemente histopatologice de malignitate. 0/10Piesa 3:Materialul primit, prelucrat in totalitate, este reprezentat de structuri vasculare, tesut adipos si fragmente de perete muscular, fara elemente histopatologice de malignitate.Piesa 4:Materialul primit, prelucrat in totalitate, este reprezentat de structuri vasculare si ureter cu epiteliul denudat, fara elemente histopatologice de malignitate.", "diagnosis": "Carcinom urotelial invaziv de grad inalt cu diferentiere glandulara pT3aN0(0/10)Mx L0V0Pn1R0. Neoplazie intraepiteliala prostatica de grad inalt. Prostatita. Hiperplazie nodulara prostatica.", "medical_codes": "ICD-O 8148/2", "doctor": 43}, {"gross_exam": "Piesa 1:Fragment tisular cu dimensiuni de 0,2/0,2/0,2 cm.Piesa 2:In acelasi recipient au sosit 4 fragmente care cumulat masoara 0,8/0,7/0,3 cm.Piesa 3:Fragment tisular cu dimensiuni de 0,4/0,4/0,3 cm.", "microscopic_exam": "Recipient marcat 1:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu arhitectura pastrata, care prezinta la nivelul corionului un folicul limfoid. Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.Recipient marcat 2:Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa colonica cu arhitectura criptelor mult ramificata, cu pastrarea secretiei de mucus. Focal se observa glande inghesuite cu formare de structuri cribriforme, constituite din celule cu atipii marcate. Este prezent infiltrat inflamator neutrofilic dispus atat sub forma de abcese criptice cat si difuz la nivelul corionului.", "diagnosis": "Gastrita cronica, cu activitate moderata, inflamatie moderata, HP++.", "medical_codes": "ICD-O:8213/0", "doctor": 32}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit doua fragmente tisulare cu dimensiuni de 0,2/0,2/0,1 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente tisulare care cumulat masoara 0,7/0,7/0,3 cm.Piesa 3:In acelasi recipient au sosit trei fragmente tisulare cu dimensiuni cumulate de 0,8/0,6/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica care includ si o rama fina de submucoasa. Epiteliul de suprata este intact, cu exceptia unei arii mici unde epiteliul este decolat, insa fara modificari inflamatorii reactive. Corionul contine vase cu staza moderata si arii mici de hemoragie.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de 6 fragmente de mucoasa colonica. Trei dintre acestea prezinta modificari caracteristice adenomului tubular cu grad redus de displazie.", "diagnosis": "Adenom tubular cu displazie de grad redus.Piesa 3:Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa colonica care contin la nivelul corionului arii de edem moderat si infiltrat inflamator redus, alcatuit din limfocite, plasmocite si rare polimorfonucleare. Pe sectiunile examinate nu se observa fenomene de activitate sau modificari histopatologice de malignitate.", "doctor": 29}, {"gross_exam": "In acelasi recipient au sosit doua piese de punch biopsie cu dimensiuni de 0,4/0,4/0,5, respectiv 0,4/0,4/0,5 cm. Una dintre piese prezinta pe suprafata un punct rosietic.", "microscopic_exam": "Piesa 1:Primul fragment, prelucrat in totalitate, este reprezentat de tegument cu ortokeratoza si spongioza epidermala redusa. La nivelul epidermului se observa o bula intraepidermala care contine rare celule inflamatorii polimorfonucleare si colonii bacteriene. Pe aceiasi sectiune, la distanta de bula descrisa anterior, se mai observa o arie mica de ulceratie acoperita de crupta alcatuita din fibrina, neutrofile, detritusuri celulare si fragmente de strat cornos epidermal cu parakeratoza. Dermul papilar prezinta infiltrat inflamator limfo-plasmocitar dispus difuz perivascular, insa fara prezenta de microabcese neutrofilice.Al doilea fragment, prelucrat in toltaitate, este reprezentat de tegument cu ortokeratoza, spongioza epidermala minima si exocitoza intraepiteliala minima. Dermul papilar prezinta infiltrat inflamator limfo-plasmocitar dispus perivascular.", "doctor": 33}, {"gross_exam": "Piesa de excizie chirurgicala cu dimensiuni de 0,6/0,6/0,4 cm, de culoare albicioasa, consistenta elastica.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este recoltat superficial si prezinta papilomatoza a epidermului, cu hiperkeratoza si parakeratoza marcata pastrarea stratului granular. S-au efectuat multiple sectiuni seriate si reincluderea piesei in blocul de parafina cu schimbarea pozitiei, insa nu s-a interceptat derm.", "diagnosis": "Aspectul histopatologic descris este inalt sugestiv pentru veruca vulgara.recoltat superficial", "doctor": 33}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/2/1 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,1/0,8/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare care inglobeaza fragmente de mucoasa endometriala cu aspect histologic de faza proliferativa. Focal raportul glande/stroma este crescut, glandele sunt inghesuite, cu stroma putin interpusa. Se observa de asemeneaza un fragment polipoid, tapetat pe 3 fete de epiteliu cubic, unistratificat, alcatuit din glande dilatate, ramificate dispuse intr-o stroma cu vase dispuse in manunchiuriSunt prezente si mici fragmente de mucoasa endocervicala.", "diagnosis": "Hiperplazie endometriala simpla fara atipii. Polip endometrial.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endocervicala fara modificari histologice notabile pe sectiunile examinate.Sunt prezente cateva fragmente mici de epiteliul scuamos, fara suport stromal si fara leziuni scuamose intraepiteliale.", "doctor": 54}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2,5/2/1 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare care inglobeaza fragmente de mucoasa endometriala cu colaps stromal si glandular marcat. La nivelul stromei se observa agregante fibrinoase, iar intraepitelial este prezenta exocitoza neutrofilica.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "diagnosis": "Mucoasa endometriala de faza menstruala????Confirmare", "doctor": 30}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1/0,3 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 0,8/1/0,3 cm.", "microscopic_exam": "Piesa 1Materialul primit, prelucrat in totalitate, este reprezentat mase muco-leucocitare care inglobeaza rare structuri glandulare fara suport stromal si fragmente de epiteliu scuamos stratificat fara leziuni intraepiteliale scuamoase.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa cervicala, care prezinta la nivelul stromei exocervicale infiltrat inflamator limfo-plasmocitar, dispus difuz, in cantitate redusa, alaturi de arii de microhemoragie.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "doctor": 31}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1,5/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala alcatuita din stroma si glande endometriala de faza proliferativa. Focal sunt prezente glande aglomerate, cu stroma minima interpusa intre ele si fara atipii citologice.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "diagnosis": "Aspectul histopatologic descries corespunde unei hiperplazii endometriale simple, fara atipii, posibil in context post-tratament.", "doctor": 31}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/1/0,2 cm, reprezentate de material mucos si coaguli de sange.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare, scuame, fragmente de mucoasa endocervicala si fragmente de epiteliul scuamos stratificat. Fragmentele de mucoasa endocervicala prezinta arii de metaplazie scuamoasa completa. La nivelul fragmentelor de epiteliu scuamos nu se observa leziuni intraepiteliale scuamoase.Se mai observa fragmente foarte mici reprezentate de glande endometriale, insa fara fara suport stromal.", "immuno_examination": "Avand in vedere absenta structurilor endometriala fara stroma cd 138 neinterpretabil", "doctor": 31}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1,5/0,3 cm.Piesa 2:Fragment tisular cu dimensiuni de 0,5/0,6/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hematice si fragmente de mucoasa endometriala cu caracteristici histologice de faza proliferativa. Unele dintre fragmente prezinta stroma fibroasa cu vase cu pereti ingrosati si glande endometriale dilatate, aspecte sugestive polipului endometrial. Se observa si rare fragmente mici de mucoasa endocervicala.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.???Unele sunt fragmente de polip! CD138?Piesa 2:Materialul primit, prelucrat in totalitate este reprezentat de un fragment polipoid alcatuit din stroma hipercelulara, de aspect fibros, cu glande dilatate, ramificate si vase cu pereti ingrosati.", "diagnosis": "Polip endometrial.", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit 3 fragmente tisulare cu dimensiuni de 0,3/0,2/0,2, 0,3/0,2/0,2, respectiv 0,3/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa colonica cu caracteristici histopatologice compatibile cu polipul colonic hiperplazic.", "diagnosis": "Polipi hiperplazici.", "doctor": 78}, {"gross_exam": "Piesa de excizie tegumentara cu dimensiuni de 1,2/0,7/0,4 cm, care prezinta pe suprafata o macula hiperpigmentata cu dimensiuni de 0,5/0,5 cm, situata la 0,2 cm fata de cea mai apropiata margine de rezectie laterala.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta pe suprafata o formatiune papilomatoasa, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul dermului, fara atipii citologice sau arhitecturale, cu fenomene de maturare in profunzime. Marginile de rezectie sunt libere.", "diagnosis": "Nev papilomatos dermal excizat in totalitate.", "doctor": 78}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit trei fragmente tisulare cu dimensiuni de 0,4/0,3/0,2 cm.Piesa 2:Fragment tisular cu dimensiuni de 0,5/0,5/0,4 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa. Doua dintre fragmente sunt tapetata de epiteliul foveolar cu prezenta de glande corporeale care contin atat celule parietale cat si celule principale. Al treilea fragment are tapet intestinal, cu prezenta de vilozitati intestinale, insa pe o arie redusa, epiteliul este decolat, iar subiacent se observa glande gastrice.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 54}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,6/0,5/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este repezentat de un fragment de mucoasa endometriala cu arii extinse de edem, cu aspect histologic de faza proliferativa.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (6 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 29}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit:-\tFragment de tesut adipos cu dimensiuni de 8/4/2 cm, invadat de multiple formatiuni tumorale, de culoare albicioasa, consistenta crescuta.-\tPiesa de citoprostatectomie cu dimensiuni de 8,5/7/8 cm. Pe sectiune, la nivelul hemiprostatei stang, se observa o formatiune tumorala albicioasa, de aspect nodular, de consistenta crescuta, cu dimensiuni de 2,2/1,5 cm, care se extinde inspre superior, perivezical.Piesa 2:Fragment de ureter cu lungimea de 2,2 cm, nemarcat si neorientat.Piesa 3:Fragment de ureter cu lungimea de 1,5 cm, nemarcata si neorientat.", "microscopic_exam": "Piesa 1:Note-\tPn1-\tMR inframilimetric la bl 1-\tAtipii stromale (post iradiere/chimio??)-\tMR apex dr, stg pozitiv-\tTesut adipos periprostatic invadat tumoralS-au prelevat si examinat sectiuni multiple etajate de la nivelul prostatei si de la nivelul vezicii urinare. Regiunea posterioara a prostatei si a vezicii urinare este invadata de o formatiune tumorala maligna alcatuita din structuri glandulare de aspect cribriform, tapetate de celule cubice, cu raportul nucleu/citoplasma crescut, cu nucleoli proeminenti, pleomorfism marcat si numeroase mitoze. Formatiunea tumorala prezinta arii extinse de necroza, abcedare si fistulizare in parenchimul prostatic si tesutul perivezical.Marginea de rezectie chirurgicala la nivelul apexului si fetei posterioare a prostatei este pozitiva tumoral. R1Tesutul adipos periprostatic este invadat tumoral.Infiltrare tumorala perineurala prezenta.La nivelul apexului prostatei se observa atipii citologice stromale, mai posibil in contextul tratamentul neoadjuvant.Tesutul adipos sosit separat contine multiple formatiuni tumorale de tipul adenocarcinomul de tip intestinal.", "immuno_examination": "CDX2 – pozitiv nuclear la nivelul celulelor tumoralePSA – negativ la nivelul celulelor tumorale; martor intern pozitiv.", "diagnosis": "Adenocarcinom de tip intestinal, moderat diferentiat G2 cu extensie in parenchimul prostatic si tesutul conjunctiv perivezical. R1 8140/9Piesa 2:S-a prelevat cate o sectiune de tip “shave” de la nivelul fiecarei margini ureterale. Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.Piesa 3:S-a prelevat cate o sectiune de tip “shave”de la nivelul fiecarei margini ureterale. Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "doctor": 34}, {"gross_exam": "Piesa 1:Piesa chirurgicala cu dimensiuni de 9,5/4/1,5 cm, reprezentata de tesut adipos si limfoganglioni.Piesa 2:Piesa chirurgicala cu dimensiuni de 3,5/3/1 cm, reprezentata de tesut adipos si limfoganglioni.Piesa 3:Piesa chirurgicala cu dimensiuni de 11,5/5,5/2 cm, reprezentata de tesut adipos si limfoganglioni. Cel mai mare limfoganglion masoara 3/2,5/2 cm. Pe sectiune acesta are aspect inomogen, multichistic cu zone solide galbui.Piesa 4:Piesa chirurgicala cu dimensiuni de 2,5/2/0,4 cm.", "microscopic_exam": "Piesa 1:S-au decelat si examinat 23 de limfoganglioni, dintre care 6 contin metastaze de teratom alcatuite din componente mature, reprezentate de formatiuni chistice cu tapet variat, epiteliu repirator, epiteliu gastro-intestinal si epiteliu cubic si arii de tesut mezenchimal. Se observa un embol limfatic alcatuit din formatiuni chistice tapetate de epiteliu cubic, unistratificat. Pe sectiunile examinate nu se observa componenta tisulara imatura. (6/23)Piesa 2:Epiteliu intestinal, cubic, cartilaj hialin, gigante multinucleate de corp strainS-au decelat si examinat 10 limfoganglioni. Unul dintre acestia contine metastaze de teratom alcatuit din componente mature reprezentate de formatiuni chistice cu tapet variat (epiteliu respirator epiteliu intestinal), cartilaj si tesut conjunctivo-vascular. Focal se observa reactie giganto-celulara de corp strain, datorate mai probabil ruperii unor structuri chistice. (1/10)Piesa 3:S-au decelat si examinat 19 limfoganglioni, dintre care 4 contin metastaze de teraom alcatuit din componente mature reprezentate de formatiuni chistice cu tapet variat (epiteliu de tub digestiv, epitelu cubic unistratificat), cartilaj si mase lamelare de keratina cu reactie giganto-celulare de corp strain fara epiteliu intact prezent. Se observa si doi emboli vasculari alcauiti din structuri chistice cu tapet variat. Pe sectiunile examinate nu se observa componenta tisulara imatura. (4/19)Piesa 4:Materialul primit, prelucrat in totalitate, este reprezentat de tesut adipos si un limfoganglion fara metastaze pe sectiunile examinate. (0/1)Metastaze limfoganglionare de teratom. ( 11/53) ", "medical_codes": "ICD-O:9080/6", "doctor": 1}, {"gross_exam": "Piesa 1:Piesa de excizie chirurgicala cu dimensiuni de 10/8/1 cm, reprezentata de capsula periprostatica.Piesa 2:Piesa de excizie chirurgicala cu dimensiuni de 11/9/1 cm, reprezentata de capsula periprotetica.", "microscopic_exam": "Perete conjunctivo-vascular si musculat striat ce prezinta moderate artefacte electrotermice pe fata profunda; pe fata interna, periprotetica sunt prezente arii extinse de metaplazie de tip sinovial (synovial-like metaplasia); subiacent se identifica moderata remaniere fibro-inflamatorie cu minim infiltrat inflamator cronic limfo-plasmocitar distribuit difuz. Focal se observa lipogranuloame. afdfa", "immuno_examination": "CD30 - reactie absenta pe sectiunile tisulare examinate fdafdsALK1 - reactie absenta pe sectiunile tisulare examinate   gsfdgs", "diagnosis": "Capsule periprotetice mamare cu metaplazie sinoviala si paucicelularitate limfo-plasmocitara (CD30-, ALK1-).", "doctor": 30}, {"gross_exam": "Piesa de excizie chirurgicala cu dimensiuni de 0,4/0,3/0,3 cm, cu aspect papilomatos, de culoare maronie.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta pe suprafata o formatiune papilomatoasa, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul jonctiunii dermo-epidermale si dermului, fara atipii citologice sau arhitecturale, cu fenomene de maturare in profunzime. Marginile de rezectie sunt libere.", "diagnosis": "Nev papilomatos compus excizat in totalitate.", "doctor": 34}, {"gross_exam": "Piesa 1:Piesa de prostatectomie radicala cu greutatea de 73 grame, care masoara 6,5/4,5/3,5 cm, cu vezicula seminala stanga de 4 cm lungime, vezicula seminala dreapta de 3,5 cm lungime, duct deferent stang de 5 cm lungime si duct deferent drept de 4 cm lungime.  Pe fata antero-laterala dreapta se identifica o artera cu clip metallic.Marginile de rezectie chirurgicale au fost marcate dupa cum urmeaza: anterior - tus albastru, posterior - tus negru, lateral stang - tus verde, lateral dreapta - tus rosu.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 10/4,5/2 cm, reprezentat de tesut adipos si limfoganglioni.Piesa 3:Piesa cu dimensiuni de 1,2/1/1 cm, acoperita partial de mucoasa.", "microscopic_exam": "Note-\tMetaplazie scuamosa-\tProstatita, granuloame, tesut de granulatie-\tHiperplazie nodulara-\tAtrofie-\tHiperplazie de celule bazale-\tTrombozaPiesa 1:Sectiunile prelevate si examinate de la nivelul prostatei releva, periuretral, arii extinse de tesut de granulatie, infiltrat inflamator mixt, dispus difuz, fibroza, granuloame cu necroza fibrinoida, vase cu tromboza si arii de abcedare. La nivelul parenchimului prostatic se observa arii de metaplazie scuamoasa, arii de hiperplazie nodulara, arii de hiperplazie cu celule bazale si atrofie.Focal sunt prezente arii de neoplazie intraepiteliala prostatica de grad inalt.Fara adenocarcinom acinar restant pe sectiunile examinate.", "immuno_examination": "p63 – imunomarcajul p63 evidentiaza celule bazale la nivelul zonelor suspecte; acesta infirma prezente componentei invazive.", "diagnosis": "Carcinom intraductal prostatic. Neoplazie intaepiteliala prostatica de grad inalt. Prostatita post-procedurala.Hiperplazie nodulara de prostata.Piesa 2:S-au decelat si examinat 9 limfoganglioni. Acestia prezinta capsula ingrosata, histiocitoza sinusala, arii extinse de hialinizare si involutie adipoasa. Pe sectiunile examinate nu se observa elemente histopatologice de malignitate. (0/9)Piesa 3:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de tesut fibros cu structuri vasculare si filete nervoase, care prezinta la unul dintre capete tesut de granulatie alcatuit din infiltrat inflamator mixt si vase de neoformatie.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "medical_codes": "ICD-O:8148/2", "doctor": 30}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit trei fragmente care cumulat masoara 0,5/0,4/0,3 cm.Piesa 2:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,3/0,3/0,2 cm, respectiv 0,3/0,3/0,2 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente tisulare cu artefacte de strivire marcate, alcatuite din tesut conjunctiv cu rare glande Brunner strivite. S-au efectuat multiple sectiuni seriate, insa acestea nu au evidentiat detalii suplimentare.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa duodenala. Unul dintre fragmente prezinta o arie de ulceratie si modificari reactive epiteliale in mucoasa adiacenta.  Al doilea fragment prezinta o arie unde epiteliul de suprafata, impreuna cu vilozitatile intestinale, este decolat, insa fara modificari inflamatorii prezente.", "doctor": 33}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumula masoara 1/1,5/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala cu caractere histologice de faza proliferativa tardiva. La nivelul stromei se observa arii focale de edem. Unele fragmente prezinta stroma hipercelulara cu glande dilatate si usor dezorganizate, caractere intalnite in polipul endometrial.", "immuno_examination": " Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (21 plasmocite/10HPF)", "doctor": 34}, {"gross_exam": "Piesa 1:Fragment tisular cu dimensiuni de 0,9/0,6/0,4 cm, de consistenta elastica, culoare albicioasa.Piesa 2:Piesa de nefrectomie partiala cu dimensiuni de 7,5/5,5/2,5 cm, sosita sectionata de catre operator. La sectionare se observa o formatiune tumorala cu dimensiuni de 2,6/1,6/2,7 cm, aparent incapsulata, cu arii solide de culoare galbuie si arii chistice cu continut gelatinos, brun-hemoragic. Formatiunea tumorala pare sa invadeze sinusul renal. Adiacent formatiunii tumorale se observa o formatiune chistica cu dimensiuni de 2,4/2 cm, cu continut lichidian sero-citrin.Piesa 3:Piesa cu dimensiuni de 2,5/2,5/2 cm, acoperita partial de capsula la nivelul careia se observa o formatiune tumorala albicioasa, cu dimensiuni de 1,5/1,5 cm, situata la 0,5 cm fata de marginea de rezectie chirurgicala.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de un mic fragment de tesut conjunctiv fibro-adipos si fragmente de perete chistic alcatuit din tesut conjunctiv fibros, dens. Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.Piesa 3:Sectiunile prelevate de la nivelul formatiunii tumorale descrise macroscopic releva un hamartom alcatuit din numeroase structuri vasculare cu pereti ingrosati, ducte biliare de diferite calibre, unele aglomerate, cu pigment biliar in lumen si parenchim hepatic, toate dispuse intr-o stroma fibroasa. Adiacent hamartomului este prezent parenchim hepatic cu nuclei glicogenati si steatoza hepatica macroveziculara.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "diagnosis": "Carcinom renal cu celule clare grad Furhman (OMS/ISUP) G2, pT3aNxM0 L1V0R0. ", "medical_codes": "ICD-O: 8310/3", "doctor": 28}, {"diagnosis": "Aspectul histopatologic descris este compatibil cu adenocarcinom gastric subtipul mixt (tubular si slab coeziv) Piesa 3:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment tisular invadat de o proliferare tumorala maligna alcatuita din celule cu raportul nucleu/citoplasma crescut, cu pleomorfism moderat, dispuse in cordoane celulalare sau in grupuri mici. Stroma prezinta demoplazie marcata si infiltrat inflamator abundent mixt.Piesa 4:Materialul primit, prelucrat in totalitate, este reprezentat de 4 fragmente tisulare. Doua dintre fragmente sunt reprezentate de mase tumorale alcatuite din celule tumorale maligne, cu raportul nucleu/citoplasma crescut, cu pleomorfism nuclear moderata, nucleoli vizibili si citoplasma eozinofila. Celulele sunt asezate in plaje fara o arhitectura bine stabilita. Focal se observa si o componenta redusa de celule in inel cu pecete. Celalalte doua fragmente sunt reprezentate de epiteliu scuamos stratificat fara suport corional si de epiteliu scuamos stratificat cu infiltrat tumoral malign (cu trasaturi similare tumorii maligne descrise mai sus) la nivelul corionului subiacent.", "microscopic_exam": "Piesa 1:DOAR UN FRAGMENT (la macro erau doua)Materialul primit, prelucrat in totalitate, este reprezentat de mucoasa gastrica recoltata superficial, interceptand doar compartimentul foveolar, cu aspect histologic corespunzator zonei cardiale, ulcearata, care contine la nivelul corionului infiltrat inflamator abundent predominant neutrofilic si vase de neoformatie. Adiacent se observa scuame alcatuite din keratinocite si colonii bacteriene bacilare.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente tisulare invadate de o formatiune tumorala maligna, alcatuita din celule cu raportul nucleu/citoplasma mare, cu pleomorfism nuclear moderat, nucleoli vizibili. Pe unul dintre fragmente, celule tumorale formeaza structuri tubulare, cribriforme cu formare de microabces. Pe restul fragmentelor, celulele tumorale sunt asezate in plaje sau cordoane celulare cu desmoplazie stromala marcata.", "immuno_examination": "E-Cadherin: negativ la nivelul celulelor tumorale; martor intern pozitiv.", "medical_codes": "ICD-O: 8255/3", "doctor": 1}, {"gross_exam": "In acelasi recipient au sosit doua fragmente tisulare cu dimensiuni de 0,7/0,5/0,3 cm, respectiv 0,5/0,5/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mucoasa alcatuita din tapet epitelial scuamos stratificat si stroma cu lobuli de glanda salivara, infiltrata de o formatiune tumorala de tipul carcinomului scuamos keratinizant, moderat diferentiat G2. Stroma tumorala prezinta desmoplazie moderata si infiltrat inflamator mixt in cantitate moderata. Pe sectiunile examinate nu se observa imagini certe de invazie angio-limfatica sau infiltrare perineurala.", "diagnosis": "Carcinom scuamos keratinizant, moderat diferentiat G2. ", "medical_codes": "ICD-O:8071/3", "doctor": 35}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,3/0,3/0,2 cm.Piesa 2:Au sosit doua recipiente, fiecare contine un material textil impregnat cu sange si coaguli.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de tesut adipos cu arii de fibroza si structuri vasculare.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate. Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare si cateva fragmente de mucoasa endometriala alcatuite din stroma cu fenomene de colaps si glande endometriale fara mitoze, fara vacuole citoplasmatice, unele cu metaplazie sicitiala si cu numerosi corpi apoptotici, caracteristici histologice intalnite in faza menstruala a ciclului endometrial.Focal se observa un fragment foarte mic de mucoasa exocervicala fara suport stromal si un fragment mic de mucoasa endocervicala, ambele fara modificari histopatologice de malignitate.", "doctor": 54}, {"gross_exam": "In acelasi recipient au sosit patru fragmente tisulare cu dimensiuni cumulate de 0,9/1/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 6 fragmente de mucoasa colonica cu arhitectura criptelor pastrata si fara modificari adenomatoase pe sectiunile examinate. La nivelul corionului se observa edem moderat, microhemoragii subepiteliale si infiltrat inflamator minim, dispus difuz, alcatuit din limfocite, plasmocite si eozinofile.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1,5/1,5 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala alcatuita din stroma si glande endometriale de faza proliferativa tardiva. Pe sectiunile examiante nu sunt suficiente elemente histopatologice sugestive polipului endometrial.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (15 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit 4 fragmente cu dimensiuni cumulate de 0,9/0,9/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala si un fragment de mucoasa istmica. Acestea prezinta caractere histologice sugestive fazei secretorii a ciclului endometrial.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (8 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 33}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala cu caractere histologice care sugereaza faza proliferativa a ciclului endometrial. La nivelul stromei se observa arii de edem si microhemoragie, iar pe suprafata se observa mase de mucus cu numeroase neutrofilie.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (23 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/1,2/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala alcatuite din glande si stroma endometriala cu aspect de faza proliferativa.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (30 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 34}, {"gross_exam": "In acelasi recipient au sosit trei fragmente cu dimensiuni de 0,5/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa colonica. Unul dintre fragmente prezinta modificari histopatologice caracteristice adenomului tubular cu displazie de grad redus.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit patru fragmente tisulare cu dimensiuni cumulate de 1/0,6/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de patru fragmente de mucoasa gastrica antro-pilorica cu hiperplazie foveolara marcata, care prezinta la nivelul corionului fibroza redusa, atrofie redusa si infiltrat inflamator moderat, dispus difuz, alcatuit din limfocite, plasmocite si rare polimorfonucleare. Sunt prezente fenomene de activitate de tipul criptitei in cantitate redusa. Se observa metaplazie intestinala completa in proportie de 20%.Pe sectiunile examinate in coloratie uzuala, hematoxilina-eozina, nu se observa displazie sau colonii de Helicobacter pylori.", "diagnosis": "Gastrita cronica, intensitate moderata, activitate redusa, atrofie redusa.", "doctor": 31}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/0,8/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase compacte alcatuite din hematii, mucus, detritusuri celulare si fragmente de glande endometriale de aspect inactiv fara suport stromal. Se mai observa fragmente mici alcatuite din stroma fibroasa si tapet epitelial cubic, provenite mai probabil de la nivelul endocervixului.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.???Confirmare???", "doctor": 32}, {"microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta pe suprafata o formatiune papilomatoasa, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul dermului, fara atipii citologice sau arhitecturale, cu fenomene de maturare in profunzime. Marginile de rezectie sunt libere.", "diagnosis": "Nev papilomatos compus cu caractere de nev congenital, excizat in totalitate.", "doctor": 33}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/0,7/0,4 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,8/1,7/1,5 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de 4 fragmente de mucoasa cervicala recoltate de la joncitunea scuamo-columnara. Doua dintre fragmente prezinta, la nivelul epiteliului, leziuni scuamoase intraepiteliale de grad redus, reprezentate de atipii citologice limitate la treimea bazala a epiteliului de acoperire. Se mai observa metaplazie scuamoasa completa cu extensie la nivelul glandelor endocervicale.", "diagnosis": "Leziuni scuamoase intraepiteliale de grad redus (LSIL, CIN I) Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hematice care inglobeaza fragmente de mucoasa endometriala cu aspect histologic de faza proliferativa, care prezinta la nivelul stromei arii de edem si microhemoragie. Focal se observa cateva fragmente de epiteliu scuamos stratificat, fara modificari patologice.", "medical_codes": "ICD-O: 8077/0", "doctor": 33}, {"gross_exam": "Piesa 1:Piesa de prostatectomie radicala cu greutatea de 50 grame, care masoara 3,5/4,5/4 cm, cu vezicula seminala stanga de 2,5 cm lungime, vezicula seminala dreapta de 2,3 cm lungime, duct deferent stang de 3,5 cm lungime si duct deferent drept de 4 cm lungime.Marginile de rezectie chirurgicale au fost marcate dupa cum urmeaza: anterior-albastru, posterior-negru, lateral stanga-verde, lateral dreapta-rosu.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 11/12/2,5 cm.Piesa 3:Piesa de excizie chirurgicala cu dimensiuni de 2/1/0,7 cm, care are atasat un clip metalic. Marginea opusa clipului metalic a fost considerata margine de rezectie si a fost marcata cu tus negru.", "microscopic_exam": "Piesa 1:Margine de rezectie apex- negativa tumoral;Margine de rezectie ducte deferente- negative tumoral, bilateral;Margine de rezectie baza prostata- negativa tumoral;Toate marginile chirurgicale de rezectie periprostatice trec in tesut sanatos. Formatiunea tumorala este situata la o distanta inframilimetrica de marginea de rezectie latero-posterioara dreapta. (R0)Insertia prostatica a veziculelor seminale- pozitiva tumoral la nivelul veziculei seminale drepte.Parenchimul prostatic prezinta multiple focare de adenocarcinom acinar prostatic, scor Gleason  3 + 4 =  7, grup de grad 2, localizate in ambii lobi, etajele  apex, mediu, baza si care ocupa aproximativ 20% din suprafata examinata a glandei prostatice.  Din suprafata tumorala examinata 95% este ocupata de componenta primara, 5% de componenta secundara. Formatiunea tumorala invadeaza tesutul adipos periprostatic.Carcinom intraductal prezent in procent de 1% din suprafata tumorala.Sunt prezente structuri cribriforme.Fara prezenta invaziei venoase pe sectiunile examinate.(V0)Fara emboli limfatici tumorali pe sectiunile examinate. (L0)Infiltare tumorala perineurala prezenta.(Pn1)Sunt prezente focare de neoplazie intraepiteliala prostatica de grad inalt (HG PIN).Parenchimul prostatic netumoral prezinta hiperplazie nodulara, infiltrat inflamtor mixt stromal redus si glande prostatice dilatate cu agregate neutrofilice in lumen.Piesa 2:Materialul examinat este reprezentat de tesut adipos si 14 limfoganglioni cu histiocitoza sinusala, hialinizare si involutie adipoasa. Pe sectiunile examinate nu se observa metastaze. (0/14)Piesa 3:Materialul primit, prelucrat in totalitate, este reprezentat de tesut adipos, structuri vasculare, filete nervoase si ganglioni nervosi. Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "diagnosis": "Adenocarcinom acinar prostatic scor Gleason 3+4 = 7, grup de grad 2, pT3bN0Mx L0V0Pn1R0. ", "medical_codes": "ICD-O:8140/3", "doctor": 33}, {"diagnosis": "Aspectul histopatologic descris corespunde unui hemangiom.", "gross_exam": "Piesa chirurgicala cu dimensiuni de 0,5/0,5/0,3 cm, de culoare gri-violacee.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de o formatiune polipoida tapetata de epiteliu scuamos stratificat, cu papilomatoza si cu hiperpigmentarea stratului bazal. La nivelul dermului sunt prezente numeroase structuri vasculare cu staza. Marginea de rezectie chirurgicala profunda este tangenta la formatiune polipoida.", "doctor": 31}, {"gross_exam": "Piesa de excizie tegumentara cu dimensiuni de 1,1/0,5/0,5 cm, care prezinta pe suprafata o formatiune tumorala supradenivelata de culoare maronie cu dimensiuni de 0,7/0,5 cm, situata in contact cu una dintre marginile de rezectie laterala.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta pe suprafata o formatiune papilomatoasa, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul dermului, fara atipii citologice sau arhitecturale, cu fenomene de maturare in profunzime. Marginile de rezectie sunt libere.", "diagnosis": "Nev papilomatos dermal excizat in totalitate.", "doctor": 44}, {"gross_exam": "Piesa 1:Piesa de excizie chirurgicala cu dimensiuni de 7/1,5/1 cm, reprezentata de tesut adipos si limfoganglioni.Piesa 2:Piesa de excizie chirurgicala cu dimensiuni de 8/1,4/1,2 cm, reprezentata de tesut adipos.Piesa 3:Piesa de excizie chirurgicala cu dimensiuni de 2,4/2/0,5 cm, reprezentata de tesut adipos.Piesa 4:Piesa de excizie chirurgicala cu dimensiuni de 2,5/3/2 cm, reprezentata de o formatiune tumorala albicioasa, de consistenta crescuta cu arii de necroza pe sectiune.Piesa 5:In acelasi recipient au sosit doua fragmente de parenchim renal cu dimensiuni de 3,7/2,8/2,1 cm, respectiv 2/3,5/2,2 cm. Capsula renala a fost marcata cu tus negru, iar marginea de rezectie chirurgicala parenchimatoasa (cea cu artefacte de cauterizare) a fost marcata cu tus verde.", "microscopic_exam": "Piesa 1:S-au decelat si examinat 3 limfoganglioni cu histiocitoza sinusala, fara elemente histopatologice de malignitate pe sectiunile examinate. (0/3)Piesa 2:Materialul examinat este reprezentat de tesut adipos si structuri vasculare. Nu s-au identificat limfoganglioni in materialul prelucrat.Piesa 3:Materialul primit, prelucrat in totalitate, este reprezentat de tesut adipos si un ganglion nervos. Nu s-au identificat limfoganglioni in materialul prelucrat.Piesa 4:Materialul primit, prelucrat in totalitate, este reprezentat de un limfoganglion ocupat aproape in totalitate de o formatiune tumorala alcatuita din celule rotund-ovalare, cu membrane citoplasmatice bine definite, nuclei situati central cu nucleoli vizibili. Celulele tumorale au o arihitectura lobulara despartite de septe fibroase cu infiltrat inflamator limfo-plasmocitar. Sunt prezente arii de necroza. Formatiunea tumorala depaseste capsula ganglionara.Pe sectiunile examinate se mai observa un limfoganglion, insa acesta nu contine elemente tumorale. (1/2)", "immuno_examination": "OCT3/4 – pozitiv nuclear la nivelul celulelor tumoralePLAP – pozitiv membranar la nivelul celulelor tumorale", "diagnosis": "Metastaze limfoganglionare de seminom. (1/2)Piesa 5:Materialul primit a fost prelucrat in totalitate. Acesta este reprezentat de parenchim renal cu artefacte de cauterizare prezente la nivelul capsulei si la nivelul sinusului renal. Este prezenta o arie mica de parenchim renal subcapsular, cu diameatrul de aproximativ 1 mm reprezentata de glomeruli sclerohialinizati si tesut interstitial cu infiltrat inflamator limfo-plamocitar in cantiate moderata.S-au efectuat 12 sectiuni tisulare cu grosimea de aproximativ 4 mm, insa pe niciuna dintre acestea nu se observa elemente histopatologice de malignitate.", "doctor": 34}, {"gross_exam": "Piesa de excizie chirurgicala cu dimensiuni de 2,5/2,5/2,3 cm, reprezentata de o formatiune tumorala cu dimensiuni de 2,5/2,4/2,4 cm, sectionata de catre operator. Pe sectiune, formatiunea tumorala are aspect inomogen, cu zone solide galbui si zone maronii. Capsula renala a fost marcata cu tus verde. Marginea de rezectie parenchimatoasa a fost marcata cu tus negru.", "microscopic_exam": "Sectiunile prelevate si examinate de la nivelul formatiunii tumorale descrise macroscopic releva o formatiune tumorala benigna, alcatuit din celule de talie medie, cu citoplasma granular-eozinofila, cu nuclei situati central, cu atipii minime, cu rare binucleeri si cu nuceloli situati central. Stroma prezinta arii de hialinizare, hipocelulare si o vascularizatie abundenta. Pe sectiunile examinate nu se observa arii de necroza tumorala. Indexul mitotic este scazut (0 mitoze/10HPF).", "immuno_examination": "CD117 (cKIT) – pozitiv intens, difuz, membranar la nivelul celulelor tumorale.CD10 – pozitiv membranar si citoplasmatic granular, difuz.CK7 – rare tumorale pozitive citoplasmatic.", "diagnosis": "Aspectul histopatologic descris, coroborat cu profilul imunohistochimic, este compatibil cu oncocitomul renal.ComentariiMorfologia si tiparul imunomarcajelor CD117 si CK7 favorizeaza oncocitomul. Desi imunomarcajul CD10 este intens pozitiv granular citoplasmatic si membranar, aceasta expresie este descrisa si in literatura de specialitate in unele cazuri de oncocitoame renale.", "doctor": 30}, {"gross_exam": "Piesa de nefrectomie partiala cu dimensiuni de 2,9/3,3/2,4 cm, sectionata de catre operator prin marginea de rezectie parenchimatoasa. Pe sectiune se observa o formatiune tumorala, aparent incapsulata, cu dimensiuni de 2,1/3 cm.", "microscopic_exam": "Formatiunea tumorala descrisa macroscopic este reprezentata de un carcinom renal cu celule clare, grad histologic Fuhrman (OMS/ISUP) G1. Tumora are arhitectura solida si alveolara, iar celulele sunt de talie mica, cu citoplasma clara si nuclei cu nucleoli mici, bazofili, greu vizibili la magnificatie 400x. Se observa o capsula fibroasa peritumorala. Focal formatiunea tumorala depaseste capsula fibroasa si invadeaza parenchimul renal adiacent. Nu se observa arii de necroza tumorala pe sectiunile examinate.Formatiunea tumorala este limitata la parenchimul renal.Pe sectiunile examinate nu se observa invazie angio-limfatica sau infiltrare perineurala.Marginile de rezectie chirurgicale nu contin elemente histopatologice de malignitate. (R0)In materialul examinat nu se identifica limfoganglioni.", "diagnosis": "Carcinom renal cu celule clare grad Fuhrman (OMS/ISUP) G1, pT1aNxMx L0V0R0. ", "medical_codes": "ICD-O: 8310/3", "doctor": 78}, {"gross_exam": "Piesa de conizatie cu dimensiuni de 2,4/2,6/1,5 cm, cu orificiul cervical extern in fanta, cu lungimea de 1.5 cm. Pe suprafata mucoasei se observa arii de eroziune periorificiale. Piesa este marcata cu un fir a carui semnificatie nu este precizata. Se considera marcajul fiind situat la ora 12.", "microscopic_exam": "Materialul primit a fost prelucrat in totalitate. Sectiunile prelevate si examinate, corespunzatoare orelor 4, 5, 6, prezinta leziuni intraepiteliale scuamoase de grad inalt (HSIL CIN III), situate la nivelul jonctiunii scuamo-columnare cu extensie la nivelul glandelor endocervicale. Se mai observa arii extinse de metaplazie scuamoasa matura, exocitoza neutrofilica si infiltrat inflamator mixt (limfocite, plasmocite, polimorfonucleare), dispus difuz la nivelul stromei subepiteliale.Sunt prezente doua focare mici care ridica suspiciunea de carcinom scuamos invaziv, insa pentru confirmarea acestuia sunt necesare teste imunohistochimice.Leziunile scuamoase sunt situate la 7,5 mm de marginea de rezectie exocervicala si la 5 mm de marginea de rezectie endocervicala.", "diagnosis": "Leziuni intraepiteliale scuamoase de grad inalt (HSIL CIN III), carcinomul invaziv nu poate fi explus. ", "medical_codes": "ICD-O: 8077/2", "doctor": 35}, {"immuno_examination": "", "doctor": 44}, {"immuno_examination": "Imunomarcajul Colagen IV evidentiaza membrana bazala continua.In coloratia imunohistochimica AE1/AE3 nu identificam aspect invaziv.Imunomarcajul CD31 (celule endoteliale) nu releva prezenta de embol vascular in aria de interes suspecta.Nu se identifica aspecte histopatologice de invazie.", "doctor": 29}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/2/0,6 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hematice, care inglobeaza fragmente foarte mici de mucoasa endometriala, fragmente foarte mici de mucoasa endocervicala si detritusuri celulare. S-au efectuat multiple sectiuni seriate, insa nici acestea nu au oferit detalii suplimentare.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.??? Confirmare", "doctor": 30}, {"gross_exam": "Piesa 1:Fragment tisular cu dimensiuni de 0,5/0,4/0,3 cm.Piesa 2:Fragment tisular cu dimensiuni de 0,5/0,4/0,3 cm.Piesa 3:Fragment tisular cu dimensiuni de 0,5/0,4/0,3 cm.Piesa 4:In acelasi recipient au sosit doua fragmente cu dimensiuni de 1/0,1/0,1 cm, respectiv 0,5/0,5/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu arhitectura criptelor pastrata, fara ramificari, fara dilatari si cu lungimea corespunzatoare. Lamina propria contine arii de edem, congestie moderata, microhemoragii si infiltrat inflamator moderat dispus difuz, alcatuit din limfocite, plasmocite, eozinofile si rare neutrofile. Epiteliul de suprafata este decolat partial de pe membrana bazala si inlocuit de un strat de mucus. Epiteliul intact prezinta atenuare secretiei de mucus. Membrana bazala este usor ingrosat, iar subiacent acesteia sunt prezenti numerosi corpi apoptotici. Mucusul de suprafata contine focal colonii microbiene.Pe sectiunile examinate nu se observa modificari caracteristice colitei pseudomembranoase sau colitei ulcerative.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu arhitectura criptelor pastrata. Pe suprafata epiteliului se observa mucus cu colonii bacteriene. Celulele epiteliului de acoperire au secretia de mucus redusa. Membrana bazala este usor ingrosata, iar subiacent se observa numerosi corp apoptotici. Focal sunt prezente decolari epiteliale reduse. Corionul contine infiltrat inflamator dispus difuz, alcatuit din limfocite, plasmocite si polimorfonucleare. Pe sectiunile examinate nu se observa modificari caracteristice colitei pseudomembranoase sau colitei ulcerative.Piesa 3:Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa colonica cu arhitectura pastrata, care prezinta la nivelul corionului infiltrat inflamator moderata, dispus difuz, alcatuit din limfocite, plasmocite, eozinofile si rare neutrofile. Epiteliul de suprafata prezinta secretia de mucus redusa, iar la baza acestuia se observa numerosi corpi apoptotici.Pe sectiunile examinate nu se observa modificari caracteristice colitei pseudomembranoase sau colitei ulcerative.Piesa 4:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica, cu arhitectura criptelor pastrata. La nivelul epiteliului de suprafata se observa filamente de mucus care inglobeaza detritusuri celulare si colonii bacteriene. La nivelul corionului se observa congestie moderata, edem redus si infiltrat inflamator dispus difuz, alcatuit din limfocite, plasmocite, numeroase eozinofile si rare neutrofile.Pe sectiunile examinate nu se observa modificari caracteristice colitei pseudomembranoase sau colitei ulcerative.Compatibil cu diagnosticul de Colita microscopica de tip colita colagenoasa", "doctor": 78}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,4/0,4/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa intestinala cu raportul vili/cripte pastrat si cu limfocitoza intraepiteliala in limite normale (12 limfocite /100 enterocite). Corionul prezinta congestie marcata si edem limitat la nivelul vilozitatilor.Pe sectiunile colorate in hematoxilina-eozina nu se observa Giardia Intestinalis.", "doctor": 32}, {"gross_exam": "Colecist cu lungimea de 8 cm, cu seroasa neteda si mucoasa de aspect colesterolotic.", "microscopic_exam": "Sectiunile prelevate de la nivelul peretelui vezicii biliare releva mucoasa cu arii de metaplazie pilorica si numeroase histiocite spumoase in lamina propria.", "diagnosis": "Colecistita cronica.", "doctor": 31}, {"gross_exam": "Piesa de excizie tegumentara cu dimensiuni de 1/0,4/0,5 cm, care prezinta pe suprafata o papula albicioasa, imprecis delimitata, cu dimensiuni de 0,3/0,3 cm, aparent tangenta la marginea de rezectie.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de tegument care prezinta la nivelul dermului un fragment restant dintr-o formatiune chistica cu tapet epitelial scuamos, stratificat, cu pastrarea stratului granular. Restul dermului contine vase de neoformatie si infiltrat inflamator marcat, dispus atat in foliculi limfoizi cat si difuz, alcatuit din limfocite, plasmocite si eozinofile. Focal, celulele inflamatorii sunt de talie medie, cu nucleoli eozinofili, dispusi central si care au aspect infiltrativ cu disecarea fibrelor de colagen.", "diagnosis": "Ridicam suspiciunea unui proces limfoproliferativ atipic. Recomandam imunofenotipare pentru transarea diagnosticului.", "doctor": 33}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,3/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu modifcari histopatologice corespunzatoare adenomului tubular cu grad redus de displazie.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 44}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit trei fragmente tisulare care cumulat masoara 0,5/0,3/0,2 cm.Piesa 2:Fragment tisular cu dimensiuni de 0,3/0,3/0,2 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip antral. Ambele fragmente prezinta la nivelul foveolelor numeroase colonii bacteriene de Helicobacter pylori HP+++. La nivelul corionului se observa infiltrat inflamator limfo-plasmocitar abundent dispus difuz subepitelial si in foliculi limfoizi in profunzime. Sunt prezente fenomene de activitate moderata de tipul criptitei.Pe sectiunile examinate nu se observa displazie sau metaplazie intestinala.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa gastrica de tip corporeal cu arii de ulceratie si arii de reepitelizare. Corionul contine infiltrat inflamator marcat alcatuit din limfocite, plasmocite, polimorfonucleare, dispus difuz si in pseudofoliculi limfoizi. Sunt prezente fenomene de activitate moderata, reprezentate de criptita si abcese criptice. La nivelul epiteliului de suprafata se observa colonii de Helicobacter pylori HP+++.Pe sectiunile examinate nu se observa displazie sau metaplazie intestinala.", "diagnosis": "Gastrita cronica de intensitate marcata, activitate moderata, HP+++.", "doctor": 32}, {"gross_exam": "In acelasi recipient au sosit trei fragmente care cumulat masoara 0,8/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa colonica. Doua dintre fragmente prezinta modificari histopatologice caracteristice adenomului tubular cu displazie de grad redus.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 28}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/1/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de 5 fragmente de mucoasa colonica.Patru dintre cele cinci fragmente prezinta modificari histopatologice caracteristice bolii inflamatorii intestinale. Criptele mucoasei sunt dilatate, ramificate, scurtate cu fenomene de activitate moderata de tipul criptitei si a abcesului criptic. Este prezent infiltrat inflamtor marcat, alcatuit din limfocite, plasmocite, eozinofile si neutrofile, dispus difuz cuprinzand lamina propria si musculara mucoasei, dar care focal formeaza si foliculi limofizi.La nivelul celui de-al cincilea fragment, arhitectura criptelor este pastrata, infiltratul inflamator mixt este in cantitate moderata dispus difuz, iar fenomenele de activitate (criptita) sunt reduse.", "diagnosis": "Aspectul histopatologic descris, in context clinic si endoscopic adecvat, este compatibil cu Boala Crohn.", "doctor": 44}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/2/1 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat defragmente de mucoasa endometriala cu aspect histologic de faza proliferativa.Glandele sunt sinuase, dilatate, focal inghesuite cu stroma putina interpusa intre ele si contin numeroase mitoze si numerosi corpi apoptotici. La nivelul stromei sunt prezente arii de edem, iar focal, glandele prezinta metaplazie tubara.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (16 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 28}, {"gross_exam": "In acelasi recipient au sosit trei fragmente cu dimensiuni cumulate de 0,8/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa antrala cu eroziuni epiteliale focale. La nivelul epiteliului de suprafata se observa exocitoza neutrofilica si microhemoragii subepiteliale. Sunt prezente fenomene de activitate moderata de tip criptitei. Lamina propria contine infiltrat inflamator mixt (limfocite, plasmocite, neutrofile), in cantitate moderata, dispus difuz.Pe sectiunile examinate, colorate in hematoxilina-eozina, nu se observa metaplazie intestinala, displazie sau Helicobacter pylori.", "diagnosis": "Gastrita cronica de intensitate moderata, cu activitate moderata.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit fragmente foarte mici cu dimensiuni cumulate de 0,4/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment tisular reprezentat de tesut de granulatie alcatuit din vase de neoformatie si infiltrat inflamator abundent alcatuit preponderent din neutrofile. Focal se obseva o rama fina de tapet scuamos stratificat cu exocitoza neutrofilica si modificari celulare reactive.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "diagnosis": "Aspectul histopatologic descris este compatibil cu diagnosticul clinic de esofagita de reflux.Comentarii:Tesutul examinat provine mai probabil dintr-o zona de ulceratie esofagiana.", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit 3 fragmente cu dimensiuni de 0,6/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa gastrica de tip corporeal. Unul dintre fragmente prezinta pe suprafata arii de eroziune acoperite de fibrina, iar epiteliul de acoperire adiacent prezinta exocitoza neutrofilica. Corionul subepitelial prezinta arii de edem si microhemoragie.Pe sectiunile examinate, colorate in hematoxilina-eozina, nu se observa inflamatie in corion, metaplazie, displazie, fenomene de activitate sau Helicobacter pylori.", "diagnosis": "Aspectul histopatologic descris este compatibil cu gastrita eroziva.", "doctor": 78}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/1/0,3 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,3/0,9/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa colonica. Toate fragmentele isi pastreaza arhitectura criptelor si niciunul nu prezinta modificari adenomatoase.Unul dintre fragmente prezinta infiltrat inflamator marcat, alcatuit din limfocite si plasmocite, dispus in pseudofoliculi limfoizi, ocupand toata grosimea mucoasei, iar focal se observa celule Paneth. Aceste modificari pot fi normale in cazul in care recoltarea acetui fragment sa facut de la nivelul colonului ascendent.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa ileala cu arhitectura vili/cripte pastrata si cu edem si congestie marcate la nivelul vilozitatilor intestinale. Trei dintre fragment prezinta la nivelul corionului infiltrat inflamator marcat alcatuit din limfocite si plasmocite dispus difuz in profunzime si din numeroase eozinofile si polimorfonucleare dispus supreficial. Focal se observa cateva cripte cu fenomene de activitate de tipul criptitei, iar supraiacent acestora este prezenta o arie de  eroziune.Pe sectiunile examinate nu sunt prezente elemente histopatologice de malignitate.", "diagnosis": "Ileita nespecifica.", "doctor": 30}, {"gross_exam": "Piesa 1:Piesa de excizie tegumentara cu dimensiuni de 1,1/0,56/0,2 cm, care prezinta pe suprafata numeroase cute.Piesa 2:In acelasi recipient au sosit doua fragmente cu dimensiuni de 1/0,4/0,3 cm, respectiv 1/0,5/0,4 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de tegument cu ortokeratoza, care la nivelul dermului prezinta reducerea anexelor tegumentare. Pe sectiunile examinate nu sunt suficiente elemente de specificitate pentru diagnosticul de sclerodermie.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de tegument alcatuit din epiderm si derm papilar. Pe sectiunile examinate nu se observa modificari histopatologice caracteristice sclerodermiei.", "doctor": 30}, {"microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de 4 fragmente de mucoasa gastrica de tip corporeal.Doua dintre fragmente prezinta hiperplazie foveolara marcata, cateva glande gastrice dilatate si corion cu edem, staza marcata si infiltrat inflamator limfo-plasmocitar, redus, dispus difuz.Celalalte doua fragmente prezinta pe suprafata pigment biliar si o arie mica de eroziune epiteliala acoperita de exudat fibrinos. Corionul superficial, subepitelial prezinta staza marcata si sufuziuni hematice.Pe sectiunile examinate nu se observa displazie, metaplazie intestinala, activitate sau Helicobacter pylori.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 54}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit doua fragmente fiecare cu dimensiuni de 0,4/0,4/0,3 cm.Piesa 2:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,5/0,4/0,3 cm, respectiv 0,4/0,4/0,4 cm.Piesa 3:Fragment tisular cu dimensiuni de 0,5/0,4/0,4 cm.Piesa 4:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,7/0,4/0,3 cm, respectiv 0,5/0,5/0,3 cm.Piesa 5:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,7/0,3/0,3 cm, respectiv 0,5/0,4/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip corporeal cu hiperplazie foveolara moderata si cu eroziuni acoperite de exudat fibrino-purulent. Corionul contine infiltrat inflamator limfo-plasmocitar in cantitate moderata dispus preponderent superficial.Pe sectiunile examinate, colorate in hematoxilina-eozina, nu se observa metaplazie intestinala, displazie, activitate sau Helicobacter pylori.", "diagnosis": "Polip colonic hiperplazic.", "doctor": 34}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/0,6/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala aflata in faza proliferativa a ciclului endometrial. Stroma contine arii de edem si microhemoragie.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (18 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2,2/2/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala aflata in faza proliferativa a ciclului endometrial. Focal, raportul glande/stroma este crescut, glandele sunt aglomerate cu stroma redusa interpusa intre acestea. Pe sectiunile examinate nu se observa atipii citologice. Stroma prezinta arii de edem si hemoragie. Sunt prezente si doua fragmente foarte mici de mucoasa endocervicala.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (14 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.Hiperplazie endometriala simpla fara atipii.", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente tisulare cu dimensiuni cumulate de 2/2/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala aflata in faza proliferativa a ciclului endometrial. Stroma contine arii de edem si microhemoragie.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 35}, {"gross_exam": "Piesa de excizie chirurgicala cu dimensiuni de 2/1/0,7  cm, acoperita partial de mucoasa.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa tapetata de epiteliu scuamos stratificat, keratinizat, cu acantoza marcata, cu parakeratoza focala si cu focare de koilocitoza. Se observa rare mitoze in treimea bazala a epiteliului. La nivelul stromei sunt prezente numeroase structuri vasculare de diferite calibre cu staza marcata, unele trombozate si cu extravazari hematice dispuse perivascular.", "diagnosis": "Displazie scuamoasa anala (neoplazie intraepiteliala) de grad redus. Hemoroizi.", "medical_codes": "ICD-O:8077/0", "doctor": 32}, {"gross_exam": "Piesa de excizie tegumentara cu dimensiuni de 2,4/1,3/1 cm, care prezinta pe suprafata o formatiune nodulara, sesila, cu dimensiuni de 1,5/1,3/1,2 cm, de consistenta elastica, culoare albastru-violacee, situata la 0,1 cm de cea mai apropiata margine de rezectie laterala. Pe sectiune, formatiunea nodulara are aspect spongios si culoare rosiatica.", "microscopic_exam": "Sectiunile prelevate si examinate de la nivelul formatiunii nodulare descrise macroscopic releva un hemangiom cavernos alcatuit din numeroase structuri vasculare cu staza marcata dispuse grupat la nivelul dermului.", "diagnosis": "Hemangiom cavernos.", "doctor": 28}, {"gross_exam": "Piesa de excizie chirurgicala cu dimensiuni de 6,7/1,1/0,8 cm, de aspect polipoid.", "microscopic_exam": "Materialul examinat este reprezentat de o formatiune polipida tapetata pe trei laturi de epiteliu cubic, unistratificat, alcatuita din glande de tip endometrial dilatate si stroma fibroasa cu numeroase structuri vasculare.", "diagnosis": "Aspectul histopatologic descris corespunde unui polip endometrial.", "doctor": 1}, {"diagnosis": " Polip serat. ", "gross_exam": "Recipient notat cu numarul “1”:Formatiune polipoida de aspect conopidiform, pediculata, cu dimensiuni de 1,9/1,1/0,7 cm.Recipient notat cu numarul “2”:In acelasi recipient au sosit multiple fragmente tisulare cu dimensiuni de 0,7/0,5/0,3 cm.Recipient notat cu numarul “4”:Formatiune polipoida cu dimensiuni de 0,9/0,6/0,5 cm.", "microscopic_exam": "Recipient 1Materialul primit, prelucrat in totalitate, este reprezentat de o formatiune polipoida cu arhitectura mucoasei modificata, alcatuita din structuri viloase si cripte serate, ramificate pe toata lungimea acestora, cu crestere orizontala in profunzime. Marginea de rezectie a pediculului nu contine modificari histopatologice.Pe sectiunile examinate nu se observa caractere histopatologice de displazie.", "medical_codes": "ICD-O:8213/0", "doctor": 31}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2,4/1,9/0,9 cm, reprezentate de fragmente albicioase, galbui, de consistenta ferm-elastica, unele partial incapsulate. Cel mai mare fragment masoara 1,5/0,7/0,8 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de o proliferare tumorala maligna alcatuita din celule de talie mare, cu raportul nucleu/citoplasma crescut, nuclei cu pleomorfism marcat, nucleoli intensi eozinofili si numeroase figuri mitotice. Celule tumorale stau asezate in cuiburi si produc reactie desmoplazica marcata.Pe sectiunile examinate nu se observa elemente histologice caracteristice limfoganglionului.", "immuno_examination": "AE1/AE3 – pozitiv la nivelul celulelor tumoralePAX8 – pozitiv la nivelul celulelor tumoraleWT1- pozitiv la nivelul celulelor tumoraleCK7 – pozitiv la nivelul celulelor tumoraleCK20 – negativGATA3 - negativVimentin – negativ la nivelul celulelor tumoraleTTF1 - negativS100 – negativ", "diagnosis": "Aspectul histopatologic descris, coroborat cu profilul imunohistochimic, este compatibil cu metastaza de carcinom seros de grad inalt cu originea la nivelul sferei genitale, mai probabil origine ovariana. ", "medical_codes": "ICD-O:8461/6", "doctor": 28}, {"gross_exam": "Piesa de excizie cutanat cu dimensiuni de 2/1,4/1,3 cm, cu lambou cutanat de 1,5/0,7 cm, eliptica, nemarcata si neorientata. Pe sectiune se observa o formatiune chistica cu diametrul de 0,5 cm, cu continut galbui omogen.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta la nivelul dermului o formatiune chistica, tapetata de epiteliu scuamos, stratificat, keratinizat, cu stratul granular prezent si fara anexe tegumentare pe sectiunile examinate. Stroma perichistica prezinta infiltrat inflamator limfo-plasmocitar in cantitate redusa.", "diagnosis": "Chist epidermoid.", "doctor": 44}, {"gross_exam": "Piesa de excizie chirurgicala cu dimensiuni de 2/1,3/1,3 cm, care prezinta pe suprafata un orificiu punctiform.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tesut fibro-vascular, care prezinta central o fistula tapetata de tesut de granulatie alcatuit din numeroase structuri vasculare si infiltrat inflamator bogat, alcatuit preponderent din polimorfonucleare. La baza fistulei se observa un fir de par cu reactie giganto-celulare de corp strain.", "diagnosis": "Chist pilonidal fistulizat.", "doctor": 34}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 3/2/1,5 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare, care inglobeaza rare fragmente de mucoasa endometriala cu aspect histologic de faza menstruala. Focal se observa un fragment mic, posibil provenit dintr-un polip endometrial, alcatuit din glande de tip secretor si stroma hipercelulara, fibroasa.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "diagnosis": "Aspectul histopatologic descris poate corespunde unui polip endometrial.", "doctor": 33}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1/0,4 cm.", "microscopic_exam": "Materiaul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala aflata in faza proliferativa tardiva a ciclului endometrial. Stroma prezinta arii extinse de edem si sufuziuni hematice.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (32 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 34}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2,5/1,5/0,6 cm. Unul dintre fragmente are aspect polipoid si masoara 1,5/0,6 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala aflata in faza secretorie incipienta a ciclului endometrial. Focal se observa un fragment mic de mucoasa exocervicala fara modificari histopatologice.Fragmentul de aspect polipoid descris macroscopic este reprezentat de un polip endometrial.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (17 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.Polip endometrial.", "doctor": 33}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/2/0,6 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentata de mase fibrino-hematice care inglobeaza rare fragmente de mucoasa endometriala aflata in faza proliferativa a ciclului endometrial. Stroma prezina arii de edem, microhemoragie si infiltrat inflamator dispus focal, alcatuit din limfocite, plasmocite si polimorfonucleare.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (24 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 43}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,4/0,1/0,1 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment foarte mic de epiteliu scuamos stratificat, nekeratinizat, fara suport stromal vizibil pe sectiunile examinate. Se observa o crestere a numarului de papile vasculare cu staza marcata si minima extravazare hematica, insa nu se observa eroziuni, spongioza sau infiltrat inflamator intraepitelial.", "diagnosis": "Aspectul histopatologic descris, in context clinic adecvat, poate corespunde unei esofagite de reflux.", "doctor": 34}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,4/0,2/0,2 cm.", "microscopic_exam": "Materialul primit a fost prelucrat in totalitate si este reprezentat de un fragment foarte mic constituit din tesut muscular striat cu infiltrat inflamator marcat, dispus difuz, alcatuit din limfocite, plasmocite si polimorfonucleare. Tesutul muscular este acoperit de tesut de granulatie care prezinta focal fenomene de reepitelizare si exudat fibino-hemato-leucocitar abundent.", "diagnosis": "Aspectul microscopic descris, coroborat cu datale clinice, poate corespunde unui ulcer esofagian.", "doctor": 34}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,3/0,3/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu congestie redusa.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "doctor": 33}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,3/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa gastrica de tip antral, care prezinta in suprafata hiperplazie foveolara moderata si arii de eroziune acoperite de fibrina. La nivelul corionului se observa vase cu staza moderata si infiltrat inflamator in cantitate redusa, dispus focal in foliculi limfoizi.Pe sectiunile examinate, colorate in hematoxilina-eozina, nu se observa displazie, metaplazie intestinala, atrofie, fenomene de activitate sau Helicobacter pylori.", "diagnosis": "Aspectul histopatologic descris, coroborat cu datele clinice, este compatibil cu diagnosticul clinic de gastropatie eritematoasa, eroziva.", "doctor": 28}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1/0,6/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de patru fragmente de mucoasa colonica cu modificari histopatologice corespunzatoare adenomului tubular cu displazie de grad redus.", "diagnosis": "Adenoame tubulare cu displazie de grad redus.", "doctor": 78}, {"gross_exam": "Piesa de excizie tegumentara, eliptica, cu dimensiuni de 6,7/3,2/0,7 cm, care prezinta pe suprafata o formatiune tumorala supradenivelata de aspect conopidiform, cu dimensuni de 6/2,8 cm.", "microscopic_exam": "Sectiunile prelevate de la nivelul formatiunii tumorale descrise macroscopic releva un nev sebaceu. Epidermul este acantotic si are aspect papilomatos, cu ortokeratoza si parakeratoza focala. Dermul contine numeroase glande sebacee, unele fara folicul pilos atasat si glande apocrine, focal dilatate.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "diagnosis": "Nev sebaceu excizat in totalitate.", "doctor": 44}, {"gross_exam": "In acelasi recipient au sosit patru fragmente care cumulat masoara 0,6/0,6/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de patru fragmente de mucoasa gastrica, dintre care trei fragmente sunt de tip corporeal si un fragment de tip antral. Toate fragmentele prezinta pe suprafata pigment biliar si arii de eroziune. Doua dintre fragmentele corporeale prezinta hiperplazie foveolara moderata, edem moderat si congestie moderata in corionul superficial.Pe sectiunile examinate, colorate in hematoxilina-eozina, nu se observa displazie, metaplazie, activitate, inflamatie sau Helicobacter pylori.", "diagnosis": "Aspectul histopatologic descris este compatibil cu gastropatia de reflux.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit cinci fragmente tisulare cu dimensiuni de 0,9/0,7/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de cinci fragmente de mucoasa gastrica de tip corporeal. Acestea prezinta hiperplazie foveolara, pigment biliar pe suprafata si arii de eroziune acoperite de exudat fibrinos. Corionul superficial prezinta edem, staza si extravazari hematice, iar focal, pe unul dintre fragmente, se observa infiltrat inflamator redus, dispus difuz, alcatuit din limfocite, plasmocite si rare eozinofile.Pe sectiunile examinate, colorate in hematoxilina-eozina, nu se observa displazie, metaplazie, activitate sau Helicobacter pylori.", "diagnosis": " Aspectul histopatologic descris, este compatibil cu gastropatia de reflux.", "doctor": 32}, {"gross_exam": "Piesa de punch biopsie cu dimensiuni de 0,5/0,5/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta la nivelul epidermului hiperplazie psoriaziforma cu parakeratoza focala si cu absenta focala a stratului granular. Dermul papilar contine structuri vasculare usor dilatate cu marginatie neutrofilica si infiltrat inflamator limfo-plasmocitar in cantitate redusa, dispus perivacular. La nivelul epidermului se observa minima exocitoza neutrofilica, insa fara formare de abcese Munro.", "diagnosis": "Aspectul histopatologic descris, in context clinic adecvat, este compatibil cu psoriazisul.", "doctor": 31}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit multiple fragmente cu dimensiuni cumulate de 1,5/1,5/0,4 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente cu dimensiuni cumulate de 1/1/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala recoltata mai probabil de la nivelul istmului, alcatuita din glande endometriale si glande endocervicale. Se observa si un fragment mic de epiteliu scuamos fara suport stromal.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa cervicala recoltate de la nivelul jonctiunii scuamo-columnare. Epiteliul exocervical isi pastreaza maturarea si nu prezinta atipii citologice. Mucoasa endocervicala prezinta cateva proiectii papilare tapetate de epiteliu columnar cu minime atipii reactive si cu exocitoza neutrofilica. Stroma endocervicala prezinta infiltrat inflamator dispus difuz, subepitelial, alcatuit din limfocite, plasmocite si rare neutrofile. Focal este prezente o arie de eroziune la nivelul jonctiunii scuamo-columnare.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "diagnosis": "Endocervicita papilara.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala cu aspect histologic de faza secretorie tardiva. La nivelul stromei se observa sufuziuni hematice focale.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 34}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1,2/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala cu aspect histologic de faza proliferativa. La nivelul stromei se obsera arii de edem si microhemoragii.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (13 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit doua piese de “punch” biopsie cu dimensiuni de 0,4/0,4/0,5 cm, respectiv 0,5/0,4/0,5 cm.", "microscopic_exam": "Fragmentele tisulare receptionat au fost prelucrate in totalitate. Acestea sunt reprezentate de tegument care prezinta la nivelul epidermului atrofie cu stergerea sau atenuarea crestelor epidermale si hiperpigmentarea focala a stratului bazal. La nivelul dermului papilar se observa incontinenta pigmentului melanic, iar perivascular sunt prezente rare celule inflamatorii mononucleare (limfocite si rare plasmocite).Absenta infiltratului inflamator de tip lichenoid si a spongiozei sugereaza faza inactiva a bolii.", "diagnosis": "Aspectul histopatologic descris, in context clinic adecvat, poate corespunde diagnosticului clinic de eritem discromic perstans, faza inactiva.", "doctor": 32}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,4/0,2/0,2 cm, respectiv 0,4/0,2/0,2 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 0,9/0,5/0,3 cm.", "microscopic_exam": "Piesa 1Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica cu arhitectura criptelor pastrata. La nivelu corionului se observa edem moderat, congestie moderata si infiltrat inflamator moderat, dispus difuz si in pseudofoliculi limfoizi, alcatuit din limfocite, plasmocite si eozinofile.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 30}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,5/0,4/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu modificari histopatologice corespunzatoare adenomului tubular cu displazie de grad redus.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 28}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,4/0,4/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa duodenala cu scurtarea focala a vilozitatilor intestinale, insa cu limfocitoza intraepiteliala in limite normale. Corionul vilozitar prezinta edem moderat, iar la nivelul corionului profund se observa infiltrat inflamator limfo-plasmocitar moderat, dispus difuz.Pe sectiunile examinate nu se observa caracteristici histopatologice specifice bolii Whipple.", "diagnosis": "Duodenita nespecifica", "doctor": 30}, {"gross_exam": "S-a receptionat un singur recipient marcat cu cifra “II” in care se gasesc 3 fragmente tisulare care cumulat masoara 0,6/0,6/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa colonica cu modificari histopatologice caracteristice adenomului tubular cu displazie de grad redus. Corionul contine infiltrat inflamator mixt (limfocite, plasmocite, polimorfonucleare) si arii de microhemoragie.", "diagnosis": "Adenoame tubulare cu displazie de grad redus.", "doctor": 31}, {"gross_exam": "In acelasi recipient au sosit doua fragmente  cu dimensiuni de 0,6/0,4/0,4 cm, respectiv 0,6/0,4/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica, ambele cu modificari histopatologice caracteristice adenomului tubular cu displazie de grad redus si focare de displazie de grad inalt.", "diagnosis": "Adenom tubular cu focare de displazie de grad inalt.", "doctor": 78}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit trei fragmente cu dimensiuni de 1,6/0,3/0,2 cm, 0,5/0,4/0,3 cm, respectiv 0,5/0,4/0,3 cm.Piesa 2:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,7/0,4/0,4 cm, respectiv 0,3/0,2/0,2 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica si un fragment de mucoasa ileala. Acestea isi pastreaza arhitectura si prezinta la nivelul corionului infiltrat inflamator mixt (limfocite, plasmocite, neutrofile, eozinofile) in cantitate moderata, dispus difuz. Se mai observa edem si arii de microhemorgii. Pe suprafata mucoasei se observa detritusuri celulare, fibrina si numeroase colonii bacteriene.", "diagnosis": "Polip colonic hiperplazic.", "doctor": 33}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit trei fragmente care cumulat masoara 0,5/0,5/0,3 cm.Piesa 2:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,5/0,4/0,3 cm, respectiv 0,4/0,4/0,2 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa antrala de aspect polipoid cu hiperplazie foveolara marcata si cu rare glande antrala dilatate. La nivelul corionului se observa vase cu staza moderata, fibre musculare netede care urca spre suprafata si infiltrat inflamator limfo-plamocitar redus.Pe sectiunile examinate nu se observa displazie, metaplazie, activitate sau Helicobacter pylori.", "diagnosis": "Gastrita atrofica.", "doctor": 34}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,4/0,3/0,3 cm, respectiv 0,4/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip corporeal cu hiperplazie foveolara minima si cu pigment biliar pe suprafata mucoasei. Corionul superficial contine vase cu staza moderata si arii de microhemoragie. Glandele gastrice prezinta vacuolizari citoplasmatice si seratii luminale, caractere intalnite in tratamentul cu inhibitori de pompa de protoni.Pe sectiunile examinate, colorate in hematoxilina-eozina, nu se observa inflamatie, activitate, metaplazie, displazie sau Helicobacter pylori.", "doctor": 30}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,4/0,3/0,3 cm, respectiv 0,4/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica cu modificari histopatologice corespunzatoare adenomului tubular cu displazie de grad redus.", "diagnosis": "Adenom tubular cu displazie de grad redus.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,4/0,4/0,3 cm, respectiv 0,4/0,4/0,3 cm.", "microscopic_exam": "Materialul primit, prelucract in totalitate, este reprezentat de doua fragmente.Primul fragment este alcatuit din tesut fibro-conjunctiv, infiltrat inflamator neutrofilic abundent, tesut de granulatie, care prezinta pe suprafata exudat fibrino-purulent.Al doilea fragment este reprezentat de mucoasa de tip intestinal, cu arhitectura de mucoasa colonica, care prezinta arii extinse de tesut de granulatie, edem, infiltrat inflamator neutrofilic, arii de abcedare si exudat fibrino-necrotico-purulent pe suprafata. La nivelul criptelor se observa atipii reactive, iar in profunzime, musculara mucoasei este infiltrata de numeroase neutrofile.", "diagnosis": "Aspectul histopatologic descris, coroborat cu localizarea endoscopica a leziunii, corespunde unui ulcer rectal.", "doctor": 44}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 2/1,5/1 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa endometriala cu aspect histologic de faza proliferativa. La nivelul stromei se observa edem, microhemoragii si granuloame alcatuite din celule epitleioide, rare celule gigante multinucleate si o rama fina de limfocite.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (16 plasmocite/10HPF)", "diagnosis": "Endometrita granulomatoasa.Comentarii:Etiologia endometritei granulomatoase este variata, aceasta poate fi determinata de urmatoarele entitati:-prezenta dispozitivului intrauterin-antecedente de ablatie endometriala-tuberculoza-infectii fungice/parazitare-infectii virale (CMV)-sarcoidoza", "doctor": 33}, {"gross_exam": "S-a receptionat un recipient inscriptionat cu numaru 2. Acesta contine fragmente tisulare foarte mici si flocoane, care cumulat masora 0,8/0,6/0,1 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hematice care inglobeaza celule dispersate si cateva fragmente foarte mici de mucoasa endocervicala.Pe sectiunile examinate nu se observa mucoasa endometriala.?????Sa mai tarifez CD138?", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare la baza epiteliului endocervical.", "doctor": 54}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,6/1,4/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala, unele de aspect polipoid, alcatuite din glande proliferative dilatate, sinuase si stroma hipercelulara cu numerose structuri vasculare dispuse in manunchiuri.", "diagnosis": "Polip endometrial.", "doctor": 29}, {"gross_exam": "Piesa 1:Piesa de rezectie chirurgicala cu dimensiuni de 5/4/0,2 cm, reprezentata de camasa de chist.Piesa 2:In acelasi recipient au sosit:-\tMultiple fragmente tisulare care cumulat masoara 4,5/4/1 cm, reprezentate de fragmente tumorale si coaguli de sange.-\tPiesa chirurgicala cu dimensiuni de 11,5/5,5/4,3 cm, acoperita partial de seroasa si coaguli hematici. Focal, suprafata are aspect anfractuos, care pe sectiune se continua cu o formatiune tumorala albicioasa, cu arii galbui. Formatiunea tumorala pare inconjurata de un perete fibros, care focal prezinta plan de clivaj cu tumora.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de perete chistic alcatuit din epiteliu aplatizat, unistratificat, peret fibros si tesut adipos.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "diagnosis": "Aspectul histopatologic descris, coroborat cu profilul imunohistochimic, corespunde unui carcinom cu celule renale NOS cu histologie sarcomatoida. ", "immuno_examination": "PAX8 – pozitiv la nivelul celulelor tumoraleCK7- pozitiv la nivelul celulelor tumoraleCD10 – pozitiv la nivelul celulelor tumoraleVimentin – pozitiv la nivelul celulelor tumoralePLAP – negativOCT3/4 – negativCD30 – negativGATA3 – negativcKIT (CD117) – negativ", "medical_codes": "ICD-O: 8213/9", "doctor": 54}, {"gross_exam": "Piesa 1:Piesa de prostatectomie radicala cu greutatea de 66 grame, care masoara 5,4/6/5 cm, cu vezicula seminala stanga de 3,5 cm lungime, vezicula seminala dreapta de 3 cm lungime, duct deferent stang de 4,1 cm lungime si duct deferent drept de 3 cm lungime.Marginile de rezectie chirurgicale au fost marcate dupa cum urmeaza: anterior-albastru, posterior-negru, lateral stanga-verde, lateral dreapta rosu.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 7/6/2,5 cm, reprezentate de tesut adipos si limfoganglioni.", "microscopic_exam": "Piesa 1:Margine de rezectie apex- negativa tumoral;Margine de rezectie ducte deferente- negative tumoral, bilateral;Margine de rezectie baza prostata- negativa tumoral;Toate marginile chirurgicale de rezectie periprostatice trec in tesut sanatos. Cea mai apropiata margine de rezectie laterala este situata la o distanta submilimetrica de formatiunea tumorala, in regiunea latero-posterioara stanga, nivel mediu.Insertia prostatica a veziculelor seminale- negativa tumoral, bilateral.Parenchimul prostatic prezinta multiple focare de adenocarcinom acinar prostatic. Focarul dominant este reprezentat de carcinom acinar, scor Gleason  4 + 5 =  9, grup de grad 5, localizat preponderent in lobul stang, etajele  apex, mediu si care ocupa aproximativ 10% din suprafata examinata a glandei prostatice.  Din suprafata tumorala examinata a focarului dominant, 90% este ocupata de componenta primara, 10% de componenta secundara. Formatiunea tumorala invadeaza tesutul adipos periprostatic. Restul focarelor de adenocaricinom acinar prostatic au scor Gleason 3+3 = 6, grup de grad 1 si sunt diseminate in ambii lobi prostatici, pe toate nivelurile.Sunt prezente structuri cribriforme.Emboli tumorali venosi prezenti.(V1)Fara prezenta embolilor tumorali limfatici pe sectiunile examiante.(L0)Infiltare tumorala perineurala prezenta.(Pn1)Sunt prezente focare de neoplazie intraepiteliala prostatica de grad inalt (HG PIN) si focare de carinom intraductal.Parenchimul prostatic netumoral prezinta: arii de hiperplazie nodulara si infiltrat inflamtor mixt atat stromal cat si intraglandular. Periprostatic se observa numeroase structuri vasculare trombozate.Periprostatic s-a identificat si examinat un limfoganglion fara elemente histoptologice de malignitate. (0/1)Piesa 2:S-au decelat si examinat 13 limfoganglioni cu histiocitoza sinusala, involutie adipoasa si arii de hialinizare. Pe sectiunile examinate nu se observa metastaze. (0/13)", "diagnosis": "Adenocarcinom acinar prostatic, scor Gleason 4+5= 9, grup de grad 5, pT3aN0Mx L0V1Pn1R0. ", "medical_codes": "ICD-O:8140/3.", "doctor": 32}, {"gross_exam": "Piesa 1:Capsula periprotetica cu dimensiuni de 15/12/0,4 cm.Piesa 2:Capsula periprotetica cu dimensiuni de 17/12/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul examinat este reprezentat de perete fibro-conjunctiv cu artefacte de cauterizare pe una dintre fete si cu testut de granulatie abundent pe cealalta fata. Focal se observa celule gigante multinucleate de corp strain si infiltrat inflamator limfo-plasmocitar dispus difuz in cantitate redusa.", "immuno_examination": "    ALK (CD246) – reactie absenta in materialul examinat.    CD30 – reactie absenta in materialul examinat.", "doctor": 1}, {"immuno_examination": "    ALK (CD246) – reactie absenta in materialul examinat.    CD30 – reactie absenta in materialul examinat.", "microscopic_exam": "Piesa 1:Materialul examinat este reprezentat tesut fibros dens, tesut adipos care contine vase cu trombi si tesut muscular striat.", "doctor": 33}, {"gross_exam": "Piesa de excizie tegumentara cu dimensiuni de 1/0,5/0,3 cm, eliptica, marcata si orientata, care prezinta pe suprafata tegumentului o papula gri-albicioasa, imprecis delimitata, cu diametrul de 0,4 cm, aparent in contact cu marginea de rezectie superioara, la 0,3 cm de marginea de rezectie mediala, la 0,2 cm de marginea de rezectie laterala si la 0,1 cm de marginea de rezectie inferioara.", "microscopic_exam": "Sectiunile prelevate si examinate de la nivelul papulei descrise macroscopic releva un carcinom bazocelular, nodular, care invadeaza tegumentul pe o distanta de  1 mm (Breslow), pana la jonctiunea dermului reticular cu cel papilar (Clark III). Dermul adiacent formatiunii tumorale prezinta infiltrat inflamator marcat, alcatuit din limfocite si plasmocite.Formatiunea tumorala este situata la 1 mm de marginea de rezectie superioara, 1,5 mm de marginea de rezectie inferioara, 2 mm de marginea de rezectie laterala, 2,5 mm de marginea de rezectie mediala si la 2 mm de marginea de rezectie profunda.Pe sectiunile examinate nu se observa invazie angio-limfatica sau infiltrare tumorala perineurala.Dermul papilar adiacent prezinta elastoza solara moderata.", "diagnosis": "Carcinom bazocelular nodular pT1NxMx L0V0R0.", "doctor": 30}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,4/0,2/0,2 cm, respectiv 0,4/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de mucoasa colonica cu arhitectura criptelor pastrata, fara modificari adenomatoase si care prezinta la nivelul corionului congestie vasculara marcata, hemoragie interstitiala si infiltrat inflamator limfo-plasmocitar moderat, dispus difuz si in foliculi limfoizi.", "doctor": 28}, {"gross_exam": "In acelasi recipient au sosit trei fragmente cu dimensiuni de 0,5/0,4/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa gastrica de tip corporeal, care prezinta la nivelul corionului superficial vase cu staza moderata.Pe sectiunile examinate nu se observa inflamatie, displazie, metaplazie, activitate sau Helicobacter pylori.", "diagnosis": "Aspectul histopatologic descris este compatibil cu gastrita congestiva.", "doctor": 28}, {"gross_exam": "Colecist cu lungimea de 10 cm, sosit sectionat si evacuat partial. In lumen este prezent material vascos, de culoare verzuie si un calcul biliar.", "microscopic_exam": "Materialul examinat este reprezentat de colecist, care prezinta, la nivelul corionului si la nivelul stratului muscular, infiltrat inflamator limfo-plasmocitar in cantitate moderata, dispus difuz si in pseudofoliculi limfoizi. Focal se observa arii de eroziune si atipii epiteliale regenerative.", "diagnosis": "Colecistita cronica litiazica.", "doctor": 30}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,3/1,4/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala cu aspect histologic de faza proliferativa. La nivelul stromei endometriale se observa arii de hemoragie si edem.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (65 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 44}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,8/1,7/0,7 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala aflate in faza proliferativa tardiva a ciclului endometrial. Focal se observa arii de hemoragie si edem la nivelul stromei.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (15 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.", "doctor": 78}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,5/1,5/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala cu aspect histologic de faza proliferativa. Unele dintre fragmente prezinta raportul glande/stroma crescut, cu glande aglomerate, cu stroma minima interpusa intre acestea.", "immuno_examination": "Imunomarcajul CD138 evidentiaza celule plasmocitare in stroma endometriala. (50 plasmocite/10HPF)", "diagnosis": "Endometrita cronica.Hiperplazie endometriala simpla, fara atipii.", "doctor": 30}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit multiple fragmente tisulare care cumulat masoara 2/2/0,4 cm.Piesa 2:In acelasi recipient au sosit multiple fragmente tisulare cu dimensiuni cumulate de1,5/0,7/0,5", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare care inglobeaza fragmente de mucoasa endometriala alcatuite din glande, unele cu aspect histologic de faza secretorie tardiva, altele cu fenomene de colaps. La nivelul stromei endometriale se observa fenomene de colaps intalnite in faza menstruala a ciclului endometrial.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "diagnosis": "Endometru de faza menstruala.", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 5/4,3/1 cm.", "microscopic_exam": "Materialul examinat este alcatuit din fragmente de decidua, vilozitati corioale cu aspect histologic de trimestul I si fragmente de membrane amniotice. La nivelul deciduei se observa infiltrat inflamator limfo-plasmocitar minim, dispus perivascular si vase cu trombi. Vilozitatile corioale contin vase cu hematii fetale, unele sunt edematiate, iar altele prezinta fibrina pe suprafata. La nivelul membranelor amniotice se observa focal o arie de calcificare.", "diagnosis": "Sarcina cu aspect histologic de trimestrul I oprita in evolutie.", "doctor": 1}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 0,6/0,4/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa gastrica de tip antral. Acestea prezinta hiperplazie foveolara moderata, exocitoza neutrofilica marcata in epiteliul de suprafata, infiltrat inflamator marcat mixt (limfocite, plasmocite, neutrofile) in corion si fenomene de activitate extinse. La nivelul foveolelor se observa Helicobacter pylori HP+++. Focal se observa, eroziuni si modificari epiteliale regenerative, iar pe suprafata unui fragment este prezent exudat fibrino-hemato-leucocitar abundent.Pe sectiunile examinate nu se observa metaplazie sau displazie.", "diagnosis": "Gastrita acuta eroziva, cu activitate marcata, inflamatie mixta marcata, HP+++.", "doctor": 43}, {"gross_exam": "Piesa 1:Fragment tisular cu dimensiuni de 0,5/0,4/0,3 cm.Piesa 2:Fragment tisular cu dimensiuni de 1,1/0,3/0,2 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa colonica cu modificari histopatologice caracteristice adenomului tubular cu displazie de grad redus.", "diagnosis": "Polip colonic hiperplazic.Lipom colonic submucos.", "doctor": 28}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,3/0,3/0,2 cm, respectiv 0,3/0,3/0,2 cm.Piesa 2:Fragment tisular cu dimensiuni de 0,3/0,3/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip antral. Acestea prezinta hiperplazie foveolara minima, fibroza minima, atrofie minima si congestie moderata. Glandele gastrice prezinta focal vacuolizari si seratii, caracteristici histologice intalnite in tratamentul cu inhibitori de pompa de protoni.Pe sectiunile examinate nu se observa metaplazie, displazie, inflamatie, activitate sau Helicobacter pylori.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa gastrica de tip corporeal care prezinta la nivelul corionului superficial vase cu staza moderata. La nivelul corionului profund sunt prezente rare eozinofile. Focal sunt prezente decolari epiteliale in suprafata, insa fara fenomene inflamatorii.Pe sectiunile examinate nu se observa displazie, metaplazie, inflamatie, fenomene de activitate sau Helicobacter pylori.", "diagnosis": "Aspectul histopatologic descris, coroborat cu datele clinice, poate corespunde gastropatiei de reflux.", "doctor": 35}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit:-\tPiesa de prostatectomie radicala cu greutatea de 85 grame, cu dimensiuni de 6,5/6,8/4,5 cm. Veziculele seminale nu sunt decelabile. Piesa de prostatectomie a fost marcata cu tus dupa cum urmeaza: anterior – tus albastru, posterior – tus negru, lateral dreapta – tus rosu, lateral stanga – tus verde.-\tMultiple fragmente care cumulat masoara 2,2/2,2/0,6 cm, reprezentate de tesut adipos si coaguli.Piesa 2:Fragment tisular nemarcat si neorientat cu dimensiuni de 0,7/0,5/0,3 cm.Piesa 3:In acelasi recipient au sosit multiple fragmente care cumulat masoara 7,5/6/1,5 cm, dintre care, trei fragmente au aspect macroscopic de vezicula seminala.", "microscopic_exam": "", "doctor": 35}, {"microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala cu aspect histologic de faza proliferativa tardiva. La nivelul stromei sunt prezente arii de edem si microhemoragii.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 54}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,8/1,5/0,6 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de multiple fragmente de mucoasa endometriala alcatuite din glande si stroma endometriala cu aspect histologic de faza proliferativa. Focal se observa arii de microhemoragie la nivelul stromei.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 43}, {"gross_exam": "In acelasi recipient au sosit multiple fragmente care cumulat masoara 1,7/1,5/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de mase fibrino-hemato-leucocitare care inglobeaza fragmente de mucoasa endometriala cu aspect histologic de faza proliferativa.", "immuno_examination": "Imunomarcajul CD138 nu evidentiaza celule plasmocitare.", "doctor": 35}, {"gross_exam": "In acelasi recipient au sosit doua piese de excizie tegumentara:-\tPiesa de excizie tegumentara 1 este eliptica, masoara 1/0,6/0,7 cm si prezinta pe suprafata o formatiune papilomatoasa, cu dimensiuni de 0,6/0,4 cm, situata la 0,1 cm de cea mai apropiata margine de rezectie laterala.-\tPiesa de excizie tegumentara 2 este eliptica, masoara 2,7/1,5/1,2 cm si prezinta pe suprafata o formatiune tumorala supradenivelata, de aspect conopidiform, cu dimensiuni de 2,1/1,2 cm, situata tangent la marginea de rezectie laterala.", "microscopic_exam": "Piesa de excizie tegumentara 1:Materialul primit, prelucrat in totalitate, este reprezentat de tegument care prezinta pe suprafata o formatiune papilomatoasa, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul jonctiunii dermo-epidermale si dermului, cu minime atipii citologice, fara atipii arhitecturale, cu fenomene de maturare in profunzime. Celule nevice inglobeaza anexele tegumentare. Marginile de rezectie sunt libere.Piesa de excizie tegumentara 2:Sectiunile prelevate si examinate de la nivelul formatiunii tumorale descrise macroscopic releva o keratoza seboreica, varianta papilomatoasa, alcatuita din acantoza epidermului cu papilomatoza si cu prezente de numeroase chiste cornoase. Stratul bazal epidermal este hiperpigmentat.Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "diagnosis": "Nev papilomatos compus, cu caractere de nev congenital, excizat in totalitate.Keratoza seboreica, varianta papilomatoasa, excizata in totalitate.", "doctor": 1}, {"gross_exam": "Piesa 1:In acelasi recipient au sosit doua fragmente tisulare care cumulat masoara 0,4/0,3/0,2 cm.Piesa 2:Fragment tisular cu dimensiuni de 0,5/0,4/0,3 cm.Piesa 3:In acelasi recipient au sosit trei fragmente care cumulat masoara 1/0,7/0,3 cm.Piesa 4:In acelasi recipient au sosit multiple fragmente tisulare care cumulat masoara 1/0,4/0,3 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip antral cu hiperplazie foveolara moderata, arii de eroziune si pigment biliar pe suprafata. La nivelul corionului se observa vase cu staza moderata si minim infiltrat inflamator mixt ( limfocite, plasmocite, rare neutrofile) dispus focal. Sunt prezente doua glande antrale cu fenomene de activitate de tipul cripitei in imediata vecinatate a eroziunii.Pe sectiunile examinate nu se observa displazie, metaplazie, granuloame sau Helicobacter pylori.Piesa 2:Materialul primit, prelucrat in totalitate, este reprezentat de un fragmente de mucoasa ileala cu arhitectura cripte/vili pastrata, care prezinta la nivelul corionului edem moderat, congestie moderata si minim infiltrat inflamator limfo-plasmocitar dispus focal.Pe sectiunile examinate nu se observa fenomene de activitate, cronicitate sau granuloame.Piesa 3:Materialul primit a fost prelucrat in totalitate si este reprezentat de trei fragmente de tub digestiv, doua cu aspect histologic de mucoasa ileala si unul cu aspect histologic de mucoasa colonica.Fragmentul de mucoasa colonica prezinta o arie extinsa de eroziune, focal cu fenomene de reepitelizare si infiltrat inflamator abundent, dispus difuz atat la nivelul corionului cat si la nivelul muscularis mucosa, alcatuit din limfocite, plasmocite, eozinofile si numeroase polimorfonucleare. Aproximativ 50% din cripte prezinta activitate (criptita, abcese criptice).Celalate doua fragmente de mucoasa ileala isi pastreaza arhitectura si prezinta infiltrat inflamator moderat, mixt, dispus difuz si in foliculi limfoizi. Este prezenta o arie de ulceratie pe unul dintre fragmente. Cele doua fragmente ileale nu contin fenomene de activitate pe sectiunile examinate.Piesa 4:Materialul primit, prelucrat in totalitate, este reprezentat de 6 fragmente de mucoasa colonica, unele prezentand rare cripte cu usoare modificari arhitecturale. Infiltratul inflamator de la nivelul corionului este mixt (limfocite, plasmocite, eozinofile, neutrofile) si are intensitate diferita in functie de fragment. Focal sunt prezente si fenomene de activitate (criptita, abcese criptice).", "diagnosis": "Aspectul histologic descris, in context clinic adecvat, poate corespunde bolii Crohn.", "doctor": 30}, {"gross_exam": "Piesa de excizie tegumentara cu dimensiuni de 1,4/0,4/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument, care prezinta la nivelul dermului profund o formatiune chistica tapetata de epiteliu scuamos, stratificat, keratinizat, cu stratul granular pastrat. Nu se observa anexe tegumentare adiacente formatiunii chistice. Restul dermului contine numerosi foliculi pilosi, dilatati, cu detritusuri si keratina in lumen.", "diagnosis": "Chist epidermoid.", "doctor": 34}, {"gross_exam": "Piesa 1:Piesa de prostatectomie radicala cu greutatea de 71 grame, care masoara 4.5/5.2/3.5 cm, cu vezicula seminala stanga de 5 cm lungime, vezicula seminala dreapta de 5 cm lungime, duct deferent stang de 4.5 cm lungime si duct deferent drept de 5 cm lungime.Marginile de rezectie chirurgicale au fost marcate dupa cum urmeaza: posterior - negru, anterior - albastru, lateral stanga - verde, lateral dreapta - rosu.Piesa 2:In acelasi recipient au sosit multiple fragmente care cumulat masoara 9/6,5/2 cm.Piesa 3:Piesa de excizie chirurgicala cu dimensiuni de 3,5/1,7/0,5 cm.", "microscopic_exam": "Piesa 1:Margine de rezectie apex- negativa tumoral, situata la o distanta submilimetrica de formatiunea tumorala;Margine de rezectie ducte deferente- negative tumoral, bilateral;Margine de rezectie baza prostata- negativa tumoral;Toate marginile chirurgicale de rezectie periprostatice trec in tesut sanatos.Insertia prostatica a veziculelor seminale- negativa tumoral, bilateral.Parenchimul prostatic prezinta doua focare de adenocarcinom acinar prostatic, ambele avand scorul Gleason  3 + 4 =  7, grup de grad 2. Focarul dominant este localizate in lobul drept, etajele  apex, mediu, baza si care ocupa aproximativ 15% din suprafata examinata a glandei prostatice.  Din suprafata tumorala examinata 70% este ocupata de componenta primara, 30% de componenta secundara. Formatiunea tumorala invadeaza tesutul adipos periprostatic. Al doilea focar de adenocarcinom acinar este prezent in lobul stang, nivel apex si ocupa aproximativ 1 % din suprafata examinata a prostatei.Sunt prezente structuri cribriforme.Fara prezenta invaziei venoase  pe sectiunile examinate.(V0)Fara prezenta embolilor tumorali limfatici pe sectiunile examiante.(L0)Infiltare tumorala perineurala prezenta.(Pn1)Sunt prezente focare de neoplazie intraepiteliala prostatica de grad inalt (HG PIN).Parenchimul prostatic netumoral prezinta arii de hiperplazie nodulara si focare de reactie giganto-celulara de corp strain. Plexurile venoase periprostatice prezinta trombi fibrino-hemato-leucocitari.Piesa 2:S-au decelat si examinat 11 limfoganglioni, care prezinta involutie adipoasa, arii de hialinizare si calcificari. Pe sectiunile examinate nu se observa metastaze. (0/11)Piesa 3:Materialul primit, prelucrat in totalitate, este reprezentat de fragmente de parenchim prostatic, tesut conjunctiv si fibre musculare striate. Pe sectiunile examinate nu se observa elemente histopatologice de malignitate.", "diagnosis": "Adenocarcinom acinar prostatic, scor Gleason 3+4 = 7, grup de grad 2, pT3aN0Mx L0V0Pn1R0.", "doctor": 30}, {"gross_exam": "In acelasi recipient au sosit patru fragmente care cumulat masoara 1/0,5/0,3 cm.Microsopie:Materialul primit, prelucrat in totalitate, este reprezentat de patru fragmente de mucoasa gastrica, trei de tip corporeal si unul de tip antral.Fragmentele de mucoasa gastrica de tip corporeal prezinta congestie vasculara moderata si edem redus in corionul superficial.Fragmentul de mucoasa gastrica antrala prezinta hiperplazie foveolara, metaplazie intestinala completa, congestie vasculara moderata, microhemoragii si atrofie moderata.Pe sectiunile examinate nu se observa displazie, inflamatie, activitate sau Helicobacter pylori.", "doctor": 35}, {"gross_exam": "Piesa de excizie tegumentara cu dimensiuni de 1,4/0,7/0,7 cm, care prezinta pe suprafata o formatiune nodulara supradenivelata cu dimensiuni de 0,5/0,4 cm, situata la 0,2 cm de cea mai apropiata margine de rezectie laterala.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de tegument, care contine o proliferare de celule melanocitare dispuse in cuiburi la nivelul dermului, fara atipii citologice sau arhitecturale, cu fenomene de maturare in profunzime. Marginile de rezectie sunt libere.", "diagnosis": "Nev dermal excizat in totalitate.", "doctor": 1}, {"gross_exam": "In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,4/0,2/0,2 cm, respectiv 0,4/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa intestinala cu arii de ulceratie, exocitoza neutrofilica in epiteliul de suprafata si fenomene de activitate marcata, reprezentate de criptita si abcese criptice. Corionul contine infiltrat inflamator marcat, dispus difuz, alcatuit din limfocite, plasmocite si neutrofile.", "diagnosis": "Aspectul histopatologic descris, in context clinic adecvat, este compatibil cu boala Crohn.", "doctor": 33}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,5/0,4/0,4 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa gastrica de tip antral cu metaplazie intestinala completa in proportie de 20%. Focal este prezenta o arie de eroziune in curs de reepitelizare. Corionul contine infiltrat inflamator mixt (limfocite, plasmocite, neutrofile) dispus difuz si in pseudofoliculi limfoizi.Pe sectiunile examinate, colorate in hematoxilina-eozina, nu se observa displazie, activitate sau Helicobacter pylori.", "diagnosis": "Gastrita cronica eroziva.", "doctor": 35}, {"gross_exam": "Fragment tisular cu dimensiuni de 0,3/0,2/0,2 cm.", "microscopic_exam": "", "doctor": 54}, {"gross_exam": "Piesa 1:Capsula periprotetica cu dimensiuni de 9,5/7,5/0,5 cm.Piesa 2:Capsula periprotetica cu dimensiuni de 9/7/2 cm.", "microscopic_exam": "Piesa 1:Materialul examinat este reprezentat de capsula periprotetica alcatuita din tesut adipos, lobuli de glanda mamara, fascicule de muschi striat si perete fibros dens acoperit de metaplazie synoviala. Focal, se observa infiltrat inflamator limfo-plasmocita minim.", "immuno_examination": "ALK (CD246) – reactie absenta in materialul examinat.CD30 – reactie absenta in materialul examinat.", "doctor": 44}, {"gross_exam": "Piesa 1:Fragment tisular cu dimensiuni de 0,4/0,3/0,3 cm.Piesa 2:In acelasi recipient au sosit doua fragmente cu dimensiuni de 0,5/0,3/0,3 cm, respectiv 0,5/0,3/0,2 cm.", "microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de un fragment de mucoasa gastrica de tip piloric cu hiperplazie foveolara minima si cu pigment biliar pe suprafata. Focal se observa o arie de eroziune acoperita de fibrina. Corionul contine vase cu staza moderata si infiltrat inflamator limfo-plasmocitar minim dispus difuz. Focal se observa Helicobacter pylori in mucusul de suprafata HP+.Pe sectiunile examinate nu se observa metaplazie, displazie sau fenomene de activitate.Piesa 2:", "doctor": 1}, {"microscopic_exam": "Piesa 1:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa duodenala. Unul dintre fragmente prezinta aplatizarea focala a vilozitatilor intestinale, posibil in contextul unei eroziuni, iar limfocitoza intraepiteliala este in limite normale. Ambele fragmente contin la nivelul corionului staza vasculara moderata si infiltrat inflamator limfo-plasmocitar dispus difuz in cantitate moderataPe sectiunile examinate nu se observa displazie, fenomene de activitate sau Giardia intestinalis.", "diagnosis": "Ileocolita nespecifica.Piesa 3:Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa colonica cu arhitectura criptelor si secretia de mucus pastrate, care prezinta la nivelul corionului staza vasculara marcata, arii de microhemoragie si minim infiltrat inflamator limfo-plasmocitar dispus difuz.Fara elemente histopatologice de specificitate pe sectiunile examinate.", "doctor": 1}, {"gross_exam": "In acelasi recipient au sosit doua fragmente tisulare cu dimensiuni de 0,5/0,3/0,3 cm, respectiv 0,4/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente de mucoasa gastrica de tip corporeal cu arii extinse de eroziune si pigment biliar in suprafata. Glandele corporeale sunt dilatate si vacuolizate, aspecte intalnite mai frecvente in tratamentul cu inhibitori de pompa de protoni, dar nu numai. Corionul contine vase cu staza marcata si rare celule inflamatorii, reprezentate de limfocite, plasmocite si polimorfonucleare. Focal, subepitelial sunt prezente arii de microhemoragie.", "diagnosis": "Aspectul histopatologic descris, este compatibil cu gastropatia de reflux biliar.", "doctor": 28}, {"gross_exam": "In acelasi recipient au sosit doua fragmene tisulare cu dimensiuni de 0,2/0,2/0,2 cm, respectiv 0,4/0,3/0,3 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de doua fragmente tisulare invadate de o formatiune tumorala maligna alcatuita din structuri tubulare tapetate de celule cu raportul nucleu/citoplasma crescut, pleomorfism moderat si numeroase mitoze. Peritumoral stroma prezinta desmoplazie moderata si infiltrat inflamator mixt (limfocite, plasmocite, polimorfonucleare) in cantitate crescuta. Se mai observa arii de ulceratie si vase cu trombi fibrilari.", "diagnosis": "Aspectul histopatologic descris, coroborat cu datele clinice, corespunde adenocarcinomului esofagian moderat diferentiat G2. ", "medical_codes": "ICD-O: 8140/3", "doctor": 1}, {"gross_exam": "In acelasi recipient au sosit trei fragmente tisulare fiecare avand dimensiuni de 0,3/0,2/0,2 cm.", "microscopic_exam": "Materialul primit, prelucrat in totalitate, este reprezentat de trei fragmente de mucoasa gastrica de tip antral care prezinta arii de hiperplazie foveolara moderata si arii de eroziune. Atat epiteliul de suprafata cat si epiteliul glandular prezinta fenomene de activitate reprezentate de neutrofilie intraepiteliala. Corionul contine infiltrat inflamator marcat, alcatuit din limfocite, plasmocite si neutrofile, dispus atat difuz cat si in pseudofoliculi limfoizi. Sunt prezente arii de displazie gastrica de tip intestinal, de grad redus. La nivelul mucusului de suprafata se observa Helicobacter pylori HP++.", "diagnosis": "Gastrita cronica cu inflamatie marcata, activitate moderata, displazie de grad redus, HP++.", "doctor": 44}]